[{"title": "Time Wasters", "text": "\"Lenders can only lend up to 80% of the value, and then the difference of that and what you owe is the amount of money you will be able to take out.\"This information could have been displayed on the main page, or as a pop-up notification, or essentially put anywhere that people would see it and know not to waste their time.  Instead, I lost over 30 minutes applying and speaking to a representative.  When I asked the rep, \"Fred\", if this information could be included to save other people wasted time, he ended the conversation.  I am not impressed with their customer service or lack of transparency.", "rating": 2}, {"title": "I was approved for and got a loan for…", "text": "I was approved for and got a loan for my mortgage 2years ago. i have been paying the mortgage every month consistently until five months ago when i missed payments due to unforeseen circumstances, i explained this to my agents and submitted documents to prove the situation was out of my power; this situation made my credit score to drop by 200+pts but luckily for me, Credit-Restoration Hub boosted the score for me to 800s and they are still looking to improve it. they even cleared the payments that these guys kept blackmailing my life over. I would not advise anyone to deal with them if you do not want them to ruin your credit.", "rating": 2}, {"title": "Closing payoff were super delayed.", "text": "Closing payoff were super delayed.A week a half after signed closing docsClosing department still asking for payoffsUnacceptable It was resolved thanks to me getting the payoff from BMO not only once by three timeAgain this was a week and a half after me having the notarized the final docsIf I didn’t get involved this was going to take aleast another week.", "rating": 2}, {"title": "There was constant miscommunication…", "text": "There was constant miscommunication between RM and my wife and I. Adding our checking account to the online forms, then at closing only to have it still messed up and delayed receiving funds for a full week. They kept saying that part of the refi was they send checks out to companies that I was paying off debt and I didn;t need to do anything. Well, a week after closing I got live checks in the mail which had me incurr anotyher $600 in interest and 2 late payments. There response was it was MY misunderstanding. And finally, I asked for a detailed break down of the funding and cost prior to signing. Was very specific that I wanted $xxx amount due at closing. I never saw that exact amount and it was one excuse after another. I really feel they rope you in to sign with them, then customer service goes out the window.", "rating": 2}, {"title": "Better explanation of what to expect…", "text": "Better explanation of what to expect after closing.  When told on day #3 that funds would be available and were not available until 1.5 days later and payoff checks were not received until 5 days later.  Effective communication is key.", "rating": 2}, {"title": "Loan too complicated to get especially…", "text": "Loan too complicated to get especially with our paid off house worth almost 5 times , the requested loan amount.", "rating": 2}, {"title": "The loan officer was ok", "text": "The loan officer was ok, however the fees are excessive. We were told the would match any differences but they did not… could not cancel without losing good faith deposit", "rating": 2}, {"title": "Shane never returned calls or texts", "text": "Shane never returned calls or texts. My closing was postponed a day due to asking for the same documents over and over and underwriting taking too long. Shane was ridiculous with customer service. Even once manager got involved it was a train wreck. I will NEVER recommend RM to anyone. Even with a higher interest rate I wish I had gone to local credit union and plan to refinance asap. ", "rating": 2}, {"title": "Our first closing date had canceled…", "text": "Our first closing date had canceled because we couldn’t answer the security question in two minutes. Next because of the cancellation with our closing, we had made payments to our creditors and now we have to wait to receive payment back from them. In most cases, they’re telling us 30 days or more. NICE!!!! ", "rating": 2}, {"title": "Not professional mortgage team", "text": "Licenced mortgage loan officer forgot the purpose for my refinance, he did not give me cash on hand. Also, I should have no payment for July,  but payment submitted, I have done a stop payment with the bank and I paid $30 for service fee which caused my bank account overdrawn. Then, another $34 insufficient fund charged . The closing is not professional.", "rating": 2}, {"title": " Disappointed ", "text": "This company can improve by being more forthright about their process. We were misinformed on several steps during this process and it cost us a lot of money in the end, money they did not tell us about. We only found out one day before closing.There were hidden cost that we found out about at the last minute which cost us thousands of dollars we were not told sooner that we would have to pay. We were switched from one person to the next during this process, no personal contact. We were very disappointed.", "rating": 2}, {"title": "Look out - LO tried to hide details to sell the loan", "text": "I received an offer from Rocket Mortgage with a really good rate. It turns out that the offer included a rate buy-down of $10,000+ which the LO did not inform me about. I don't do business with a lender who is hiding away information to make a sale. Upon telling the LO why I chose to go with another lender, he told me that I had stated that I was interested in a low rate and that he did make it clear what the total loan costs were. All of this is true - of course I am interested in a low rate - who wouldn't be? This is, however, not the same as being willing to buy down the rate (given most projections for future mortgage rates, buying the rate down at the moment actually looks like really bad advice). It is also true that he let me know what the total loan costs were - he just didn't tell me that there was a way of bringing those costs down significantly by not buying the rate down.I am almost certain that the LO made the offer with a rate buy-down intentionally to trick me into think it was a better offer than any competing offer I would receive. I even got an estimate for different terms, and I was surprised that the rate he offered was the same regardless of the loan maturity. In discussing this, he didn't mention anything about the rate buy-down, which would have been natural to bring up.", "rating": 2}, {"title": "Did not put a Lowe's Credit card on my…", "text": "Did not put a Lowe's Credit card on my loan it was 2,500 I'm really disappointed 😞Daniel Gonzales ", "rating": 2}, {"title": "1st time Rocket users, home mortgage.", "text": "Directly after starting this process I began receiving spam calls to my cell phone. I'm not talking about a few spam calls, I'm talking about enough calls, after a month or two, my frustration level became extremely high. I will be calling someone at Rocket to vent my frustration once I know all things are completed. This was absolutely ridiculous! Also, Rockets affiliates don't really work to good together. People didn't know what was happening, some couldn't do what we wanted, and we had to monitor the process ourselves to make sure everyone knew what was going on. This was on a level I did not expect.", "rating": 2}, {"title": "My lender was very nice but this whole…", "text": "My lender was very nice but this whole process was awful. Between wrong information and handling paperwork. This was an awful experience. Telling my wife to go with another company but she stuck with Rocket Mortgage until the end. It was not like this buying the house. Refinancing was a difficult process. Telling the lender the same info over and over. Then resending same info. Plus giving us the wrong info. Just awful. ", "rating": 2}, {"title": "Everything that went wrong did", "text": "Everything that went wrong did, lack of communication was a big factor with this. I almost didn’t close on time because of the title company they say is a sister company to them which has no relations to them tried moving my closing date past the date we had previously discussed and didn’t even have the decency to call me and tell me they moved the date back. Would not recommend using the title company they recommend ", "rating": 2}, {"title": "Closing Issues", "text": "Closing team left husband off of signature pages causing 10 day delay in closing. I had to initiate multiple phone calls in order to resolve issues that were Rocket's fault. Very difficult to get straightforward answers to questions regarding when funds will be disbursed even though closing documents have been completed and received by Rocket. No one has answered that question yet. Still waiting for my funds....", "rating": 2}, {"title": "Navigator Needed…", "text": "There was a lot of confusion about scheduling our closing, and it wasn’t until I reached out that the ball got rolling on that. Also, why does our banker just disappear once we’re ready to close? Can’t there be a mortgage navigator to sees us through the entire process?I also felt hounded in the beginning when approached about refinancing. Then we were deflated when our cash out wasn’t as much as we had expected it to be.", "rating": 2}, {"title": "Simple but needed Three Closings", "text": "The process was simple overall, but the paperwork was scrambled multiple times by Rocket.First they forgot my spouse on the paperwork entirely. The second time they had her last name incorrect (and not even her maiden name, but a completely incorrect last name). Luckily I found that myself and had it corrected. The third time they did not add her paperwork to the closing package. By the time it was all done, I had to close three times on the same loan... ", "rating": 2}, {"title": "You repeatedly changed our closing…", "text": "You repeatedly changed our closing date. We TOLD you June 28… We had it written down… Then we got a call about closing April 16. After that, it was May 8, then May 28… Once we got to June 25, we got tired of being messed around with. THEN y’all couldn’t get the closing papers pit together in time for the notary. Our original appointment was at 9AM, and because you were pussy footing around, we (me, my husband, the notary, and the owner of the house) waited for 3 HOURS on paperwork.", "rating": 2}, {"title": "This team was unprepared to service a…", "text": "This team was unprepared to service a jumbo loan. This large company processes so many small and medium sized loans that a jumbo is clearly too complex for the process.I highly recommend Rocket to the homebuyers across America buying fha houses or va homes.As far a homes in California, I made a mistake trusting their experience or lack of with a jumbo loan.It’s not for the sophisticated company owner or second home buyer.They tried but the underwriters had no idea what a 1031 exchange meant or how to interpret the documents", "rating": 2}, {"title": "It was a much harder process than what…", "text": "It was a much harder process than what I have experience with other loans. Stuff kept showing up on my dash board. Communications with my banker meant nothing regarding other people who assigned and reviewed tasks. No exaggeration, one day my wife recieved 7 different loan disclosures to sign and mail back. ", "rating": 2}, {"title": "Loan officer was expenses involved, too long term pricey. And a choice of one of Mortgage Insurance companies not demanding you get all that money. +$30, 000.00 in your coffers for doing nothing. Plus", "text": "Loan officer was great. But the rest of your people do not know how to read, are incompetent,  and only think within the box of their technical abilities.  Besides, poor communication skills, no common email links, phone numbers etc that identify RM clearly with your business information.  Unusable \"Secure Message \" site, not paying for it. Demanding persons. I only wanted to deal with one person. You need a more organized way of informing your clients of the expen", "rating": 2}, {"title": "Same issue on steroids", "text": "Rocket Mortgage has made our tracking and making our monthly installments by reversing our principal lender. Not to mention giving our email address to other companies that now spam us relentlessly. Nothing has been done yet to rectify the problem other than say we are sorry. That hasn't helped. 1", "rating": 2}, {"title": "Misleading amount of loan amount do to…", "text": "Misleading amount of loan amount do to extremely low appraisal by extremely incompetent appraisers. Led to believe by Rocket that it would be more. For the amount we paid Rocket we found follow up and work needed to be done by us when in fact it should have been done by Rocket or affiliates ", "rating": 2}, {"title": "Too many people involved during loan…", "text": "Too many people involved during loan process.   Never spoke or dealt with the same person for the month it took to process.  Still haven't gotten my monthly payment correct even though the final loan paperwork has the correct amount.", "rating": 2}, {"title": "Money down increased twice after being…", "text": "Money down increased twice after being told congratulations you bought a house. Increased $12k. Not enough communication between purchase specialist and Banker. Both asked for the same things multiple times. Had to upload and email all the same things multiple times. Didn’t appreciate one told our Realtor we weren’t communicating when we had many texts, email and phone logs. We referred our so. Who was buying a house (his first one ever) at the same time. He jumped through all their hoops, payed down his bills,was told congratulations you bought a home and at the end he was denied. I do not recommend. Use a local bank where you live!!", "rating": 2}, {"title": "Had a financing advisor tell me “no…", "text": "Had a financing advisor tell me “no disrespect intended, but your wife makes so much money it just doesn’t matter what you make.”  It was a crummy comment that made me feel as though I wasn’t contributing to my own family.  Rest of the process wasn’t bad, but that one comment brought down the whole experience.", "rating": 2}, {"title": "Sent me paper checks to mail for my…", "text": "Sent me paper checks to mail for my debt consolidation. Now I have to hope and pray that they actually get where they are going and that they get credited to my accounts. I had to even pay for certified mail just so I could at least have some sort of tracking. Seems completely ridiculous that Rocket would do it that way, and it's been very frustrating. Any other company would have just wired the money for me or sent to me directly, I pay off online and immediately, send confirmation, then done.I don't know if I'd use them again just because of that. ", "rating": 2}, {"title": "Terrible communication", "text": "From the beginning our loan officer didn’t reply to my wife’s emails for call backs. When I talked to the same individual, he seemed hurried and eager to get off of the phone. His answers were usually one or two word answers . Didn’t explain the process or what to expect. Then, once the loan closed I was told I have to physically send rocket mortgage issued checks to the individual creditors. That was never explained at all. Oh, wait …their sales crew are very skillful at getting you to commit so beware. Never again.", "rating": 2}, {"title": "When closing remember they send checks to pay your creditors !!!", "text": "Sending checks to pay your creditors in this day and age is old and antiquated, most companies have either an online method to pay or directly by phone . Otherwise it’s a 7-10 day plus processing time . Remember that when dealing with these people. Also don’t think your home is worth what you think it is as they value it less than you think . I closed with them but wouldn’t recommend them . Shop around for a better more modern deal ", "rating": 2}, {"title": "DISAPOINTING AND FRUSTRATING The checks we were sent to pay off our…", "text": "The checks we were sent to pay off our accounts were a hassell. We spent 100 dollars overnighting each one rather than put checks for thousands of dollars in the regular mail. We do paperless statements and two creditors didn't have statements. Then we had to make calls and find out where to overnight the checks to. With electronic transfers between institutions as acceptable transactions,  I don't understand this process. The whole transaction was not as smooth as prior closings. There was confusion and we received incorrect documents early in the process. The virtual closing was easy. Not the Rocket service we are use to and tell our friends about.", "rating": 2}, {"title": "Could Have Been Better Use of Time", "text": "Our loan specialist kept upping the interest rate from about 10% to 11.37%. Reasons given made me think it was a come-on or bait-n-switch. Because of the time committed, I thought we'd have answers sooner than later. Also, I was disappointed with the extreme qualification requirements as I compare my previous buying experiences during work with lenders.", "rating": 2}, {"title": "Have yet to receive a paper copy of my…", "text": "Have yet to receive a paper copy of my bill as requested.Was given wrong information about getting documents from the V.A.Wife and I were on speaker phone day 1 talking about the loan with Lucas and both of us taking notes.  We both wrote down and he said we could wave the cost of the appraisal.  I questioned him once I received the settlement sheet.  He said he never said it.  Funny, wife and I both had it in our notes.", "rating": 2}, {"title": "Your appraiser screwed us", "text": "Your appraiser screwed us by low balling our appraisal by 17,000 as compared to the home nextdoor that sold for significantly more and the owners hadn't done any upgrades to their home while we'd completed many.  Very unhappy with you guys.", "rating": 2}, {"title": "Took way too long to get approved", "text": "Took way too long to get approved. Every day for over a month you kept requesting more and more documents. I kept sending receipts, check stubs, statement copies, w-2 copies. Multiple years of returns etc, etc, etc. I spend hours and hours talking to the loan officer and sending documents. I was tired, frustrated and at one point I even requested  to end the request for the loan,  but I felt that i had invested so much time and energy that I decided to continue with the loan. However Rocket mortgage left a bad taste in my mouth and if I  had to do thus again I would never choose  Rocket Mortgage and I would not refer any friends or family to Rocket Mortgage.  ", "rating": 2}, {"title": "None of my financial objectives were…", "text": "None of my financial objectives were accomplished.  We did get the funds we requested, but RM decided which debts to pay.  This was even after discussing what I wanted with a client rep.  I wanted cash for a small home improvement project, didn't get it either, funds were used on other debt.  I'm whining, but they asked was I happy.", "rating": 2}, {"title": "Very poor appraisal", "text": "Very poor appraisal. Keep changing interest rate. When was borrowing from my equative in my home rate was to damn high for using my own money. Another example of working person vs rich no just in this world. Will not be using rocket mortgage in the future. Will being paying this off as fast as I can.", "rating": 2}, {"title": "Told pre-approved but found out not really", "text": "I thought everything was pre-approved and reviewed.  Turned out nothing pre-approved and the items they told me were complete had to be redone delaying closing, and me without a home.  I thought I had a lower rate but because no pre-approval, lock, I got stuck with a higher rate.  Very poor experience.", "rating": 2}, {"title": "I’m waiting for the checks to be received by the creditors", "text": "I’m waiting for the checks to be received by the creditors I mailed the a week ago but nothing yet …so I’m still paying bills. But you have no problem sending be a bill for the 1st payment…unreal!", "rating": 2}, {"title": "To confusing ", "text": "Would have been better to receive one check all the pay off amounts were wrong also home owners insurance was already paid so 2 weeks later I'm still waiting on over 2,000.00 dallar that's floating around somewhere ", "rating": 2}, {"title": "too much information was unclear until…", "text": "too much information was unclear until the very last. too many people involved in the process and there was a lack of communication between them. way too many high fees for every tiny thing. Unexplained things occurred until the the last couple of days. When you asked a question, that person had to ask another. I am not happy with how everything went. The first person in the mix, Anthony Trombley rambled on so fast i could not grasp everything he said and he is not a good listener. He kept talking to my real estate agent on his personal phone sending me messages through her. He was telling her things that he should have been speaking to me about.The second person, Danielle tribble lacked knowledge in answering questions and she is a purchase specialist!", "rating": 2}, {"title": "Communication ", "text": "There were several times when the exact documents were being requested . I had resent them and then the system would say they needed it again. Come to find out they needed more info. My suggestions are if the document is not exactly what you all need then call the customer and give an explanation as to what you need. This would have caused less confusion and frustration. ", "rating": 2}, {"title": "Rocket mortgage is too siloed out", "text": "Rocket mortgage is too siloed out, with different individuals only observing their responsibility set and no one overlooking the whole deal, issues fell through the cracks .... information given us by one Rocket Mortgage and knowingly shared with Title, the Seller our Realtor all the sudden was not viable when a different Rocket \"group\" weighed in .... as result we had to rewrite our whole deal at the last minute ", "rating": 2}, {"title": "Communication was horrible with the…", "text": "Communication was horrible with the delays during closing. No one could give answers for the delay or the cause. Delays during closing cost me to miss deals/ discounts and pushed my contractors available start dates further back.", "rating": 2}, {"title": "I went through 3 different people…", "text": "I went through 3 different people before I was able to close and the whole process took 3 months. Every time I would upload documents, they would say I was good to go and then a few days later they wanted more. Ended up having to get my own title company because their sister company wanted me to pay for some elaborate survey that is never required in upstate NY. Will not use them again. ", "rating": 2}, {"title": "The loan was to pay off an HVAC loan…", "text": "The loan was to pay off an HVAC loan and for home remodel. The loan team also decided they would pay off a citi credit card even though I told my loan guy that auto payments were scheduled and it would be paid off by the time we closed. I was assured this happens all the time and citi would return the money. Well it’s deposited in my citi account—not exactly returned to me to use how I wish. I feel like people were just too lazy to give citi a call and find out the balance. Otherwise things went smoothly as they should because I’m an excellent risk. ", "rating": 2}, {"title": "There was an issue with the paperwork…", "text": "There was an issue with the paperwork they wanted. They could not understand that Charles Schwab bought Ameritrade so I didnt have a current statement. It took numerous phone calls for them to understand. Then I was told they couldnt direct deposit the money to my account (I just received a direct deposit of my tax refund) so they would overnight it.  It took 2 days to get it not overnight.  I received the mony 7days after I signed the paperwork. I do not recommend Rocket Mortgage.", "rating": 2}, {"title": "Lack of organization ", "text": "Kept getting notifications on the rocket mortgage app that were different than what my representative was saying as to what paperwork was needed.  rocket mortgage would say i required certain paperwork or my closing would be delayed. my representative would say to just ignore it. as a current customer i didn’t need all that. Also i would get loan details such as interest rates and other things that were not correct. i would have to call the representative to find out that nothing had changed and she would fix it. it seems like the computer generated stuff was just not congruent with what i was told by the rep. Also on closing day I was notified by 2 different closing agents that they would do the closing and what time they would arrive. Neither one showed up requiring me to call the company and get it rescheduled. ", "rating": 2}, {"title": "Seller mortgage closing", "text": "Between our closing attorney, Cook & James and the sellers mortgage company, State Home, their was a property tax issue which appears to have caused an issue to close out the sellers mortgage.  This  needs to be resolved immediately.", "rating": 2}, {"title": "We remorgaged our home so we could get…", "text": "We remorgaged our home so we could get cash out to pay off Our r v. Instead of Rocket mortgage pain the r v company direct They sent the check to Us. By the time we got the Check There was a seventy dollar late fee. Then by the time they got the Check there was another Late Fee. When we first got our original mortgage from rocket mortgage , we were very , very pleased. Now i'm not sure what we go back with rocket mortgage at all.Richard Murdock", "rating": 2}, {"title": "There was a missed change in the paperwork 1.5…", "text": "There was a change in the paperwork 1.5 weeks before the closing.  That change was NOT caught by the team until 25 minutes before the remote closing location.  The notary needed to wait for updated paperwork which then made the process start late. I had already signed all the closing documents in the morning and then needed to do it all over again.  Mind you this closing was at my wife's bedside in a rehab as she was recovering from 2 broken femurs. The closing took almost 2.5 hrs not the 15 minutes as was stated.", "rating": 2}, {"title": "It took so long for the process", "text": "It took so long for the process, ever day they were asking for some other document, AST two years tax papers, last two paychecks, last two check stub for 2023. It was ridiculous since our first mortgage is with you. ", "rating": 2}, {"title": "The other houses have I have purchased…", "text": "The other houses have I have purchased I secured a loan with Wells Fargo.   I dealt with one person the entire process and that person took care of everything and kept me up-to-date.With Rocket I was passed from person to person and if I needed anything I was given a number to do their jobs for them.", "rating": 2}, {"title": "I was passed around to 4 different…", "text": "Was passed around to 4 different people. Each time I talked to these people I had to tell them again that I had already closed on my previous house and that it was through Rocket mortgage. Doesn’t this company have computers and don’t these people do their do diligence before talk to the customer so it doesn’t make them look ignorant on the phone. I was for wormed about Rocket mortgage, I gave them the benefit of the doubt because I was with them before. Well I learned my lesson. I will be looking for a better rate and a better mortgage company. ", "rating": 2}, {"title": "Rocket Mortgage screwed up", "text": "The home equity loan proceeds were to be deposited into a brokerage account; we supplied all the necessary  account numbers to the closing agent. The proceeds were deposited instead into my checking account. This is a major screw up that is causing a big fat headache and a lot of stress. ", "rating": 2}, {"title": "I was lied to and was homeless for 2…", "text": "I was lied to and was homeless for 2 weeks. Things that should have been on repair list were left go and things that could have been dealt with after occupying the home were made to be done before closing. The ball was truly dropped on your end and I will not recommend your company to anyone else ", "rating": 2}, {"title": "The loan process was not completed to normal standards", "text": "The loan process went very well, however it’s been 7 days since closing and we still have not received payoffs for our debts in which we made the loan for. Very discouraging to use Rocket mortgage again. We have not had this problem in the past and would like to have this looked at. We received a few emails that our first payment is in July 1st but still waiting for our debt to be paid. ", "rating": 2}, {"title": "Repeated delays", "text": "There were constant delays after we were told everything was ready multiple times, which stretched the process out for over 2 months and then in the end they sent checks to pay off the debts we were paying off with the consolidation which we had to mail out. What is up with that in 2024? ", "rating": 2}, {"title": "Dissatisfied borrower, left feeling used.", "text": "I had to deal with about 7 different people on questions I had. So it have the vibe of just passing you around and having to repeat information the prior agent knew or was working. The focus was less on getting information correct and ensuring the borrower understood what they were signing up for, versus just getting the loan closed. Closing costs were more than what was discussed. It gave off that the prices were a bit inflated to cover the $500 good faith money, so you really don't get the money back, as you don't know the costs before you provide the money. It's disappointing to say, but I felt used and it showed by the way the entire process was handled. Would not use Pocket Mortgage again, nor would I recommend this company.", "rating": 2}, {"title": "The ads offered a lower interest", "text": "The ads offered a lower interest.  You do a great job \"hooking\" the customer but then the details change once fees are paid.  Had to make contacts with the agent to get status updates.  Had to contact one of the companies to get paid off as there was no action.  A long delay in getting the money dispersed and wasn't clear when coming, or why the delays. BUT Rocket got the loan so on we go. ", "rating": 2}, {"title": "Feedback", "text": "Robert Messing was rude and almost lost my business. There was a lack of transparency in the loan process.  If you are the best lender available then you’ll get my business. Being shady and deliberately vague/misleading will drive me away. In the end I stayed with you b/c you were in line with the other lenders I spoke with. You almost lost me though ", "rating": 2}, {"title": "Good loan to close process, POOR disbursement process", "text": "First, your company should be transparent that it does not do electronic funds transfer when disbursing funds. I was misled on this issue. Second, funds should be disbursed the day you claim and not 3 days later. Third, your company refused to disburse funds in the correct amount versus what was on a credit report. I would give a higher rating, but misleading people leaves a poor taste in my mouth. You actually cost me money that I was  planning on saving due to your inability to disburse the funds on time and your refusal to write checks in the correct amount. Now, I have to wait additional time to receive the full amount of funds I financed. Bad business on your part.", "rating": 2}, {"title": "Included a debt that was interest free without permission", "text": "We have a problem I just received a check to pay $466 to the Synchrony for an account that was interest free. When we discussed this account I said not to include it. Now I am having to talk to Penny in the solutions department. It was not supposed to be included. I asked you when the payment went up $100 why and you didn't mention that was on there. I read through all the document but do not understand enough to know that it was included. This was an interest free card and now I am paying interest on a larger amount than what the balance even is.", "rating": 2}, {"title": "we had to send duplicate paperwork to…", "text": "we had to send duplicate paperwork to more than one representative. After we were done with our required paperwork it seems like we were always asked for just one more thing. Very time-consuming for us.", "rating": 2}, {"title": "From the beginning of the process…", "text": "From the beginning of the process Rocket was made aware the transaction was not going to involve a realtor the homeowner was simply go to sell the property to us. It should not have taken at total of 5 months for this transaction to happen. Communication within the company was really bad. People were asking us the same questions and asking us to submit the same information more than 3 times. Was very frustrating having to reconfirm things that were already submitted at the beginning of the process. Also look closely at the fees because they might tell you they got a great rate for you but don’t tell you that they are charging you to lower the percentage rate. All around Rocket needs to improve on communicating within their company and letting customers know what the next step is when it’s a for sale by owner.", "rating": 2}, {"title": "No communication after initial call", "text": "Absolutely zero communication after the initial call called many times with questions asking for a callback and would get an email saying received the call and if they needed to call back which was obvious, but they never actually called me. they said they tried to call and went to voicemail even though I don’t have voicemail, confirm the phone number multiple times..  poor communication.", "rating": 2}, {"title": "Lack of intercompany communication ", "text": "Outside of one person, buying a home was a pretty miserable experience with Rocket Mortgage. The first guy who helped us qualify for our Mortgage really helped us all the way through even though he didn't ( and probably should not have) have to help. The amount of technicalities & lack of communication really frustrated me. Trying to ask the right questions & getting conflicting answers from different people from Rocket Mortgage made it harder. So, hopefully I will not be moving anytime soon because it was just a frustrating, irritating experience. ", "rating": 2}, {"title": "The Debt Settlement Process is Out-Dated", "text": "The mortgage banker was good.  However,  the constant back and forward about my funds in T.Rowe was illogical.  I provided the document request and but the UW didn't read them.  I had to highlight literally the sections.The closing with the settlement of debt payoff is out dated.  The payoff the for the property was made, hopefully, through ACH.  The loans and credit cards were checks with only my name on them and not Michael's name. Also, they were not mailed to my mailing address and were founding on the floor.  I confirmed my mailing address, and telephone number.  Having to mail the checks have resulted in some payment being late or taking longer than usual to process.  I AM NOT PLEASED.", "rating": 2}, {"title": "Was told funding would be done 28th", "text": "Was told funding would be done 28th. Didn’t receive checks to pay off credit cards until 7/1. Then had MAIL checks to pay off CC. As of right now 7/4, the CC balances are still not paid. Looks like I will have to make payments on these accounts ( with the add’l interest) for July. Also would have liked payments set up in the 23rd of each month so it would coincide with SS Payment. ", "rating": 2}, {"title": "Dalton was great!", "text": "Dalton was great!Whenever I called people were nice.However, when I was asked to provide information, it was not what was wanted or needed. It took several days to be informed of that. It was nerve wracking & stressful.I was told things were sent to the appropriate people, then,  no one would find said correspondence.It caused a delay in closing. My husband & I will not be using this company should we ever buy another house.", "rating": 2}, {"title": "RM did not disclose they would not be…", "text": "RM did not disclose they would not be electronically transferring the proceeds from our loan to our creditors. They mailed us physical checks (not in a timely fashion) and added more balance to our credit accounts to be paid", "rating": 2}, {"title": "I want a company that does what they say", "text": "I started the application online, answered repetitive questions over the phone and was told I'd receive a call back at 5pm to discuss what could be offered.  The banker literally said \"..if I can't beat the quote I got from someone else, I'll be the first to tell you that.\"Here I am nearly 48 hours later and haven't heard a peep.  I have no interest in doing business with a company that can't keep their word anyway.  Thanks for wasting my time!", "rating": 2}, {"title": "It took too long for a simple…", "text": "It took too long for a simple refinance. Due to their delay I had to pay over $500 in additional interest. My original purchase went well with them but this was miserable. Edit: I haven’t received your phone call or voicemail. This reminds me another thing that caused a delay is that the loan was put in with a wrong phone number by the rep who reached out to me and so there was a delay in scheduling the appraisal. ", "rating": 2}, {"title": "Not Happy ", "text": "At first was very pleased with our Rocket Mortgage until we found out that they did not pay off our loan for the right payoff which ended up costing us another $895 out of our pocket. How can a company this large in this popular not have people to correctly determine a payoff when the payoff was sent to them on a piece of paper, not very pleased! ", "rating": 2}, {"title": "Underwriting was horrific..information…", "text": "Underwriting was horrific..information uploaded multiple times to the site. No way to communicate directly without incurring delays.Receiving call backs from my banker was more of a norm than answering a call. Very frustrating.. especially since it was a small loan with large collateral provided.", "rating": 2}, {"title": "Never again, RocketMortgage ", "text": "Can honestly say I wouldn't work with RocketMortgage again. Horrible experience and the only redeeming fact is that they were finally able to get the deal completed. Andrew the first point of contact and initial banker was aloof and tried unsuccessfully multiple times to move deal forward resulting in this deal almost not being completed and taking my business elsewhere. Not until I made contact with his supervisor to actually structure the loan properly was this able to move forward and being helped by his colleague India. Both saved this deal which I'm thankful but would definitely look elsewhere after dealing with Andrew.", "rating": 2}, {"title": "Raising my interest rate because insert…", "text": "Raising my interest rate because insert any idea you want to is complete BS. I do not recommend this company to any other person ever. Completely against it. ", "rating": 2}, {"title": "Dishonest information in order to get a sale. ", "text": "When we first called about getting the home equity loan we were told it would take two weeks. It took 5 weeks. We applied for the loan on April 2 and we have a contract closing on April 30.  Had we been given a more truthful answer we would have altered the contract early on. This lack of honest o formation caused my husband and I tremendous stress. I would never use rocket again", "rating": 2}, {"title": "I was forced into an FHA loan when I…", "text": "I was forced into an FHA loan when I wanted a conventional loan! Keith Bennett kept insisting on me doing an FHA loan and not conventional! So now on top of the 5000 plus at closing, I have an extra 150.00 monthly added to my house payment to FHA. This is so Keith could make a better commission with FHA LOAN!!! Then he played games with my interest rate and changing it back with some bogus excuse ! The paper work I sent in for my  to do list Rocket kept asking for it over! Very unpleasant experience! I would like for someone who can make a difference please call me? I will never use Keith Bennett again! 317-372-3183 Thank You for asking! ", "rating": 2}, {"title": "Not quick.  Not easy.  Not cheap.  ", "text": "Well. They did finally get the load done.  They promised 2 to 3 weeks.  It took almost three months and was one strange request after another.  They say we have everything we need for closing and two months later they are still coming up with off the wall requests daily.  I was a Mortgage broker for 10 years so I know if can be tricky at times.  Thats not what this was.  I have never seen anything like it.  The loan officer was good, in fact he was the reason I stuck with them and the loan got done. I gave 2 stars because everyone other than the loan officer showed either a huge attitude, massive apathy, or just a ready seemed to be full of,, the exact wrong information.       ", "rating": 2}, {"title": "I have been using Quicken and Rocket…", "text": "I have been using Quicken and Rocket Mortgage for over twenty years. I have always had a very easy time over the years until now. The Underwriters were not timely and easy to work with this time around. I had to constantly go after them to keep things on track. I failed. The closing was supposed to take place before the end of May. lt didn't happen due to the Underwriters. My credit is outstanding, the house appraisal came in well above what I expected. The check disbursement was slow. I am sorry to say but this may be the last time I use Rocket Mortgage.", "rating": 2}, {"title": "Scumbag Mentality ", "text": "This is a stressful process already as it is, but then you add on the fact that you guys sold our information to competitors. Know we we not going to choose them, and me having to deal with HUNDREDS of calls starting ant 8am every damn day for over a week. I guess you needed to make MORE money off me and my family.... I honestly don't think I'll ever use you guys again. I feel like I'm owed the money. Having to deal with all the calls, and blocking all the numbers. Getting hung up on because I asked politely to be taken off of their list. Very dishonest, and to be honest.. Scumbag mentality on your part. Other than that... I guess it went ok... ", "rating": 2}, {"title": "High fees", "text": "High fees, 50% plus margin on appraisal fees, and long drawn out process with little to no guidance. Lots of follow up required to get them to respond. ", "rating": 2}, {"title": "Monitor First Payment Date Closely; Get Confirmation", "text": "Our closing date slipped past the first of the month but there was considerable confusion regarding our first payment date.  The pre-closing website had one date, the documentation had another.  Unfortunately, no one from Rocket was monitoring this and we are forced to accept the earlier first payment date.  This entirely upset our financial plans.  For a company that promotes an easy path to a mortgage, this error on their part was unacceptable.", "rating": 2}, {"title": "Too many people to deal with", "text": "Too many people to deal with! Different answers with each one! Also an agent gave out personal info to someone who was not connected with the loan", "rating": 2}, {"title": "There were a number of problems", "text": "There were a number of problems.  First;  the payoff amounts of the credit card accounts being paid off were never updated.  You went with the amounts from the initial credit review and that was it.  Second; It was my understanding and wish that all payoffs, including the cash deposit to me, were to be done electronically.  Your agent at closing even took ay checking account number and routing number. It did not matter.  Third your on-line processing was difficult for me because I could never get anyone on the phone.  Emails were not responded to.  Further when I attempted to input my banking information it would not accept it without explanation.  When I attempted to call or email, I got no response.  My experience with the initial agent who helped me with the on-line application was very good.  But the experience went downward from there.  I did not enjoy having to do the mailing, purchase of certified mail, do all the follow-up and tracking myself.  For seven separate mailings.  Your disbursement department was particularly bad.  I first realized there would be mail disbursements deep into the process.  I tried to call and email but would be told there is a 40 minute wait to talk to someone.  When I emailed the department contact, I got no response.  ", "rating": 2}, {"title": "Had absolutely no follow up on my…", "text": "Had absolutely no follow up on my payments that went to my creditors from my loan from you Rocket Mortgage ? Have left messages and sent texts and have had no response from Rocket Mortgage yet ? ", "rating": 2}, {"title": "The underwriters will terrorize you ", "text": "The process from the underwriters was ridiculous, they would get very specific instructions for what they needed, and even when I submitted exactly that it was never satisfactory. I would talk with a representative who would tell me something was acceptable and then it would be rejected over and over and over again. I felt like I was constantly being hassled like I was a criminal over every interaction when it came to my financial documents. It was so discouraging I wanted to quit and use a different service many times. It was only the better interest rate that kept me with Rocket. ", "rating": 2}, {"title": "All of the people I talked to were", "text": "All of the people I talked to were friendly. That being said, I felt that they were “overhyped” sometimes and tried to push agendas too fast. If I hadn’t caught some discrepancies on their end, it would’ve cost me almost 8 thousand dollars in closing costs. Make sure you read some of the finer print and don’t be afraid to ask questions. I saved a lot of money doing that.", "rating": 2}, {"title": "I was supposed to close on april 5th… ", "text": "I was supposed to close on april 5th and didnt end up closing until april 22nd. No one seemed to know what was wrong. I was forced to call Executive support since the process was just going in circles. 2 Stars is generous.", "rating": 2}, {"title": "Needs better communication!!", "text": "While the first person I spoke with at Rocket was helpful, the following experience was slow, tedious, and confusing! Amrock, the appraiser and closing company, is still operating in the dark ages and did NOT communicate with Rocket Mortgage. In fact, one of the people at Rocket did not know who Amrock is, and they were assigned to our case by Rocket!!", "rating": 2}, {"title": "Having to deal with 4 different people…", "text": "Having to deal with 4 different people to get a mortgage is too many. The constant request for documentation that was previously submitted was unnecessarily stressful. They even badgered our realtor to the point where she requested to no longer speak to the contact. ", "rating": 2}, {"title": "I said i do not want mortage insurance…", "text": "I said i do not want mortage insurance i had 300k in equity and at closing i was slapped with something that was never discussed. Morthage insurance which i refused and the closing cost increased drastacially", "rating": 2}, {"title": "To many calls and information needed", "text": "To many calls and information needed.  Would be better to send all at one time.  Would not recommend if wanting loan quickly ", "rating": 2}, {"title": "Be careful with what your told!!", "text": "My mortgage person Daniel told me that we could pay off all my debt and all I would have is my house payment.  I’m thankful that the interest rate is lower.  I should’ve looked at the paperwork closer before signing but I trusted what I was being told by Daniel.  I am now $13,000 more in debt and only $400 of my debt was paid.  I feel like I should have received a phone call from Daniel to tell my my debt would not be paid.  Again, I should’ve paid more attention.  I just felt like I was led to believe one thing and it didn’t happen with ZERO explanation from him.  When I can, I will refinance with a different company because I don’t like how I was treated in a shady way.  I hope he enjoys his big commission and hope he can sleep at night taking advantage of a widow.  ", "rating": 2}, {"title": "Rocket Mortg should change their policy…", "text": "Rocket Mortg should change their policy so that a Power of Attorney title should not have have any matter on the loan, but should understand that that power is simply as an overseer. ", "rating": 2}, {"title": "No one has paid the bills that were…", "text": "No one has paid the bills that were supposed to be paid off.  We are past two weeks going on three and nothing has been done.  I have sent 3 emails and only received an automated response . I am very disappointed ", "rating": 2}, {"title": "Nightmare", "text": "Omg! Kind of a nightmare… I was going to give 1 star but our mortgage guy Jeff K was the only saving Grace…. Having to re-send information over and over again!! Will NOT refinance with this company again.", "rating": 2}, {"title": "Challenging process", "text": "Challenging process.  Came together in the end, but mistakes were made, in addition to some levels of professionalism were left to be desired.  ", "rating": 2}, {"title": "Closed on June20th and still have not…", "text": "Closed on June20th and still have not received my creditor distribution checks. Now I am forced to make another payment.  Not Happy", "rating": 2}, {"title": "Was great until it wasn’t…", "text": "Was going swimmingly, got calls every week (part of someone’s weekly to-do list) letting us know they needed nothing all was well…until the day of closing when it was a complete SNAFU and we almost didn’t close. ", "rating": 2}, {"title": "I gave only 2 stars because the whole…", "text": "I gave only 2 stars because the whole process seemed quite sloppy. Our rate changed after, I felt, I told our agent to lock in the rate. When I was quoted a rate, I said that was fine, but apparently, I needed to say \"lock it in\".  Then my rate changed a few times after it was \"locked in\" and the loan officer called with different excuses. When the notary came to our house for the final signing, my last name was spelled wrong throughout the documents while my husbands was spelled correctly. Our last name is the same. The corrected documents were finally ready while we were on vacation, driving through the desert with poor phone service. Someone called and said the documents were ready and we needed to log into our account and sign most of them online. She was rude when I told her I couldn't sign in, read all the documents on my phone, and make sure they were correct, while driving and having poor cell service. She replied, \"Are you driving?\". I said no. Then she said, \"Then you can do it\". Wow! Anyway, they were able to find a notary to meet us on vacation so we could do the final signing. The notary was great and there were no further issues after signing.", "rating": 2}, {"title": "Made process confusing and chaotic by…", "text": "Made process confusing and chaotic by not checking for sent info before calling again, consistently asking for more after saying it’s  completed.  Calling, calling, calling.. regardless of our schedules. ", "rating": 2}, {"title": "Lack of communication not every one…", "text": "Lack of communication not every one check’s their computer or understands how to navigate you site.  I started the process in October and it was May when we closed", "rating": 2}, {"title": "Michael was great, Josh was not", "text": "Michael was great. Josh was terrible to work with. Told us multiple things were required to close when that was not that truth. Contradicted things that were on the Rocket Mortgage website, etc. ", "rating": 2}, {"title": "You don’t deserve any feedback because…", "text": "You don’t deserve any feedback because you won’t make any changes so I’m not gonna waste anymore of my time to inform you", "rating": 2}, {"title": "Disappointed ", "text": "Too much to go into. Worst experience of my life. Very disappointed. I expected better, especially with my past experience with Rocket, but those expectation were far from met this time around. ", "rating": 2}, {"title": "Wasted time and resources ", "text": "There were several days of wasted time that could have been avoided. That check process that you use sucks. Basicly no one really uses checks to pay bills anymore and the mess I had to go through to pay my cards with the CHECKS you gave me was a major hassle. ", "rating": 2}, {"title": "Not good at honesty", "text": "I was given a verbal commitment as well as written commitment for a program that doesn't exist. It was like a bait and  switch type of deal. Very disappointed.", "rating": 2}, {"title": "when asking for documents your company…", "text": "when asking for documents your company should ask for them all at one time. Not make you just though woops to get them.When it comes to closing. Who is paying for the services. The client. With that said it should be to client when and where to sign the documents. As with all the underwriter your company has all documents should be proofread be for the signing. Not put the client though another signature again. We have to take time off from work to get it done. Yes, I know who wants the loan. The real question is who pays for it and who makes the profit.", "rating": 2}, {"title": "Disappointing and chaotic experience", "text": "I worked in law firms for over 25 years having worked on closings and as well as my own personal closings and this experience was disappointing. The attorney was late and not prepared because he didn't have any documents to sign. We rescheduled for later that day while he tried to get the documents. He came back later with the documents and I signed as instructed. A few days later another attorney called telling me I didn't sign all the documents and he wanted to come by to get that done. I signed everything the first attorney asked me to. Attorney #2 came by and I signed the remaining documents. I still don't have any copies of what I signed. I did receive the checks by overnight mail and the funds were deposited in my bank but the instructions said that I was only allowed to mail the checks. I had to call all the check recipients to get the correct addresses to make sure the checks got to the right destination.  Because of all the delays, I had to pay to overnight 3 of the checks so my payments would be on time. ", "rating": 2}, {"title": "The lack of contact", "text": "The lack of contact. My first encounter was awesome. When something came up he alerted me and was willing to help any way he could. I received an update to check my dashboard but not all the time. It took way longer than the first time. The same happened this time also. Explained that I do not have 2 accounts for dillards. I spoke with dillards and they checked by name and social. My name and social are only on one account. All checks came accept my and nothing has been deposited into my account either. I feel I shouldn't have to do all the work and should've had a call to make sure everything was complete. Still dealing with my situation. This has been an unpleasant experience this go around.", "rating": 2}, {"title": "The underwriting process was not…", "text": "The underwriting process was not beneficial to the customer. I completed every task that was asked of me and due to this I ended up having to pay a larger monthly payment. ", "rating": 2}, {"title": "Great until it wasn't", "text": "Kiyah and Renee were great and I was happy until it came time to plan the closing.  Communication was poor on a timeline to close.  Their misstep in a closing checklist on what I needed to do (I was very responsive to all signing requests on my end) cost me time and money.  They lead me to believe I would be able to close on a Friday and it was pushed to Monday, which doesn't sound like a big deal until the number of people who rearranged their schedules to make that timeframe work was for nothing.  Add to it the additional expense of time I now needed to stay in my current rental as I wouldn't be able to leave on the timeline I informed my landlord based on the timeline given to me.  The very instant rates drop to where it *nearly* makes sense I'm refinancing with someone else just so that Rocket gets less of my money (sooner is better based on amortization of the loan).  I would *NOT* use them again nor would I recommend anyone else do so.  The only reason the rating is as high as it is - Kiyah (mostly) and Renee were great to deal with.  I passed on a lower rate with another lender because Kiyah was easy to deal with. That was my mistake putting service over dollars.  I should have shopped around more and found both.", "rating": 2}, {"title": "Closing service poor", "text": "The proceeds of the loan were not delivered to the creditors by Rocket. Rocket gave no forewarning that they were not doing this. ", "rating": 2}, {"title": "Hold true to your word!!!", "text": "Hold true to your word!!!! Tell me I’m getting all this stuff then at signing you change everything cause my credit score was at the level you wanted even tho when I started I clearly qualified….wasn’t happy at all", "rating": 2}, {"title": "We were promised a loan date", "text": "We were promised a loan date.  We went way past this agreed date.  The review of background checks and the leans against properties was a complete joke.  I was questioned about people with my name who lived in LA and in Idaho who had differing SS#’s.  Then, we were asked about the money aspect of the home we sold and the one we bought.   For some reason, they could not figure out how what we received from the sale minus what was refunded back to me as an overpayment is the amount we paid for the new home.   This one issue took days to figure out.  Multiple emails and faxes were sent and every time we were asked for the same information.   Finally, the escrow companies became aggravated as well.   I finally had to just write out the money aspect and sent it in (home sale amount-refund of overpayment = purchase price) purchase price is the amount you are asking about.   After days of this it was accepted.   We are very disappointed with competency of the underwriting staff and background investigation.  Now our home is weeks sitting empty needing renovation with no money.  We have to pay rent waiting for our home to get floor and paint and siding.   ", "rating": 2}, {"title": "Very disappointed", "text": "Very disappointed. After providing all documentation requested, they would request update after update. And then the day before closing they said we did not submit material in time and the closing was delayed over a weekend which resulted in financial loss, rescheduling hired moving equipment and labor and high anxiety. ", "rating": 2}, {"title": "The loan process was too complicated…", "text": "The loan process was too complicated and disorganized. It took over 2 months to process the loan. Communication with the agents was poor. I didn’t know who was in charge of the process.", "rating": 2}, {"title": "Response time is excellent", "text": "Response time is excellent, sometimes even on weekends. No doubt they are pushed to close as many deals as fast as possible. Don't expect anyone to be an advisor. They are there to sell and will do what you ask whether you are informed or not so do your research. You are pressured to fill out documents asap to get the process started or sent to underwriting or to closing, but need to wait about a week between every step. I was hounded by several agents via texts, phone, and email, to confirm my closing date, warning me there might not be room left in the schedule if i don't hurry and would have to pay extra fees. They want to make sure you don't forget. Just what you enjoy hearing when you are comparing quotes from a several lenders and receiving dozens of spam calls every day because the credit agencies released your report to every lender. When i finally scheduled it, every hour block of the remaining 3 days was still available. Of everyone involved, the local notary who was there for closing wins the award for best service. Knocked off another star for having to mail me a check as part of the loan, which i then had to mail to the company i was paying with a printed copy of other documents. The rest of the loan was wired to my account. They don't even provide a prepaid envelope", "rating": 2}, {"title": "Closing was scheduled 5 times each time…", "text": "Closing was scheduled 5 times each time we were made to wait and nothing happened. We ended up having to call. I was told we would not have to make a July payment but we did. So what happened to the payment that we made as the pay off was different. ", "rating": 2}, {"title": "Be careful", "text": "Be careful. These people are just trying to rush it and I am not happy with the overall process. We had refinanced and we asked to have a couple of loans paid off. Well they will not do it for you, they sent checks to us to take care of it. All of the checks were not even close to the payoff amounts. Just a pain in the ass. Disappointed and if we had to do it again, I would look for a company that had our best interests in mind and not rush to close what they can as fast as they can.", "rating": 2}, {"title": "Low Confidence Moving Forward", "text": "The process for getting approved was a hassle and then the company forgot to send over the payment out of the escrow account for homeowners insurance.  I only became aware because the insurance company contacted me saying I needed to call my mortgage company and have them send the money.", "rating": 2}, {"title": "it’s over", "text": "Glad it’s over ", "rating": 2}, {"title": "Was bouncing from agent to agent and…", "text": "Was bouncing from agent to agent and some information wasn't passed on wich delayed the process more than it should of been ", "rating": 2}, {"title": "Missed items", "text": "The loan amount missed some crucial bills, i.e. solar panels.  The shortage of $10k needed to pay off the solar wiped out the added funds requested. ", "rating": 2}, {"title": "Rocket Mortgage is processing a payment on a closed loan", "text": "Rocket Mortgage is processing a payment on a closed loan as well as my new refinance loan. The 1st time this happened I called and was told this wouldn't happen again. They promised to reimburse the payment but it is a major inconvenience. The customer service representative was unprofessional and unempathetic.", "rating": 2}, {"title": "Mistakes and delays", "text": "Mistakes and delays, yet no compensation offered. We have used Rocket for our last 6 refis but no more. ", "rating": 2}, {"title": "I was lied to the whole time all the…", "text": "I was lied to the whole time all the way to closing. then never told that the accounts that they would close would come to me as a check to mail to them making me late and having to pay a late charge.", "rating": 2}, {"title": "Had to call in a couple of time to…", "text": "Had to call in a couple of time to check on things and never got a return call. I had to call again because my calls were not being returned... Don't like that they sent me a check to pay the pay down but did not provide an address to send it to...  ", "rating": 2}, {"title": "The checks were sent to me instead of…", "text": "The checks were sent to me instead of the creditors.  I had to spend money to mail them out. Sent the checks out signature request because I felt I needed to send them as safe as I could. Very stressful and I had already paid you guys for the service", "rating": 2}, {"title": "Rate and fees keep increasing each…", "text": "Rate and fees keep increasing each step. It was too expensive for me to cancel, but I will never do business with them again.", "rating": 2}, {"title": "Disappointing experience.", "text": "The process with Rocket Mortgage initially showed promise for a smooth experience, even though the woman we worked with was quite fast-paced and erratic in her speech. Unfortunately, as time went on, we encountered significant issues that almost cost us our loan and left us nearly homeless.A major problem arose when our representative mistakenly assumed that a large paycheck was a gift. This misunderstanding created a substantial obstacle in our loan approval process. We were very stressed, and it almost derailed our plans completely. Thankfully, things worked out in the end, but the experience was far from ideal.As the process continued, it became increasingly stressful. Just 24 hours before our scheduled closing, Rocket Mortgage required verification of additional funds, which caused a delay. This last-minute request added unnecessary anxiety to an already tense situation.To improve, Rocket Mortgage could:1. Ensure representatives communicate clearly and verify all critical details upfront to avoid costly assumptions. Never make assumptions about the nature of funds without proper verification.3. Provide consistent and timely updates throughout the process to reduce client stress.4. Avoid last-minute requests by ensuring all necessary documentation and verifications are completed well ahead of the closing date.While we are grateful that our loan ultimately went through, the overall experience left much to be desired.", "rating": 2}, {"title": "Without my insistence regarding the…", "text": "Without my insistence regarding the homeowners policy follow-up the loan wouldn’t have closed on time. ", "rating": 2}, {"title": "Too many back and forth phone calls…", "text": "Too many back and forth phone calls then you say you need more proof, then more proof, then more proof.  I have never felt more like a liar than i did dealing with your company!!!", "rating": 2}, {"title": "Stay away rocket mortgage is a lie! ", "text": "First off rocket mortgage tells you to have a check ready for closing. Then they have no money to give you it’ll arrive in a few days. Then you send me checks that I have to send to CC companies. Why not pay them like u said you would. I would never ever recommend you. High price to pay for you for a loan !!! Rip off ", "rating": 2}, {"title": "I found the person who sold me the loan…", "text": "I found the person who sold me the loan was condescending. He also was not truthful about a few things in the process.  ", "rating": 2}, {"title": "The process to become approved went…", "text": "The process to become approved went smooth, however, once we had our pre-approval letter and was working on the appraisal, inspection and closing, there was poor communication and too many mis-understandings.  When speaking to the mortgager herself, she was amazing a friendly. The background communication between the realtors, attorneys and rocket mortgage was extremely poor.", "rating": 2}, {"title": "Closing took all day thanks to rocket…", "text": "Closing took all day thanks to rocket not being prepared in a timely manner ", "rating": 2}, {"title": "Getting the mortgage went fine", "text": "Getting the mortgage went fine, trying to set up the payment after closing is a joke, online site wouldn't work, trying to get a customer service rep to allow access to set up the payment was also a joke, ", "rating": 2}, {"title": "Dont use Rocket Mortgage ", "text": "Do I think the people I talk to were able to do the work, yes. However, I felt dumb. This is my very first time ever doing something like this, buying a home is all new. I needed more guidance, I didn't feel comfortable asking to many questions because 1. even though they \"explained\" it- I still felt confused 2. they would give me a task to do, but I didn't know how to get it or what it was for, or what they meant 3. to many people I had to talk to but when I needed a question answered I didn't know who I was to call or talk too. When I get a task done, they would say I'm done but then they make me do it again or it was wrong and I would feel rushed to get the task done on their term. So many times, I think I'm done and they would say I'm done, NOPE its not done. But do they explain it to me? No, again feel dump or feel that it was my fault that I didn't close on time. Buying my house was NOT fun at ALL. The experience I had with the people I had to work with was NOT fun. I felt I was being pushed away to so many different people, they might think it was productive but NO it was not. By the time I was done, I was crying, stressed, angry and just so tired that I just wanted to get things done. Even on the last day, they TOLD me I was DONE. I was to close at 5:00pm, but at 3:45- they send me an email saying I wasn't done with the task and that I had to call my Job to show proof of my job. I was rushing to figure out how to close that day. Even on the last day, I was angry and just tired. If I ever buy a house, I know for a Fact I will NEVER use Rocket Mortgage again. I will NOT recommend it at ALL. Even my title company said many people who bought houses have said Rocket Mortgage is gotten worse and just not good. Don't do it! Rocket Mortgage is NOT good.  ", "rating": 2}, {"title": "We got Emails saying we didn't have to…", "text": "We got Emails saying we didn't have to Refinance, just take out of your Equity on your home... After we closed. That was Never Offered or brought up. We more than likely have did that. I think we would have Saved Money.Not to Happy.Mary Robbins ", "rating": 2}, {"title": "Ready set ... Oh wait?", "text": "Close date moved three times. Was told two times we are all set and then unable to close. Even on the final closing date was told we are all set then oh wait we need one more thing or we can't close. That was less the 24hrs before the closing. ", "rating": 2}, {"title": "The banker just stopped helping me…", "text": "The banker just stopped helping me through the process, totally different experience from the first time with the other banker", "rating": 2}, {"title": "Told us 18 days to close took over 40…", "text": "Told us 18 days to close took over 40 sometimes rude on phone calls slow with information ", "rating": 2}, {"title": "Too slow", "text": "Too slow. Lots of paperworks. Too many different people handling an account.", "rating": 2}, {"title": "Just felt I was on my own.", "text": "Would not lower rate even though rates dropped. Also, they were not very involved. I understand they do this daily but for someone that this is new to I just felt on my own.The title company actually did all the work.", "rating": 2}, {"title": "To many fee's and not enough…", "text": "To many fee's and not enough communication. Nathan is the only one that was on top of the transaction.", "rating": 2}, {"title": "Not good experience .", "text": "Not good experience  from start to finnish.Took over 3months to close a simple VA refinance. I could write  a book.", "rating": 2}, {"title": "Too many delays", "text": "Too many delays, repeatedly asking for the same documents, not knowing exactly what they needed from me, tasks listed on the portal did not match tasks requested from various agents too many people working with me that didn’t know what the previous person had done, First application timeline expired, and everything had to be redone, even after closing, they did not pay my taxes on time as promised and I was assessed a late fee which I had to pay myself. Going all digital made the entire process take twice as long, over 90 days due to  redundant requests. ", "rating": 2}, {"title": "I requested the money to be wired into…", "text": "I requested the money to be wired into my bank account and they sent a check which delayed my use of the money", "rating": 2}, {"title": "Always having to call because different…", "text": "Always having to call because different charges kept coming up. Always getting the runaround, I felt.", "rating": 2}, {"title": "Our Rocket banker", "text": "Our Rocket banker, Mikel Silverman, did not make us feel like our loan was a priority. We would go long stretches with no contact, having to prompt her for updates and next steps to keep the process moving. She suggested utilizing the Rocket credit score department to get us a better rate, but never put us in touch with anyone until l prompted her again, and by that time it was too close to closing to do any good (I’d like to note, the credit professional, Michelle Krizo, was lovely and helpful and showed a lot of care about our case). We were refinancing and thus luckily had some flexibility, but if we were trying to secure this mortgage on a deadline to purchase a home, this experience would have caused extreme stress…I definitely wouldn’t utilize Rocket to buy a home.Additionally, while I realize someone can do their job without sugar coating things, basic niceties/manners go a long way in communication with clients, we found Mikel to be abrupt and overly casual…we did not feel like we were treated like valued customers, we felt like she was ‘doing us a favor’ by working on our loan.  As a 20 year customer service professional, Common courtesy matters to me!", "rating": 2}, {"title": "Delays", "text": "Rocket Mortgage was referred to me by my healthcare employer, but the company was not familiar with the healthcare system or the terms, such as FTE. I was made to have my employer change the wording of the offer letter for my new position 3 times, when FTE is a universally recognized term. Then there were delays with closing due to Rocket Mortgage not being prepared. Employment verification began the night before closing at 4pm. Of course, since I was starting a new position, which was known from day 1, the new employer was not able to verify employment. Rocket contacted my employer to have the contingency of my needing a license to be removed from my contract. I am a nurse practitioner and this was not a reasonable request. I then had to drive 3 hours to the capital and request emergency help to expedite my licensure even though I didn't start my position for 6 more weeks. I was embarrassed and humiliated by my new employer's involvement in this process more than once. I was notified of the delay in closing the first day while I was in the parking lot of the office where closing was to take place. I moved from South Carolina with a child and a dog expecting to close on time, having all of my requirements met, only to be met with all of the avoidable challenges that Rocket created to complete this process. I firmly believe the delays were due to procrastination and were avoidable creating extensive extra expenses while purchasing a home. This should be able to be verified by reviewing my file. Additionally, the requirments to close even 2 days late required 10 1/2 hours of driving over 3 days because a plan could not be communicated or established. Lastly, the general lack of knowledge of healthcare, when providing loans to this population, was extremely lacking. ", "rating": 2}, {"title": "They didn't get a payoff on one of my…", "text": "They didn't get a payoff on one of my accounts that I owed on. So the people that I owed took more money out than rocket told me I had to pay. I lost $40,000 in the deal. So I'm not very happy.They called me, and I explained the problem..they were very courteous with me. They said that they will take care of it so nobody else has the same problem. It was just a mistake between them and me. I have as much to blame as they are. They're a good company and I would recommend them to anybody.", "rating": 2}, {"title": "MY CLOSING COSTS HAVE CHARGES THAT I…", "text": "MY CLOSING COSTS HAVE CHARGES THAT I WAS NOT INFORMED ABOUT, HURRICANE INS? HAVEN'T HAD A FLOOD OR HURRICANE SINCE NOAH WAS HERE !!!!!!", "rating": 2}, {"title": "No Follow Through", "text": "At the start of my loan process, my mortgage banker was calling all the time to check in with me and to explain my next steps. She seemed very attentive to my banking needs. However, that came to an abrupt end once I agreed to go proceed with the loan. After I signed the paperwork to move things forward my mortgage banker stopped contacting me and I had no idea what the status of my loan or what my next steps were. I called her, left voice messages, left her  text messages and I finally had to reach out to the chat to ask them about the status of my loan. I logged online daily to check to see what Tasks I had to complete. Another thing that dragged on was going back and forth with my mortgage banker and the underwriters about the documentation that I was uploading. It was a nightmare having to upload multiple things to provide proof that the truck that I co-signed for belonged to my son and that he was making the monthly payments. That situation could have been solved a lot sooner if my mortgage banker had responded to my multiple messages. This was not my first time dealing with Rocket Mortgage so I am very disappointed and upset the way I had to constantly try to find out the status of my loan and it came close to the deadline. I had to cancel the first closing appointment because my loan amount had not been revised after I had left messages and tried to get in touch with my mortgage banker. I hope that the next customer that has to work with the mortgage banker that I had have a better experience and that she will follow through on the loan process from the beginning until the end. Also, keeping an open line of communication would have been great instead making it seem like I was out there on my own trying to figure things out without any guidance for the next steps. Thank you!", "rating": 2}, {"title": "Hated the fact that you made out checks…", "text": "Hated the fact that you made out checks to pay off our credit cards. By the time the checks came, all of the payoffs changed. Also, you did not pay off all the cards we talked about and paid one I said to not pay off.", "rating": 2}, {"title": "Took way too long", "text": "Took way too long, and i had to provide proof of everything in my life. I also spent almost $2000 of my own money for a refinance. ", "rating": 2}, {"title": "Rocket is loosing steam", "text": "While I've had a good experience with Rocket Mortgage in the past, I felt as if they are getting out of touch with their customers, making the home buying experience unpleasant. ", "rating": 2}, {"title": "None ", "text": "There was not enough guidance ", "rating": 2}, {"title": "It was the worst experience I have ever…", "text": "It was the worst experience I have ever had with a refi.", "rating": 2}, {"title": "Rocket raised the amount of my down…", "text": "Rocket raised the amount of my down payment from 3% to over 10% with one day notice. My closing got delayed for months.", "rating": 2}, {"title": "I wanted to take out  equity, ", "text": "I wanted an take out  equity,  I got a refinance. Our interest rate was 3% on the refinance our equity is 7%", "rating": 2}, {"title": "Didn’t meet my timeline and they…", "text": "Didn’t meet my timeline and they miscommunicated. But they got it done. ", "rating": 2}, {"title": "If it was not for Samuel at Rocket…", "text": "If it was not for Samuel at Rocket Mortgage, I would’ve walked away and went through a bank ! I had to do 90% of the work and their fees are way too high", "rating": 2}, {"title": "Analyst made several errors and slowed…", "text": "Analyst made several errors and slowed the process down. ", "rating": 2}, {"title": "The whole process was painless and…", "text": "The whole process was painless and fast. Very satisfied.", "rating": 2}, {"title": "Having me send out checks it was a mess", "text": "Having me send out checks it was a messTo date a few checks still not processedIt seems I did most of legworkCouldn’t get team on phone", "rating": 2}, {"title": "Be prepared to be pressured into a refinance ", "text": "Inquired about a second mortgage only to spend a week with banker trying to upsell us into a home refinance with cash out. From the initial conversation we had explained we were not interested in refinancing as we have an amazing interest rate on our mortgage loan. We did review all the information he worked up for us and did make a final decision we wanted to go with a second mortgage loan. When we told him this his supervisor then called us to try and convince us to do the refinance, all of this pressure to do something we really didn’t want to do almost made us walk away from using Rocket Mortgage, this was the second incident that made us have concerns with doing business with Rocket Mortgage. The first incident was when we initially had contact with the company and we were just inquiring and getting information together to make a decision on how to go forward. Even after speaking with a banker we kept receiving multiple calls from Rocket Mortgage and had to explain we were already working with a banker, then one banker proceeded to tell us the original banker we had spoken with was no longer with the company, even though we had exchanged emails that morning. This kind of backstabbing really made us question working with a company that had employees that would out right lie, but our original banker then told us that was not how the company ran and convinced us to continue only for him to make us feel pressured into a total home refinance. Once we were transferred to to a banker that got us set up with a second mortgage loan, which is what we wanted from the onset, everything went quickly and easily with the process being completed in 2 weeks. Have a hard time referring a company who’s employees will sell each other out and that will do everything to try and upsell into something you are not interested in.", "rating": 2}, {"title": "Delayed mortgage due to escrow error", "text": "Delayed mortgage due to escrow error.   Guy was rude to me.  Spoke to First Lady just once ", "rating": 2}, {"title": "Our refi was a clunky and disjointed mess...", "text": "My experience with Rocket was an absolute mess. I am my fathers power of attorney, and his home is in trust. He was diagnosed with lung cancer last year, and we needed to refinance his home, because my mother passed away last year, and he just couldn't afford the mortgage payment on his own. I was tapped out on my savings as I had quit work to take care of my mother as she battled chronic and severe illness. I reached out to the first Rocket agent, and he took too long to even respond, so I tried to reach out again. I was able to speak with another agent, and I communicated the situation, and that, as my father's POA, I wanted to get his home refinanced for him. The agent said that the process would likely only take a couple of weeks. Well, a couple weeks turned into almost two MONTHS. I had to submit and then re-submit our POA documents as they were somehow unable to be found in the system, then I submitted our trust certificate, THEN was told I needed to upload the trust in its entirety. At that point I became frustrated, and had some questions about the details and numbers of our loan, and the agent I was dealing with said he would check on those numbers, and get back to me later in the afternoon. I didn't hear from him again until a week later, and he didn't reach out to answer my question. He reached out because he had a question about our trust. I reached out to Rocket to ask for another agent or to just call everything off, and was then put in touch with someone higher up that was brought in to help salvage the situation. We got to the next step where we had to deal with amrock, and the woman there was quickly replaced when neither myself nor the Rocket agent helping us could get answers from her, as she didn't seem to be too concerned with helping us. After that I was told that the doctors note I submitted for my father wasn't sufficient. I was forced to get THREE additional doctors notes as each proved to be insuffienct in different ways, despite the fact that I did exactly what was asked. We started this process on February 12th, and our loan didn't close until the first week of April. All I wanted to do was help my dad stay in his home as he battles cancer. It was made clear from the beginning that we intended to use our POA to refinance his home, and we were met with road block after road block in the form of either apparent disinterest or miscommunication. Rocket seems to be so compartmentalized that once a person gets their job done, the case is sent downstream without any context or communication. I don't understand how agents told me that everyone involved was \"on the same chat thread\", yet the whole process managed to be so incredibly disjointed. I will say this, agents that I spoke to were respectful and showed some empathy for what my father was going through, but, the road my father and I took to get his home refinanced through Rocket was the exact opposite of a smooth and enjoyable experience. I will also say that I have zero intention of coming to Rocket for any further loans or business regarding our home, and I will say the same to friends/family that ask about our experience.", "rating": 2}, {"title": "rate NOT as promised and actually went…", "text": "rate NOT as promised and actually went up higher until I spoke to representative he said he got it back down to what we spoke of but it was still too high at this point we just wanted to get the consolidation done my other issue is that the checks that we're going to creditor should've just been paid electronically instead of giving us checks after the closing and then we still have to mail them out", "rating": 2}, {"title": "My broker Danny was awesome", "text": "My broker Danny was awesome. But everything else was slow and we had to re do paperwork 3 times ", "rating": 2}, {"title": "didnt stop autopay on closed loan so…", "text": "didnt stop autopay on closed loan so guess what happened", "rating": 2}, {"title": "Amrock or other company fell short on…", "text": "Amrock or other company fell short on closing numbers!", "rating": 2}, {"title": "Took way too long", "text": "Took way too long. And charged way too much for closing. Kinda like price gouging. Would not do that again. ", "rating": 2}, {"title": "Too many different people throughout…", "text": "Too many different people throughout the whole process resulting in miscommunications and documents being sent to the wrong places", "rating": 2}, {"title": "Different requirements kept adding a…", "text": "Different requirements kept adding a few days prior closing", "rating": 2}, {"title": "The entire process was messy", "text": "The entire process was messy. Miscommunications regarding paperwork needed, payoff amounts, creditors, payment processing was mishandled. ", "rating": 2}, {"title": "Checks were written out to the banks. The amount of some checks were wrong. The best was a check made out to a Pension Company. They did not use my maiden nane nor did they listen.", "text": "The title company needs to be replaced. ", "rating": 2}, {"title": "A rock charged us $15.000 and we had to…", "text": "A rock charged us $15.000 and we had to mail our own checks. Ridiculous ", "rating": 2}, {"title": "The guys we worked with was horrible…", "text": "The guys we worked with was horrible very very rude. ", "rating": 2}, {"title": "I wad told that they were not allowed…", "text": "I was told that they were not allowed to lend me less than 100,000.00.", "rating": 2}, {"title": "Failure!!!", "text": "Failure to communicate changes to original agreement. Failure to resolve issue relating to mortgage. ", "rating": 2}, {"title": "Mailing checks and process took to long…", "text": "Mailing checks and process took to long and inconsistent information", "rating": 2}, {"title": "Change closing cost", "text": "Change closing cost ", "rating": 2}, {"title": "Not happy with the process in the end.", "text": "Not happy with the process in the end. ", "rating": 2}, {"title": "Inaccurate information.", "text": "Accurate information, continuous inaccurate numbers throughout the process.", "rating": 2}, {"title": "The broker was an absolute nightmare", "text": "The broker was an absolute nightmare. Terrible communication ", "rating": 2}, {"title": "Poor communication Never knew what was happening", "text": "Never knew what was happening, poor communication ", "rating": 2}, {"title": "DOn't do it", "text": "too much to type", "rating": 2}, {"title": "I was mislead.", "text": "Date of experience: June 08, 2024", "rating": 2}, {"title": "Call me...", "text": "Call me...970-903-1611", "rating": 2}, {"title": "Bum rushed through", "text": "Bum rushed through ", "rating": 2}, {"title": "Everything", "text": "Everything ", "rating": 2}, {"title": "listening.", "text": "Date of experience: April 06, 2024", "rating": 2}, {"title": "The experience  with my agent from Rocket mortgage was not great .", "text": "Terrible experience! ", "rating": 2}, {"title": "Poor Communication", "text": "Date of experience: May 09, 2024", "rating": 2}, {"title": "Lied to us", "text": "We were told by the person helping do our loan that we had nothing to worry about and they would pay the cars off. We called 3 days later and they said that whoever told us that lied to us, and the checks, 45 thousand dollars worth, have been sitting on our porch for 3 days. And now we can't get a hold of anyone from there to ask about it. Trash is what I would say.", "rating": 2}, {"title": "poor communication ", "text": "Initial rocket representative who reached out gave me one rate and then person who closed loan (Mikel)  gave me .5 higher rateMikel said she reached out multiple times, yet left no messages??Fees seemed a little high", "rating": 2}, {"title": "I feel like I processed the loan myself…", "text": "I feel like I processed the loan myself basically. Communication was poor, we went to closing with a seller credit that shouldn’t have been there after we told multiple people to remove it. Our LO was great but otherwise it was a very bad experience and I would not use again", "rating": 2}, {"title": "The distribution of fund is too…", "text": "The distribution of fund is too cumbersome.  The funds should be made available to the borrower via electric funds transfer rather than a paper check.", "rating": 2}, {"title": "Our banker Jennifer Anderson was awful…", "text": "Our banker Jennifer Anderson was awful to deal with, poor communication, condescending responses, and untimely responses. We had to get the director involved to get things done on multiple occasions. The entire process did not go smooth and this is our 4th house we have bought through Rocket and by far the worst experience. We have referred many people to Rocket and won’t do it again!", "rating": 2}, {"title": "Mortgage Rep was great, But", "text": "Mortgage Rep was great. He stayed in touch and on top of things. Underwriting process was terrible to a point where i had to continue to email, upload, and explain the same document several times. 4 times i uploaded the same document. They continue to hold up the process over this. Then in the end of it all, they lied to me. The closing was supposed to be wired, they mailed a check, then proceeded that my bank rejected it. I spoke to my tiny 3 branch bank, and they didn't even receive a wire transfer that week. Just not impressed at all. ", "rating": 2}, {"title": "Make sure you read the fine print …", "text": "Stated to me debt free and didn’t pay off the two highest credit accounts. Make sure you read the fine print", "rating": 2}, {"title": "Henry and I was thinking that the debts…", "text": "Henry and I was thinking that the debts were going to be electronically paid and not checks written to the companies. Also the guy who came to our home I think was thinking that because we both asked should we make a payment on a few of them and he said no that it would be fine. We told him that they were due in a matter of a day or two maybe three days from that day we signed as well. So I listened and on two of those and I got late fees and I had to call the companies and it made me look bad. Now the ones that we went on and paid because of that now they owe us some money back but they said we have to call once we see it posted and they owe us and asked for that over the amount We need it sent back to us and they said they would send us a check but that's time-consuming as well.Plus We have to watch the account then call then request that money back.  Plus the guy that came in for the signing was acting like he was in a big huge rush and was shoving in the papers at us did not read over them with us did not give us any details that checks  was coming for the debts that that's what we was going to have to do and there was a huge amount number mistake which he scratched out and I'm hoping that that's going to be taken care of because I'm talking hundreds of thousands of dollars that we cannot pay. Have to talk to Henry about that I forget what it was It was one of the first papers we signed together and I mean the very first paper that we signed I think together. Like somewhere around $187,000 worth of a mistake. Plus the guy never slowed down and read papers to us he was still in a rush the whole complete signing of paperwork. It was awful. I like the other guy that did the last two for us he was great I don't know his name but I think Henry does you might have to ask Henry.", "rating": 2}, {"title": "The people were very friendly", "text": "The people were very friendly, but as always with Rocket, there was a bunch of stuff that kept coming up that had to be done that wasn't discussed in the beginning. Always this hoop or that hoop...", "rating": 2}, {"title": "Good experience turned bad!", "text": "Overall, the process went well, however the entire process and impression I have is negative due to the poor support I received from the main representative that handled my account.He failed to properly inform me of time required for various steps in the process.  This caused lengthy delays in closing the mortgage.  Many time periods were learned by questions I asked versus being supported by this rep.  I also caught this rep blatantly lying on multiple occasions.  I have documented details to prove this.  I also provided details to upper management at Rocket.Then, the day before closing was told I needed a completely new home appraisal due to the fact that \"case numbers were changed\" for some reason.  I had paid in advance for a home appraisal which was only 3-weeks old, now being asked to have another one done.  This seemed completely ridiculous to me.  I escalated this issue within Rocket and some efforts were made to expedite another appraisal.  Spent hours on the phone and spoke directly to another appraiser who kindly adjusted his schedule to come to the house on a Friday to complete this process.  I took time off of work in order to have this done.  The appraisal was done, then approximately 1-hour after he left received a call from Rocket saying this \"new appraisal was now not needed, as all they had to do was add an addendum on the current paperwork\"!!!!  Not only did this issue delay my closing it created an extreme amount of stress for me and my wife.  It took 2 months from start to finish to complete this refinance.  I completed every request or to-do items immediately, then the day before closing this disaster happened.  If I had not gone through this entire process, I would have cancelled everything and gone with another lender.  However, to put 2 months into this then be a day away from closing felt I had no choice.  One person ruined what could have been a positive experience.  I will never use Rocket again, nor will I ever recommend to others.", "rating": 2}, {"title": "Rocket was great until we had to deal…", "text": "Rocket was great until we had to deal with the insurance loss department. Huge lack of communications, along with time differences  shortening the amount of time in a day it takes for them to respond with issues. BIG Issues that we should be able to get a quicker response to.", "rating": 2}, {"title": "It took to long to close the deal and I…", "text": "It took to long to close the deal and I still haven’t received my checks to pay off debt ", "rating": 2}, {"title": "Improve communication", "text": "Date of experience: March 14, 2024", "rating": 2}, {"title": "Low to no transparency of rates", "text": "Low to no transparency of rates, points, fees, process etc… it’s like buying a used car in the 80s with Rocket … and fees fees fees so many fees ! Oh then you get passed from clueless minion to clueless minion , very impersonal … I just wanted a loan and will be refinancing asap  so I’m not paying 150% total interest ", "rating": 2}, {"title": "No ownership of process. ", "text": "I think I received more  “ how we doing” emails than actually constructive communication. This is at least the second survey after closing.  The account manager only speaks in company provided scripts. The day before closing  I was told I needed significant addl cash. They then had to scramble with their end to meet my close. Then they acted as if they were jumping hurdles to meet the original date. Had best rate but too much reliance on their dashboard. I think they lost track of things. ", "rating": 2}, {"title": "The last lady was no nice", "text": "The last lady was no nice ", "rating": 2}, {"title": "Awful experience doing a loan refinance moving my loan .", "text": "I have rocket mortgage at a very low rate . I needed to refinance & I have had to deal with several people after one worker had to have surgery. It has been an awful experience & now looking at other companies to take my loan over at a higher rate but better customer service . The last person I spoke with would not let me speak & said the person before him put me on the wrong program . I called to explain & they didn’t have time to listen . End of story with this company . On to a new & better place . 🤷‍♂️", "rating": 2}, {"title": "Not enough communication.", "text": "Not enough communication. ", "rating": 2}, {"title": "Lack of communication is horrible and…", "text": "Lack of communication is horrible and we were  made to do things and come up with money that in the end was totally unnecessary and  it delayed our closing date unnecessarily and will never use Rocket ever again!!", "rating": 2}, {"title": "It needs to be one loan officer working…", "text": "It needs to be one loan officer working on it not ten different people. Calling the 1800 was not helpful. The chat was down or different person every time. They were not descriptive on what information was needed. Took longer than needed at my expense.  I will not recommend you to anyone!", "rating": 2}, {"title": "Worst Mortgage Advisor Ever", "text": "My mortgage rep would insist at odd times that my response was needed always immediately.  And if I missed her call and I called her right back - no response.  No response for days even though her initial call said urgent. Always.  When I got the payoff information it was totally different from what I was told.  At least one less account was taken care of.  One of my checks was to pay Rocket Mortgage (???) - none of this was explained to me in advance.  One of the worst finance experiences ever!", "rating": 2}, {"title": "Surprised, not what was expected ", "text": "Was told the kind of loan I needed. In order to understand, I talked to a very informative guy named Jason at Hall financial, in Detroit, and a loan specialist named Katlyn out of St. Louis. This was due to NEVER getting the call backs I begged for. Then on the cash out finance, I was sent checks to pay off the loans I WAS TOLD to pay off, not the ones I was wanting paid off, and the checks were not made out for the right balances and several were not made out to the payee they were suppose to go to. On a good note, the closing was fast and very convenient, except it was almost a week after closing that mortgage was paid off, as I paid interest on 2 mortgages for almost a week. ", "rating": 2}, {"title": "I feel I was treated unfairly.", "text": "I feel I was treated fairly.  The person I had and the lady closing the loan weren't on good communication.  I feel I was harassed with having to show every penny that I had in bank accounts, even with the HUD rules showing different.  I was told I could possibly get a loan 2 days after closing to help with remodel of the house, that never happen actually haven't heard back from the guy or anything.  I would not recommend Rocket Mortgage to anyone.", "rating": 2}, {"title": "Customer Service Miss", "text": "Our mortgage broker was attentive and supportive in the beginning, but when we had questions regarding the difference in what was committed and what was proposed he was unresponsive and did not return phone call/email.  The customer service was below average, and I would propose giving customers an escalation path.  ", "rating": 2}, {"title": "Our agent was helpful at first", "text": "Our agent was helpful at first, however, once everything was set into motion, he became less and less helpful.  I understand that he took a vacation with his family and we tried not to bother him too mich, but he could have at least had another agent take over our case when he went on vacation.  We were also not informed until the day of closing that our house did not appraise for what we thought it would and that our loan was for less than we needed.  He also did not inform us to stop automatic payments, so a payment came out for March when we were told it would not and that we would be able to skip a payment.  It just seems like he didn't care.  We will definitely think twice before refinancing with Rocket Mortgage again.", "rating": 2}, {"title": "Rocket is not transparent", "text": "Rocket is a technology powered organization. Great process and technology adoption.However their bankers will manipulate and deceive you by hiding the actual scenario.They are not transparent, finally you will pay significantly more than initially communicated by their team. Please look for local or other tier 2 companies for your mortgage needs.", "rating": 2}, {"title": "Overpaid Credit cards and loans, sent me $14000 wrong checks", "text": "Checks written to payoff Credit Card debts and other debts were in some cases thousands more then owed. Checks made out to wrong companies for $14,000 plus dollar, still not resolved. Was told by Joe Bashe to settle and it will be cleared up…NOT. Would not recommend Rocket to anyone due to this mess. Now Credit card companies have there payoff and plus hundreds of extra dollars of mine. They said it will take 30+ days to get my funds back. Should of sent me the whole amount and let me pay my cards off.", "rating": 2}, {"title": "Overbearing", "text": "They were very fast to respond and get things started for a loan. Then we started receiving calls at all times, multiple calls. for information we could not get them until normal business hours. I cannot contact my bank at 9pm on a Saturday evening. They tried to talk us into closing before the repairs were completed at the house. The information they request is honestly none of their business and the amount of calls and emails is absolutely astounding. We will never do business with them again.", "rating": 2}, {"title": "Long process and very high closing costs ", "text": "Took a long time and repetitive requests from under writers and the title issue that was origanaly your fault remaining from the previous loan.  The disbursment of the checks for me to send to my credit card company were a pain and it should have just been sent to my account for me to pay. Now I wait to see if the creditors receive the and if they don't then I go through yet another waiting period.  Also you closing cost are ridiculous.  ", "rating": 2}, {"title": "Took way too long.", "text": "Took way too long. ", "rating": 2}, {"title": "5 closing attempts…", "text": "I didnt have too many issues with getting approved and finalizing my mortgage but then had terrible experience with AMROCK and closing processes. Two times they scheduled remote closing and two times they failed to finish. After that they came to my house and after signing all documents they managed to send it to a wrong address. Fourth time 30 minutes before signing paperwork in my house they called me to reschedule signing. Finally when they came the printed documents were wrong and even after they updated the paperwork the dates were incorrect. My level of frustration was very high! They definitely need to hire a lot more knowledgeable and responsible staff.", "rating": 2}, {"title": "I was trying to get a pay stub", "text": "I was trying to get a pay stub. I found out after the fact that the guy was badgering the HR person at my job. That is COMPLETELY UNACCEPTABLE ", "rating": 2}, {"title": "The constant request for financial…", "text": "The constant request for financial information.", "rating": 2}, {"title": "Blinded by the Light….", "text": "This is our third loan through Rocket, our second experience was amazing. This one however has been extremely disappointing. Again, our third loan, Rocket should have been extra accommodating, but no. Our loan rep was in and out, if it were an emergency then do not use her at all. We all have our moments, I really liked her but that was the problem. One moment she was there and the next out for three months. You guys were busy which is great for you but we were just one more t to cross.  Then we were told how much we would receive at closing and when, both numbers changed. We also were told the loan percentage, with our history and credit score I thought it would be better than 8.6%, your people kept congratulating us on the great percentage. THEN I find out my niece whom I recommended Rocket to, received a 7% and hers also was a second mortgage/home equity. I was pissed!!!  At this point I don’t know what to say, you already have the loans and papers signed but we are done. We have written glowing reports on this company not to mention your staff. You will not be receiving double the amount we borrowed, if I have to I will go to someone else, anything to pay it off early. We have been telling everyone about our experience with Rocket, it makes me sad, we did not even consider anyone else. Next time I will not be so blinded by the light. ", "rating": 2}, {"title": "Only refinance if there are no other options", "text": "Current policies should be reviewed so that loans amount don’t have to include all debt.  The rule about keeping debt below a specific percentage change my experience from helping me in a bad financial situation to saving me about a hundred dollars a month. The beginning of refinancing was supposed to save me 400 dollars at month. Don’t refinance unless you have to do it. ", "rating": 2}, {"title": "Changed bankers too many times", "text": "Changed bankers too many times. The final banker seemed to rush in certain areas and had to go back and forth a bit to get closer to the number I was comfortable with. The reps I spoke to only 1-2 times I didn't have issues with. Mainly how my loan terms were reached is my issue.", "rating": 2}, {"title": "Need to be more transparent and clear with the numbers", "text": "The process was very easy. However at times the communication was lacking, particularly in the first phone call. I had to make multiple calls when something didn’t look right. In the end the whole loan changed because there were changes that were not communicated properly.  The loan we ended up with was no where near what we first asked for and was quoted but we were too far into it to stop the process. We will now be forced to refinance again to get to where we want to be. ", "rating": 2}, {"title": "I do not recommend this company at all.", "text": "There were so many upheavals throughout this process with Rocket Mortgage. My husband and I only went with this company because we have a mortgage with them for our condo. There was only one employee that was communicative, the rest were terribly slow, unhelpful and non-receptive. There were so many mistakes on most of our forms, that would not have been corrected if my husband and I did not catch them. We almost got completed messed up the day before our closing date because of their weak diligence, poor work ethic and lack of detail. They are lucky they got our business because we will never use this company again or recommend them. ", "rating": 2}, {"title": "Would not use rocket mortgage ever again", "text": "Had to upload the exact same documents multiple times for the rocket team to review. Military family had to provide reasoning from employers (both working spouse and active duty army) for recent relocations which was >12 months prior. 5th home purchase and worst experience by far.", "rating": 2}, {"title": "Mistake prone origination and closing processes", "text": "Rocket Mortgage made several mistakes during the loan origination process, either with the handling of the information I provided to Rocket Mortgage or providing me with inaccurate information about the loan estimate. My mortgage banking representative was able to correct mistakes, when I pointed them out to him.  I don't recall him catching any mistakes, though.One of the mistakes that was not caught caused the previous mortgage payoff amount to be substantially under-estimated.  Rocket Mortgage approached me a week after the loan closed and was recorded, stating that I owed them a large sum of money to payoff my debt with my previous mortgage lender.  They admitted the mistake was theirs, but demanded payment to \"settle my debt\".A \"goodwill gesture\" was offered by this multi-billion corporation to resolve the disagreement, but they never offered a satisfactory solution and left me with a big out-of-pocket bill.  Buyer beware:  check and double-check all the numbers on your closing documents, questioning every line item, because after the loan closes, you have no negotiation leverage.", "rating": 2}, {"title": "Process was very easy but payoff process was confusing", "text": "Process was very easy and I liked it. However, payoff process was different from what I heard from the person who explained whole process at the beginning, and it was confusing (maybe partially due to my misunderstanding). I thought only cash payment shown on the closing document would be paid to me by Rocket Mortgage (or my former mortgage bank) after payoff amount was \"directly\" transferred to Rocket Mortgage from my former bank. But in addition to cash payment from Rocket Mortgage, whole \"payoff\" amount was credited to my account and then the different amount (less than whole payoff amount) was debited, and there was no explanation about the difference. I assume it is escrow balance I had at my old bank, but original explanation was that escrow balance will be \"refunded\", so I thought it would be refunded separately. I contacted my former bank and asked for the refund, but they explained that it was netted with payoff amount.Also, I paid additional one month mortgage just before the closing. So actual payoff amount should be different from \"Estimated\" payoff amount. I sent an email to Rocket Mortgage but no clear answer. Person who arranged the process at the beginning told me that if I pay extra mortgage after payoff amount was fixed, the extra payment will be \"refunded.\" Maybe it is also netted with the credit amount, but I still don't know what happened to my last payment to my old bank. Will it be refunded? Or was it netted?Because of the above, I am sorry but I just chose 2 stars.", "rating": 2}, {"title": "they assign you your own personal rep", "text": "they assign you your own personal rep.  To bad you cannot get them on phone, return phone, text.On my first mtg, I was assign a person and HE ALWAYS returned call.  He was you \"rep\" thru the closure.", "rating": 2}, {"title": "Took too long", "text": "Date of experience: February 17, 2024", "rating": 2}, {"title": "Bianka who we worked with was a…", "text": "Bianka who we worked with was a deceitful and condescending. She was unpleasant to speak with and contradicting what she said.  We have been with Rocket for years and have always had a great experience u til this time. Very disappointing.", "rating": 2}, {"title": "Not happy with the service", "text": "You have the wrong address for my house that I just refinanced with this company. How does this happen? At least 4 different people contacted me for the exact same reason on several occasions. Does no one in this company communicate with each other.", "rating": 2}, {"title": "The customer service was horrible", "text": "Date of experience: February 15, 2024", "rating": 2}, {"title": "Goal posts kept moving", "text": "Goal posts kept moving, and still having issues with the creditor checks which is creating issues for me financially. Will not recommend and will never use again.", "rating": 2}, {"title": "Disappointed.", "text": "In the past I have had at least 3 or 4 closings with Quicken/Rocket.  I was always so taken by the stellar customer service, professionalism and expertise but this time around not so much. This HELC process was awful.  The caliber of your employees did not measure up to my prior experience.  This also includes the underwriting dept.  — the professionalism I had come to know With your company was just not there this time!!", "rating": 2}, {"title": "If not for Ann Copenhaver I would have…", "text": "If not for Ann Copenhaver I would have gone to a different lender. I keep getting a run around on final payments to venders who finish they work requested and the hold back amount keeps being different.", "rating": 2}, {"title": "Too many people working on my loan", "text": "Too many people working on my loan. I had to keep calling or text for updates. When they said everything was good then to find out days later that it wasn't.", "rating": 2}, {"title": "Mortgage", "text": "Well all was fine at first. Too many different people involved in the loan process. Things get lost in communication between myself and the different people you're dealing with. In my case there was some last minute changes that I feel almost lost me the loan approval.", "rating": 2}, {"title": "Every single thing was in place in…", "text": "Every single thing was in place in order.", "rating": 2}, {"title": "First you lost our overnight papers and…", "text": "First you lost our overnight papers and second it took an extra week and by then I had overpayments on a couple of accounts and I’m still waiting for the refund of those that should not have happened so overall very disappointed", "rating": 2}, {"title": "We were told 7-10 days and it took over…", "text": "We were told 7-10 days and it took over 3 weeks to close with no updates or even a point of contact. “Check your Rocket app for updates” on repeat was infuriating. Could not reach anyone to help us and when I did go high enough in the chain all the sudden the loan process starts moving again. Very disappointing. 2-stars only because the loan did, finally, get closed.", "rating": 2}, {"title": "Not as good as advertised", "text": "My original loan officer Tony Rhodes was great and would often respond to emails after hours and during holidays to best support my family. That said, I just went through a separate relocation with Premia Relocation last year and I noted a substantial difference in the quality of communication and transparency of fees between the two companies. A lot of my rocket mortgage closing costs were covered by my employer, but at closing, there were a lot of \"additional\" costs that were both not effectively communicated and explained. At this point in the process, it was too late as I needed to get my family in the home, but it was frustrating. Another aspect of the loan process which was frustrating was the lack of value for the customers. Premia offered a \"rate lock\" that allowed the customer to keep the rate on the day of the lock, but also allow it to move lower if the rates changed for the betterment of the customer. Over the longevity of a 30 year fixed rate loan, they valued keeping the customer more than Rocket. If I had to do it over, I would have went with them instead.", "rating": 2}, {"title": "Company needs to pay attention to…", "text": "Company needs to pay attention to customer request. If someone says do not call during certain hours then do not call at that time. Each department said they had not been informed of the request. I had to remind them numerous times.", "rating": 2}, {"title": "Frustrating", "text": "Poor communication. Requested some pretty ridiculous things, especially considering it was a refinance. Could not communicate to the section of the company that was requesting the information. Had to deal with various branches of the company that did not seem to communicate to each other. Took much longer than the original finance on the same home.", "rating": 2}, {"title": "Lack of communication", "text": "Lack of communication! Lots of emails but no personal contact between Rocket and Amrock. Mistakes made on the closing statement. Ridiculous underwriter requirement that delayed the closing-eventually being waived. Too many people involved and no communication between them-always blaming the other for mistakes.", "rating": 2}, {"title": "Rocket Mortgage, Keep looking", "text": "The initial information exchange was terrific.  Then it was a bit of a disappearing act.  I wanted to close, but wasn't gettting any response.  After the agreement closed, there was a lot of modification and I think this was due to not proper attention at the beginning.  Finally after signing, ,any things filled out were NOT followed.  Checks delivered as opposed to wire transfers.  Checks delivered to wrong address.  Felt very disorganized. Would not use again.", "rating": 2}, {"title": "Your checks were wrong for my payout…", "text": "Your checks were wrong for my payout amount I had to pay out of my uwn pocket and after constantly asking for the same paper work over and over.", "rating": 2}, {"title": "No response", "text": "About 2 weeks before closing on my home equity loan I sent in documents showing that I had several of my bills paid off.  I was told to upload documents and then let them know. Called and emailed at least 6-8 times with no response.  When person came to my house for me to sign closing documents, she said that's terrible and I should report employee.  Needless to say nothing happened and now I'm responsible for sending in checks that are filled out to credit cards/bills to items that are paid off.  So now I have to wait and fight the credit cards for a couple of thousand dollars which shouldn't have had to be sent.  Think twice before applying.", "rating": 2}, {"title": "2 weeks after closing bills that were supposed to be paid haven’t", "text": "Here it is 2 weeks after our loan closed and none of the bills that were supposed to be paid at closing still haven been paid.", "rating": 2}, {"title": "I think I could've got a better…", "text": "I think I could've got a better interest rate. They I was pre-approved with FHA loan then no because FHA does not allow 2 mortgages. I'm in Texas. They said down payment was 5% then they came back and said I needed 10%. The closing cost numbers kept changing. I had to do 3 withdraws because of it. They kept asking me if I had the money for it over and over for the closing. I felt at the end that I was not treated well maybe because I am Hispanic. I will not recommend anyone to Rocket.", "rating": 2}, {"title": "My lending agent was like a used car…", "text": "My lending agent was like a used car salesman give you false hopes lied, and as I said, like a used car salesman", "rating": 2}, {"title": "Lack of communication which led to the…", "text": "Lack of communication which led to the final mortgage documents not being correct.", "rating": 2}, {"title": "I didn't really like the sale pressure…", "text": "I didn't really like the sale pressure from the Executive Banker. Didn't really feel he was trying to help me achieve the best rate for my loan. The information displayed kept changing on my loan and there seemed to always be some kind of system glitch when trying to lock in my rate.", "rating": 2}, {"title": "It took almost three months and could…", "text": "It took almost three months and could have should have given me a lower rate", "rating": 2}, {"title": "4 different quotes to signed neither was final", "text": "had 4 different quotes to signed while going to the process of refinancing, all showing different amounts of money coming back to us and at the end we didn’t received any money back. I finished/Completed all the process only because I didn’t want to start over with another company and its still helped us doing the refinance but we are disappointed with the process.", "rating": 2}, {"title": "They switched us from agent to agent", "text": "They switched us from agent to agent. Never had the same person for anything. Asked over and over for the same documents that we had already sent to first person Dave Wibisksi (spelled wrong) then switched to Ib? then never heard from him again then switched to assistants who kept switching then received a call from Amelia Radecki who tried to resolve everything and she called my husband who is a client by the wrong name. See email if you care to read.  Just felt like it was all about the money and not about us the customer. The closing agent who came to our office was super nice and we felt great customer service with her.", "rating": 2}, {"title": "No reason it should take 3 months + to…", "text": "No reason it should take 3 months + to close.  Everytime we would be close, the underwriters would find something else that needed to be done.  3-4 weeks in they say a water test needed to be done.  This could have been done in week one.  Extremely frustrating experience.  The original person I dealt with was pleasant and understanding.  Second one was rude and argumentive.  Gave 2 stars only because I try to be a nice guy.", "rating": 2}, {"title": "Someone dropped the ball", "text": "2 weeks after closing and still no check disbursement. After making several calls get told that there was a document that wasn't signed. So someone some where dropped the ball. Not happy at all. Amrock don't answer calls and don't communicate.", "rating": 2}, {"title": "Took way too long", "text": "Took way too long, 3 months. The 1st loan process timed put and you had a started new one by transferring my submitted documents. However,my out of pocket cost of the appraisal didn't follow with the transfer, so it hasn't been acknowledged to be reimbursed to me. Another step I now have to follow up on.", "rating": 2}, {"title": "2 additional years of house ins", "text": "2 additional years of house ins. Was taken out on my va loan. Very inappropriate.", "rating": 2}, {"title": "They are in a Hurry, till they are not", "text": "Your portal is horrible.  Was constantly told there were tasks when none were there.  Ended up having to paper sign stuff and scan/email.  Even today, three weeks later, I can't see my account.  When I sign in I am forced into a page that states my credit report is frozen.No one says anything about my Ex still on the deed until the last minute.  They had us sign a QQD, that I never got a copy of and still doesn't show as processed.  My closing was botched.  Too many clerical errors (even my SSN was wrong).  Had to reschedule which set me back two weeks.  Then, instead of paying off my credit card electronically, I randomly find a UPS envelope at my front door with a paper check in it.  It had been there for several days.", "rating": 2}, {"title": "The right hand did not know what the…", "text": "The right hand did not know what the left hand was doing. One person would tell us everything was ok but then get a call from someone else stating that there were issues.", "rating": 2}, {"title": "Sincere", "text": "I felt like there was no sense of urgency from anyone that worked with me to ensure I met my deadline that your company had set in for my interest rate. All my tasks were assigned to me through my Rocket Mortgage app, but many times I needed to be used through a third-party company, and having to talk to multiple different people was less than ideal. Maybe scheduled the meetings with updates just find a better way to communicate and let everyone know that what is needed. What’s the timeline of expectations would be very beneficial.", "rating": 2}, {"title": "A lot went wrong and I'm  not wasting…", "text": "A lot went wrong and I'm  not wasting my time writing a review on a website. If you truly want to know, give me a call. But I am sure that won't happen. Yo u got your money and I am still waiting more than a month later to get my money that I was over charged on to close. Very disappointing  experience.", "rating": 2}, {"title": "Luis Garcia was very slow", "text": "Luis Garcia was very slow. I had to stay on top of him every step of the way and we still was a month late on closing.", "rating": 2}, {"title": "It was difficult to reach anyone", "text": "It was difficult to reach anyone.  They are slow to respond to questions. In the time between when I applied to the time I closed, the interest rates went down about a percentage point and the loan officer said she would \"take care of me\" but did very little to lower my rate.", "rating": 2}, {"title": "Was told check would be overnighted it…", "text": "Was told check would be overnighted it went to wrong address as did payoff checks. Horrible, then a 10 day hold the check will barely be cashed before it's due, was told I'd have option to make first payment due either Feb or March and I was not given that option, I still had pay all my monthly bills this month, then this will be due the first of month, lies tell the truth", "rating": 2}, {"title": "Longest process ever", "text": "Longest process ever. I was given different cash to close amounts all the way up until the hour of closing. Little to no communication about the financial aspect", "rating": 2}, {"title": "too many changes not explained.", "text": "Numbers constantly changed. No explanation. Would be told one thing then paperwork would say something different. So many last minute changes I almost lost the house because they kept messing with paperwork & #’s without telling me. Approved for 1 amount then that amount was too high. This is my 3rd home purchase & worst experience ever.", "rating": 2}, {"title": "Poor and delayed communication", "text": "Poor and delayed communication resulted in unexpected payments in Dec 2023 and delayed closing. Even after closing it took 1 week to receive money (was told they checks would be overnighted) to pay off debts. Some accounts have late fees due to delay. I was told discounts would be applied or requested, but they were not.", "rating": 2}, {"title": "Good and bad review.", "text": "No electronic signing available. Had to sign documents 2 times due to lender's errors. Distribution of funds to multiple entities was done by borrowers and was very confusing. Would of helped if checks has account numbers to help distribute. Banker was awesome in working with us on gathering financial info as part of application!", "rating": 2}, {"title": "Issues with the insurer and Rocket…", "text": "Issues with the insurer and Rocket getting the payment to the right insurer. For some reason Rocket did not send the payment to an insurer we picked and sent it instead to some different insurer we did not have a policy with. Now we are jumping through hoops to get it resolved.", "rating": 2}, {"title": "loan", "text": "Improve refinance", "rating": 2}, {"title": "No one was assigned the title review", "text": "No one was assigned the title review.  No one checked on making sure it was assigned.", "rating": 2}, {"title": "Documents were wrong several times", "text": "Documents were wrong several times. Used another party for the loan and never asked it was ok! Then sent a appraiser from a different state that doesn't know the area. Did not add improvements to the home that we did in the last 2 yrs. New roof, garage, etc! If I new this would happen I would have gone with a local company for my home equity and a local appraiser. Not pleased at all!", "rating": 2}, {"title": "The entire process was a struggle", "text": "The entire process was a struggle. Complete with a notary who did not realize that I had added a middle initial to my signature when that was not on the contract and then tried to blame me for it...on file! So we ended the deal with slander. Absolutely ridiculous. That pretty much sums up my experience. I would do my due diligence, provide all the info and then some, and point out what might be an issue...and somehow it always fell through the cracks! I would have to resubmit info because people weren't reading the documents that were in the dashboard and available, correct contract info because the underwriters weren't being diligent, or other silly things that should have been done by Rocket Mortgage staff but for some reason they consistently passed the ball to me. Honestly by the end of the whole thing, I felt that Rocket Mortgage should have paid me for services rendered and time wasted not the other way around. Still waiting on a resolution/compensation for the notary mistake.", "rating": 2}, {"title": "To many layers asking for the same…", "text": "To many layers asking for the same information multiple times Could not get payoff correctly.", "rating": 2}, {"title": "Ensure to read everything twice", "text": "I was promised a payoff of a loan and that never happened. Lesson learned.", "rating": 2}, {"title": "Lies for no reason.", "text": "They have had my mortgage for quite a while. No problems but THIS time my agent LIED TWICE to me!  Promised to pay the appraisal fee a did not. 2nd issue, I am the sole owner of my home a the paperwork reflected Joint Tenancy. I asked for it to be corrected. My agent Jacob Boljesic calls me back a says he got it corrected and I will receive the updated copy in my email and a hard copy in the mail. I did not receive and called ROCKET MORTGAGE BACK. I spoke to Janice on the research team who said she would call me the next day.  She did NOT call until two days later saying the change could not be done!  She waited until the 3day period was up for me to change my mind on taking the loan.  I have Jacob’s full voicemail in Print stating he had this problem corrected. So, I have lost my trust In This company", "rating": 2}, {"title": "Closing representative was unprofessional", "text": "The request to have their representative show up to our home almost immediately for a home assessment was offputting. We wanted to schedule for a more convenient time for ourselves, but felt pressured. They then canceled the day of, and I had to completely reschedule all of my clients again, with no notice.  Also, during the closing process, we felt that the lady was passive aggressive and struck us both as rude. And yes, it says you’re being recorded. The customer service and professionalism appears to be lacking.", "rating": 2}, {"title": "Got the loan but it was challenging. Service was lacking but very pleasant people", "text": "The appraiser that rocket hired to come out didn't upload the pictures that rocket needed so I had to take the needed pictures. They didn't communicate what they wanted so I ended up take pictures 3 times before I got the pictures they wanted. Rocket and AMROCK would ask me to upload items to rocket mortgage, I would do so and get a call back in a week asking me to do they same thing. When I told them that I had done it they would look and say oh yes that will work, like they never looked at their own system. The title company AMROCK would run into a issue and just stop work on the loan process. I would have to contact them find out what is wrong and work out the problem. For an example the original mortgage company had gone out of business back in 2006 they didn't understand that the mortgage had been sold. They also promised services that never happen but charged full price for the service.", "rating": 2}, {"title": "Shocking Closing Issues", "text": "To start with we have been a Rocket customer for about 2-3 years now. We have never had an issue with our old loan (we refinanced during the rate drop with Rocket and had a great experience). When we went to purchase our new home, we shopped for rates, and found Rocket was one of the most competitive. Our Loan Originator (Aaron Nason) was INCREDIBLY helpful. He listened to what I wanted from our loan and was able to get us a good rate. He even helped answer questions throughout the process and helped me understand closing costs (and went to bat for us to try to understand why we were getting screwed out of so much $ by Rocket--see below). Literally, if I was only rating Aaron, it would have been a 5 star review. Fast forward to submitting our documentation; it was a complete mess. The processor (Star) was really sweet,  but sometimes struggled with explaining what the underwriter wanted from us. We submitted EXTENSIVE documentation (we had a gift, numerous financial statements, W2s, etc.) proving we had more then needed, but still were told to resubmit THE EXACT STATEMENTS  (so that the underwriter would actually look at them) again to prove our funds. This became incredibly frustrating, since we overall had a super straightforward loan. Finally, got through all of the documentation. Star was very sweet and very patient; I have submitted a review separately for her, but she would also get a 5 star review. On to the closing process, which was absolutely a miserable experience and should be completely unacceptable. We were advised (by Rocket) to purchase our insurance in advance of close and pay directly to the insurance company. This lowered our cost-to-close. We then received a 5K sellers credit and had about 1K in Rocket rewards to go toward closing costs. We submitted ALL of our insurance documents 6-days before close, and received a prelim cost-to-closing statement that still included $2,700 charge for insurance. I was the one who caught this mistake (after I had asked multiple times for this to not be even included from the get go since I was already working to purchase it) and IMMEDIATELY requested this be removed to get an updated cost-to-close. Mike Capaldi assured me it would be removed before close and my costs would be updated. 36 hours before close, I received a call from Mike telling me that because I purchased insurance separately, I did not have enough closing fees and had an excess of closing credit and would basically be missing out on $1,700. I was informed that usually I would be asked to buy down the rate, but since it was so close to closing, that if I did this we would have to push back closing (which is not an option as we needed to vacate the house we were selling on the close date). Meaning that I would basically be leaving $1,700 on the table. Being told this was incredibly frustrating and completely unacceptable. We negotiated for that $ for repairs on the house and were expecting to use it to do so. I submitted my insurance information 6-days in advance and Rocket decided to wait until 36-hours beforehand to basically tell me I had no options at that point since closing was so close and that I basically would miss out on it. We ended up having to purchase a home warranty (which we never wanted and do not expect to use) and worked with Mike to get our Rocket rewards $ back so that we could instead use our sellers credit. We ended up missing out on a few hundred dollars, but Rocket's inability to change our closing costs to give us any options after 1) I submitted documentation 6 days in advance and 2) I CAUGHT the mistake immediately (about 5 days in advance) was just shockingly disappointing. We were then given updated \"final estimated\" closing costs the night before close. Then ON THE WAY TO CLOSE, we received a call telling us that those numbers were not accurate and increasing our closing cost about $2,000. To not receive accurate closing numbers until LITERALLY 15 MINUTES BEFORE CLOSE is so stressful, disappointing, and overall just wrong. We basically had no choice at that point but to move forward, regardless of how much money we ended up leaving on the table. Any push back from us, and we would have literally been homeless with a 16 month old baby, while I am also 17 weeks pregnant. Overall, just really disappointed in how the close was handled. Rocket put so much more stress and frustration on our plate during an already stressful situation.", "rating": 2}, {"title": "Lack of communication with agent and…", "text": "Lack of communication with agent and myself.", "rating": 2}, {"title": "Rocket Dropped The Ball This Time", "text": "I will still recommend Rocket because they are great at what they do, but I was disappointed this time. We were supposed to close on Dec.7th. That would give us money for Christmas. Because someone didn't know the laws pertaining to Flood insurance. I tried to tell them that if a guest house has no kitchen, it doesn't require it's own flood insurance. They held up closing all the way to Dec.19th. Didn't fund until after Christmas. That made for a disappointing Holiday. Thanks Rocket Mortgage. Train your people better cause that one hurt.", "rating": 2}, {"title": "I was sent a paper check to one of my…very inefficient way to pay people", "text": "I was sent a paper check to one of my credit cards when I did not requested a paper check. I was told, rocket mortgage will send them a check to pay off the balance and I though they toke care of the balance and they either wire money or send them a check themselves. My credit card charged me an interest rate for the first time because the bank actually didn’t not paid off the credit card. Instead they sent me a paper check for me to send to the bank myself. I have a check book and I can wired money myself to pay off the debt. I didn’t needed rocket mortgage to make any paper checks with the name of discovery that I need to send on snail mail. Is not how I handle things. Very inefficient way to handle things. Now I just paid off the discovery card balance. I just wired them money and rocket mortgage owes me over $8000 dollars that are stock in an old paper check that I have no plans to use and neither I requested. Rocket mortgage failed to make all mortgage funds available to me immediately and they are holding funds from me. I am a grown up adult and they decided how to send me the funds instead of direct deposit all funds to me so I could take care of the funds the way I pleased.", "rating": 2}, {"title": "Poor communication with coworkers", "text": "There is no communication between your employees. We had to send copies after copies of the same material to different people when all they had to do was communicate to other coworkers. The wrong interest rate was on the final paperwork at closing and when I finally contacted someone they wanted me to change the date of closing. So we just went ahead and lost the rate promised to finally get closing done. Rocket sent a refund check (not for the money we lost from the incorrect rate) through the mail instead of certified so who knows where it will end up. When we refinance after rates go down it will not be with rocket.", "rating": 2}, {"title": "Disappointed …", "text": "Did not include an item,added another instead... loan is in both of our names although the checks they sent are just made out to me how am I supposed to pay the credit cards for her because they have my name on them?? Really surprised at Rocket because I thought you did our first so very well this is kind of disappointing", "rating": 2}, {"title": "Closing with our Home refinance", "text": "We came to Rocket Mortgage, looking to remodel our bathrooms, and pay down some debt.  Viciously spoke with Daniel, and mention we got our home appraisal would be about 240,000 for that’s what the county assessors had assessed at. We were told that we needed an appraisal and he thought it would be at 280,000. We spent $400 on an appraisal, which we were led to believe that money would be coming back to us .  The appraisal came in at 254,000… we received a phone call saying oh the appraisal came in lower than we thought so you’re not gonna get as much money as we initially was hoping for. We also informed Daniel, on the initial call, my husband started a new job and pay will increase as he learns the position because he’s a truck driver and it’s based on miles and deliveries.  We come to the closing documents, and found out that Rocket Mortgage we required our equity money to be paid by check through Rocket Mortgage in our home refinance loan.  we were not told by our advisor this it was greatly disappointed. We went ahead and signed the closing documents initially checks were to be drafted December 21, but it changed to December 26. The closing was on December 16th.  Now I have a big problem with checks that been drafted by Rocket Mortgage, because the amounts are now different from the initial and now we are going to have to wait from the companies to issue a check back to us on the differences. And I did not get to choose which ones I wanted to pay off, I’m still very upset over this. There’s nothing to celebrate in this refinance you guys achieved $17,000 in closings and extra cost and my husband and I got $101 as an extra on our home it’s quite discerning. I hope I am a bit happier with Rocket Mortgage later, but I will see.", "rating": 2}, {"title": "Took WAY too long", "text": "Date of experience: December 22, 2023", "rating": 2}, {"title": "Not Very Pleased", "text": "Poor attention to detail. Poor communication. They didn’t drop my interest rates when the rates dropped before closing as well.", "rating": 2}, {"title": "Just had a bad experience", "text": "Date of experience: December 21, 2023", "rating": 2}, {"title": "Difficult", "text": "Very difficult to get answers, too many people call back and are not knowledgeable of steps done and are asking for additional information that was already provided.  The home appraisal was a cluster headache inaccurate information.  GenZ's being involved and giving directions that were not accurate at all", "rating": 2}, {"title": "Very hard to deal with", "text": "Very hard to deal with. Found out to late we should have just used a local bank.  Shifted to different people throughout the process. Had to keep explaining everything everytime.   Not a pleasurable experience at all.", "rating": 2}, {"title": "We did a refi to draw out equity from…", "text": "We did a refi to draw out equity from the house. In the discussion with the loan processor I explained I wanted to pay off a few personal loans, my vehicle and one credit card. I wanted to do this myself not using equity checks as payments would post faster if I paid from my online accounts. The loan processor told me this was impossible for all the differing accounts, but I could pay of the vehicle myself. All the others need to be paid in the closing as a condition of getting the loan. He also stated all the loans would be paid by electronic payment so there would be no delay. I have refinanced before and this was not a condition so it took me by surprise, but after some discussion I agreed. To my great surprise I learned in the closing documents that the payments were not to be paid by electronic payment, but paper checks would be mailed to me and I had to mail them to each debtor. Not a good time to learn this. My choice is to either except it or cancel the loan and pay back all the cost of processing the loan. This mailing to myself and then me mailing to the debtor added several days to the payment process. This time delay added interest cost on each loan.  Then to add insult to injury when the checks were mailed to myself, they were mailed without the requirement of a signature and the mail man just lest them on our porch while we were gone. So I have several thousand dollars of checks sitting unsecure on my porch for any thief to steal. It has been twelve days from my closing and I still in the wait mode for my payments to be received by my debtors. Something that could have been avoided if my request to pay them by myself was allowed. Not good.", "rating": 2}, {"title": "Closing costs were more than $2,000…", "text": "Closing costs were more than $2,000 higher than quoted, they were to subordinate and add back on the city of North Ridgeville to the loan. I even spoke to 2 people with the city and all they needed was a letter from the lender. Neither of these were done and I ended up losing over $7,000 in the cash out refinance. 2 other lenders were actually cheaper and were working with the same company appraisal company. I wanted to keep my mortgage the same, but this actually cost me a considerable amount of $$$$. When I can move my mortgage to a different company in 6 months I absolutely will be doing so. I reached out for communication several times the last week before closing and received none from them.", "rating": 2}, {"title": "We had a loan with Rocket Mortgage and…", "text": "We had a loan with Rocket Mortgage and lost our house to a Hurricane. We bought a new house using Rocket Mortgage and the new loan was 3 times the interest. The confusion with in Rocket Mortgage caused to miss our original closing date. We had to do a lot of running around to get things straight. I feel that Rocket Mortgage should have transferred the loan to the new house and split the interest. I also want to add that there were too many different people through Rocket Mortgage involved with our loan. One loan person would have been better.But everyone we worked with was very good. The system is broken.", "rating": 2}, {"title": "Heather Murphy  was awesome...the rest…", "text": "Heather Murphy  was awesome...the rest of the team did not communicate  with each other making the process take weeks longer than it should", "rating": 2}, {"title": "Too many people each with different…", "text": "Too many people each with different solutions resulting in duplicate are delays", "rating": 2}, {"title": "My loan experience with Rocket Mortgage", "text": "The guidelines provided as well things that were said, were ignored during the closing.  The lady that spoke to my husband was condescending and had zero empathy for what my husband was asking her to do.  In fact she wouldn’t get a supervisor on the line.  There was supposed to be 45 days between closing date and first payment.  She completely, ruin the entire experience of refinancing our home.  In other words, she was useless and your company could save money by getting ready of the “Zero customer care or whatever it’s called’.  On other hand Mr. Darr Grodi did and exemplary job walking us through the application process all the way to the last day.  Our original closing date was 28 November 2023 when we signed all the documents at our home.  A deposit of the funds was to take place no later than the 29 of November.  We didn’t receive payment, but we kept checking the Rocket Mortgage app as we were instructed at the beginning just in case something else was needed from us.   On December 7, my husband received a phone call from the office that did the closing Armrock. The person stated that an error had been made and the closing didn’t go through.  It was an error in the calculations of taxes and we would received $12 less. Because of this reasons my husband requested the 45 days for our first payment effective December 7, 2023.  However, the lady at the customer relations or whatever the section is called, was not helpful, and her demeanor was like she owns the company.We fell the same way with your company as when you buy a car.  Once you buy it, you don’t get the same service or enthusiasm from the company.  My husband and I are both disabled veterans of the US Army.  We made many sacrifices in our lives for our country, and yet your company treat us like fools in the end.", "rating": 2}, {"title": "Dropping the ball", "text": "They need to explain things in detail instead of just rushing through trying to get a quick deal. And when something does go wrong be on top of getting the problem solved. It took me two weeks to get my problem fixed.", "rating": 2}, {"title": "Wouldn't go with Rocket again", "text": "Overall I can only say that Michael Heppler our agent was the saving grace. He was organized, clear, and stayed in contact with us the whole way.The concerns I have with Rocket are the IMMENSE amount of EXTRA supportive documents we were constantly being asked to provide after the initial drop of documents and some updates. We were asked ridiculously to have a \"zero balance\" show on a credit card we use almost daily. We were asked at the 13th hour to provide documentation of something that had ABSOLUTELY NOTHING to do with our closing needs which delayed our closing and our move which was very stressful. When it came time for our home inspection, we were having turf put in the backyard and Rocket said they would not close on the house until it was actually physically installed. Why? Makes no sense.Overall, I would not likely go with Rocket again for any further use. Many people cautioned us against using them and now I understand why but we are stuck for now. My main complaint is that they should be way more detailed in just exactly what all is needed as far as documentation and requirements to close the loan, provide a time line for when these will be needed (and when updated versions would be needed if things get delayed). If they do as many loans in the US as they say they do this is a no-brainer. NOTHING should be left to last minute or surprises. Customers should be given DETAILED instructions and timelines of every single piece of information they may be required to give. So then when it's asked for, it doesn't catch anyone off guard.", "rating": 2}, {"title": "Over promised and under delivered", "text": "Took much longer than expected. Rocket overpromised and under delivered. Ultimately it cost me money.", "rating": 2}, {"title": "#1 rated how?", "text": "Way too much unnecessary paperwork that other lenders don’t need! Multiple forms needed sending more than once. The SPAM CALLS that I opted into unknowingly was Hell. At this point I will not and would not refer Rocket mortgage. Especially to a new buyer.", "rating": 2}, {"title": "This was a needlessly painful process", "text": "This was a needlessly painful process. Underwriting kept rejecting my documentation of assets. I doubt they really tried to understand the situation. If I had not been so determined, this deal would not have gotten done. My Rocket contact was frustrated with the process also. He put numerous hours into helping me. In the end, someone finally got the situation. I bet nine of ten potential customers would have walked away because the feedback from underwriting was so wrong.", "rating": 2}, {"title": "difficualt to work with. Software needs imporvments.", "text": "Continued to get calls/requests from different people for same information. Had approval then still continued to recieved calls for addtional info. After signing final loan docs Rocket mortgage still had it worng and needed addtional paperwork signed. Seemed to be too many people and software issues for a simple refinance.", "rating": 2}, {"title": "The final numbers varied significantly…", "text": "The final numbers varied significantly from where we started. I had been notified of a closing date, along with my title company and the paperwork wasn’t ready. I had to reschedule the closing date. Will not recommend or use in the future.", "rating": 2}, {"title": "Not a good review. I was told at the beginning of the…", "text": "I was told at the beginning of the process that we would close in 21 days. It was actually 44 days. I had much trouble getting in touch with my banking agent. I had to resend several documents multiple times.", "rating": 2}, {"title": "The one that was of great help was…", "text": "The one that was of great help was Hibah. She was organized and professional. The rest of the process was slow and wacky.", "rating": 2}, {"title": "First off I want to say everyone I…", "text": "First off I want to say everyone I dealt with was phenomenal. As far as receiving our money to pay off our debts, that process was terrible. We waited over a week to receive physical checks in the mail which we then had to ship out to our lenders… this is 2023 there is no reason these could not be paid digitally or we receive the money in our bank account to pay the lenders. Due to this antiquated process we now have late fees, we will be taking a hit on our credit score, it has been weeks now and our lenders are still not paid off 👍. All of the amounts on the checks are now wrong, we will have to either receive money back or owe more money to certain lenders. The process of paying off lenders is AWFUL and has caused us immense stress. I could not say enough bad about that because this was the entire reason we refinanced in the first place. I’m positive Rocket Mortgage has received payment for our loan 🤷‍♂️ why is the process for the consumer so difficult?", "rating": 2}, {"title": "Wouldnt recommend", "text": "I was just looking up rates online and entered my phone number and immediately got a phone call from them. That shouldve been my first red flag. We were pre approved quickly but werent told any rates etc. We were told we would save up to 10,000 on closing costs if we used rockets partnered agent. The first one we got didnt want to help us. The second one was very nice amd helpful but not knowledgable  of rocket mortgage at all or real estate in general. We were told all the wrong things from day 1. It made our experience very stressful. Then our clpsing costs even though they knew what we had to spend kept getting higher and higher. Execeding the 2 to 6% they claim it costs to close. We shouldve saved almost $3000 using their agent and i took dozens of quizzes for points which was just over $400. I never saw any proof of that come off closing costs. We ended up adding $5000 to our loan amount to help cover closing and that took our amount down $4000 until 20 hours before closing it went up another $2300. Our mortgage amount also went up at that same time. Which put out debt to income way over the amount to be able to pay our bills. The house we bought wasnt inspected as our agent said the bank would do their own inspection and now theres all sorts of things wrong with the house. I wouldnt recommend rocket to anyone unless you have money to blow and or your very familiar with buying a home and know when youre getting swindled.", "rating": 2}, {"title": "The interest-rate went up from , when I…", "text": "The interest-rate went up from when I originally talked to the person I told him I thought the house was valued $280,000 and the appraisal come back at 2: 94,000But he had put in 300 and some thousand so whatever that caused my interest rate to go up. Not a lot of communication. The guy apparently had left and someone else had to finish up the loan next funding it took a week and a half after the funding deadline to get a check, not happy, we’ll shop around next time instead of going to Rocket Mortgage. I figured it would be easier since they held the loan already.", "rating": 2}, {"title": "Not the greatest", "text": "The whole process is confusing. The communication wasn’t clear.", "rating": 2}, {"title": "In beginning when I started the…", "text": "In beginning when I started the process, instead of telling me everything I needed at one time, it took 6 weeks, and then was declined because they told me at the last minute that I needed a 2 year work history. Now after the reprocessing of the loan everything went fine, my first banker was garbage he left on Vacation and I found out a week later. He lied on my forms stating that the reason the loan was denied was because I refused to turn over my documents that was a lie, if he would have told me upfront about the 2 year employment I would have given it to him, all and all it was a bad experience for me and I don't think I would recommend Rocket mortgage to anyone,  afraid they would have to deal with the first banker and that was a Nightmare.", "rating": 2}, {"title": "Great if you Love High Blood Pressure", "text": "The process was great starting out, but then the process became an overly cumbersome nightmare. Was told \"one final document\" at least 5 times throughout the process. Got cleared to close the day before closing, and received my final numbers. About six hours later my \"final\" number changed costing me another 700 dollars. Extremely frustrating process throughout.", "rating": 2}, {"title": "Bad long experience both time", "text": "Bad long experience both time, wont go through them again", "rating": 2}, {"title": "Too many mistakes", "text": "You did not get my Power of Attorney set up correctly after two months. When Amrock got here to close the lone we couldn't. Then you said you had to rework the lone and said you would now have to get my house appraised, but I would not be charged for the appraisal. I had to keep calling you to find out what was taking so long. Then after we finally closed, I noticed that you did charge me for the appraisal. I had to call about that and now I am waiting for a call back and decision on the appraisal charges. It has not been a good experience.", "rating": 2}, {"title": "too many handovers of responsibility", "text": "too many layers of responsibility, getting a loan through them i had 6 differenet agents at every step of the process the file was just passed down to the next person and there was always information lost in the exchange. it slows down the process mistakes are made and i have to re explain my situation all over again to the new agent.. from loan to processing to underwriting. its counter productive.", "rating": 2}, {"title": "I explained that I wanted my new home…", "text": "I explained that I wanted my new home in my trust.  I was told that it had to be in my name and then escrow could change.  Now I'm left to do this on my own and pay out of pocket.", "rating": 2}, {"title": "Bad mortgage process with serious flaws", "text": "Overall a very bad mortgage process with serious flaws- Delays, repeat of information requests ; lack of request clarify , unhelpful contacts, miscommunication, etc.", "rating": 2}, {"title": "Something has changed", "text": "Something has changed! This the 3rd time, this was a lot more stressful and lot more information needed for less money???? The two first mortgages were perfect..", "rating": 2}, {"title": "Very stressful process", "text": "Very stressful process. After a month of submitting the same documents and showing the same income they finally approved my loan, but was the most stressful and worst experience I have ever had with any company. My broker Zack was great he did wonderful but the company it's self is exhausting", "rating": 2}, {"title": "Very poor information in the beginning…", "text": "Very poor information in the beginning and I paid for an appraisal that was inaccurate", "rating": 2}, {"title": "Our mortgage broker was incapable of doing her job correctly", "text": "We only went with rocket mortgage due to it being tied to our relocation package and they gave us an incentive. Olivia, our mortgage broker, was a completely incapable person to work with. We would’ve not went through with it, if we weren’t already so deep in it and had to buy quickly. Her technical skills were non existent. She kept asking for stuff we had already sent her, then made excuses how zip files change the files. Our minds were boggled. And then she wasn’t communicating properly with us during the most critical parts, and just locking us into buying with points, which we told her specifically we didn’t want to do. So she messed up completely, and we had to pay for it. On top of that she was figuring stuff out on the phone, wasting our times, as we went. She figured out on the phone while we were talking with her, on the very last week that oh, it’s not a condo after all, but now a PUD, changing things too. And we were beyond stressed out to hear her being so unprofessional. She should’ve checked these things as she got the property and called us with the right information at hand instead. She did not know how to do this job and should be looking into doing something else. Seriously. So yeah I wouldn’t go with them again, and I do not recommend their services.Edit: The person replying below did not call or was in touch with us at all, so I don’t know why they are saying we spoke on the phone after my review. Another indication for y’all that they don’t have their act together nor know how to use the internet or make phone calls apparently. I also see no reason why I should make the effort to call them and discuss this experience further and waste more of my time, unless they can travel back in time and hire better people.", "rating": 2}, {"title": "Didn’t feel that communication was…", "text": "Didn’t feel that communication was clear and I felt I was a number in the COG.  We had to refill out several times a document because of an internal error on your side.  Will pay quickly and when rates drop again get rid of all Rocket Mortgages", "rating": 2}, {"title": "They did not understand what a septic…", "text": "They did not understand what a septic system was and wanted me to test it for drinkability. Then they wanted to health expect to inspect it. A septic tank holds poo water! What do you think it would find?", "rating": 2}, {"title": "You never get to speak to the same…", "text": "You never get to speak to the same person! It is very frustrating and time consuming to have to explain what you need every time with a different person! Plus it took forever and I’m not sure the group we dealt with knew what they were doing! We will not go with Rocket Mortgage in the future!", "rating": 2}, {"title": "Having the representatives give true…", "text": "Having the representatives give true facts in the interest rate.I was initially quoted 9.225 turned into 9.625.In addition, having representatives demonstrating more interest during the process.Lastly, having the representatives at the close of the loan, sending an email/letter taking us for allowing to assist us and thanking for the business.", "rating": 2}, {"title": "The day before closing we had to…", "text": "The day before closing we had to provide additional documents and it delayed closing.", "rating": 2}, {"title": "Bad experience", "text": "Negative Experience:Name spelled wrong when corrected, original interest rate increased.  Locked interest rate / payment, then went up again.  Wasn’t informed interest rate locked to house appraisal and appraisal lower than any other appraisal we have received.Had to keep calling to get updates since website stuck when Rocket working on had actions.When our todo list received action item, if not done by end of that day it was flagged as late.Communication through whole process is worst ever had with Rocket Mortgage.", "rating": 2}, {"title": "Rocket mortgage released my phone…", "text": "Rocket mortgage released my phone number without my permission to credit bureaus and other 3rd parties, and then washed their hands of this violation of my privacy. I have received just under 500 calls from other vendors that got my phone number thanks to Rocket. If this is part of your process, I will never use Rocket again. I am being forced to change my phone number and Rocket is responsible. And don't tell me that you didn't do it. Your process is flawed and it triggered the release of my number without my permission. Do not ever contact me again. I am done with Rocket.", "rating": 2}, {"title": "Process was too long from start to finish.", "text": "The process for me from start to finish was extremely too long. There was a constant need for certain documents, which I thought could have been given in the beginning of the loan process. I was still asked to provide documents days before the scheduled closing and almost did not close as scheduled.", "rating": 2}, {"title": "CS person is always in a meeting", "text": "CS person is always in a meeting, did not immediately return calls as requested, and was full of himself. Loan was fast.....service stunk!", "rating": 2}, {"title": "Poor communication between different…", "text": "Poor communication between different departments Dates continued to slip Closing not smoothOverall information requested was excessive including information that had no bearing on the loan.  Your underwriting team needs to exercise, at least, some common sense.To many lawyers to many weasel words.Refies had worked for me in the past but this process was a nightmare.  I will go elsewhere in the future!", "rating": 2}, {"title": "Disbursement not timely.", "text": "Disbursement not timely.Paper check issued for a payoff", "rating": 2}, {"title": "Probably wont use them again...", "text": "I was not able to reach my agent consistently and was passed around to different people. It made communication and deadlines difficult. We had an extreme hassle closing on time because of additional requirements by Rocket made requiring handrails to be put up despite it being a conventional loan. I had to call numerous times to get it pushed through the day before we were scheduled to close. I have had a positive experience with Rocket on a previous purchase, but not this one, and I will probably not use them again.", "rating": 2}, {"title": "Poor service after you sign the agreement", "text": "My application process up until the time to close was fantastic. The agent was in constant communication with me at least daily if not several times a day by email, phone and text. Closing was delayed and hidden fees appeared. My renewal finally closed 2 days late after which time they increased my loan amount and I still had out of pocket fees to pay. I was also told that I would be reimbursed my home appraisal fee. When I inquired about this when all the hidden fees appeared, I was told the reimbursement would happen once my mortgage closed. It has now been 3 weeks and I have not received any type of reimbursement. I emailed the agent 2 days ago and have yet to receive a response back. I emailed again this morning so will await a reply. I find it appalling that I had constant communication while they were competing for my business but now that I have signed and they have my money for the next 2 years, they don’t feel a need to provide the same customer service!", "rating": 2}, {"title": "Dealt with to many people and they…", "text": "Dealt with to many people and they didn't even seem to know what was going on.", "rating": 2}, {"title": "Closing costs - buyer beware", "text": "The fact that the company charges so much money in closing costs, AFTER the loan is scheduled to be closed, is absolutely mind boggling. They back you in a corner and if you’re needing to close soon, you have no time to shop around or have other options. Just very frustrating how they tack on these very high closing costs at the last minute, even after updated cost estimates…", "rating": 2}, {"title": "Everything was good until closing team…", "text": "Everything was good until closing team took over.  Then communication broke down between the team and myself. Information was relayed more accurately from the other party then through the rocket team to me.", "rating": 2}, {"title": "Disappointed", "text": "I was very disappointed in how some of your team members neglected to keep us informed on our loan. I was also VERY disappointed in how one of the representatives treated me. In the future we are considering switching from Rocket Mortgage.", "rating": 2}, {"title": "Not very good", "text": "Not very good. It was a long and painful process", "rating": 2}, {"title": "Loan Officer did not listen to needs", "text": "Loan Officer did not listen to needs.   Tried to upsale many times after telling him exactly what I needed.   Did not want to borrow more than needed.   Told several times did not want to or need to pay points.   Took about 2 weeks longer then needed.   Did not understand LLC's.   Was a mess.   Once I stated I was talking to another Loan Officer, things got rolling.Fees went from $3500 to $10,000 back to $3500 when I put stood my ground.", "rating": 2}, {"title": "The agent did not return phone calls or…", "text": "The agent did not return phone calls or emails. I left numerous messages that were ignored. Very unhappy. I was told since it closed the third week of month, that I would most likely not have to start payments for 2 months. I kept asking and was ignored!! Still waiting!!!", "rating": 2}, {"title": "Ir was unpleasant to go thru.", "text": "Date of experience: October 26, 2023", "rating": 2}, {"title": "Lack of communication big time…", "text": "Lack of communication big time .one.hand not knowing what the other doing....way to long for approval.....and if not approved lead person should not tell you you ate underwrited totally ridiculous.....", "rating": 2}, {"title": "I was led to believe that the creditors…", "text": "I was led to believe that the creditors would be paid by Rocket mortgage. Instead I was mailed checks to send to the creditors myself. That involves me needing to contact each company, mail them a check for the INCORRECT amount because I have continued to pay my debt, contact them for reimbursement of overpayment all while paying interest on debt that could have been paid initially either by myself or by the mortgage company.  I was told that the company is unable to issue checks or use ETF which is laughable for an online company that was able to direct deposit over 50 k into my savings. I have never heard of a company requiring the customer to do the work that was supposed to have been done for the customer that paid for this transaction.", "rating": 2}, {"title": "I never received my appraisal even…", "text": "I never received my appraisal even after multiple requests", "rating": 2}, {"title": "After the initial consultation I never…", "text": "After the initial consultation I never heard a word from anyone until I started reaching out. I had multiple offers on the table and I honestly feel now that I took the wrong one. Amrit was great but when it left his hands it was horrible.", "rating": 2}, {"title": "Difficult and stressful experience", "text": "The client rep I had initially started with had to leave for a preplanned trip. I got passed along to a different person, and while she seemed very pleasant she didn’t seem as knowledgeable. The underwriter made it extremely difficult for us as they refused to accept the documentation we provided. If they weren’t incompetent then they were just making it deliberately difficult as the information we provided were very easy to understand. Because they kept refusing our document we ended up reaching the time limit set on the loan and we were denied a loan. We had to restart the process and was charged the $500 good faith charge again.", "rating": 2}, {"title": "One person was great, the rest, not so much", "text": "The mortgage banker we worked with was amazing but the rest of the team was not as good, by far. I had difficulty getting them to understand the statements I was making and they would not answer questions asked. The closing agent was swift to respond but gave incorrect information and caused my closing to be delayed because they didn't check where the people on the loan were located, though that information had been the same since the start of the process.", "rating": 2}, {"title": "Rocket MortgagMageortgage", "text": "Rocket Mortgage had too many people involved in the process.Each person would ask for information already handed in. There seemed to be a great lack of communication among themselves. A great waist of time in duplicating same tasks. I was told 30 minutes before closing to raise the amount of my cashiers check for closing. Nearly an impossibility. Again a total lack of communication among the Rocket personal trying to handle the process. Due to my experience at this particular time I would definitely NOT recommend Rocket Mortgage. I took out a VA loan and the process was supposed to be simple.This is the fourth VA loan I have taken out to buy a house. Rocket Mortgage made this the most difficult and frustrating process I have ever gone through.", "rating": 2}, {"title": "Horrible Closing experience!", "text": "The loan officer was helpful in helping getting the loan to close, however on closing day we had multiple issues. These issues leaked into several days, clerical issues that were not corrected promptly for an on time closing. The documents were prepared incorrectly 3 times that new notaries had to be ordered for each instance. I spent several hours on the computer trying to sign documents where their system was not working properly. Then they switched to an in person notary in which the wrong address was used to set up the notary ( 3 hours away) requiring an entirely new date and time to reschedule. Closing should not have take so many hours and spanning over several days, it ended up taking 5 days to get the correct documents signed and notarized.", "rating": 2}, {"title": "My loan agent Geri was rude…", "text": "My loan agent Geri was rude and condescending. Telling me I didn’t understand how it worked when I questioned why the payment amounts didn’t match on the review firm and the online signature form. I would not work with her again!", "rating": 2}, {"title": "It took for ever sending the same thing…", "text": "It took for ever sending the same thing over and over constantly wanting something else. Interest rate was suppose to stay the same but it doubled. Not happy", "rating": 2}, {"title": "I dealt with 15 different people", "text": "I dealt with 15 different people. Every time I had a question they would have to put me on hold to review my file. They would proceed to tell me they would have someone contact me, that usually took 2 - 3 days", "rating": 2}, {"title": "Did not go as expected.", "text": "Our original contact Adam did not give us the info needed at the onset to help us get our loan approved. Our contact that set up the closing didn't wait for the property tax info to come in. She used the prior years taxes instead. They ended up coming in quite a bit higher than estimated which changed our payment substantially. I would not recommend using them for your mortgage.", "rating": 2}, {"title": "The amount of time from start to finish…50 Days", "text": "The amount of time from start to finish was 50 days and was not impressed with the amount the amount of documents that I had to submit and resubmit. Also communication was not very good, as I had asked for a response via email and never got it", "rating": 2}, {"title": "Talking with a person instead of email would be great and it being the same person each time instead of having to explain this each time", "text": "Being up front of the process and the time frame and the out of pocket money and the constant asking for the same information over and over and at closing the paying stuff off the money wasn’t right because they asked for a 10 day payoff and it was still over a month before we closed and it wasn’t on me very bad experience for me I hope going forward is better that what I have experienced with Rocket mortgage so far", "rating": 2}, {"title": "Terrell Crowley was terrible", "text": "Terrell Crowley was terrible.  He wasn't on the ball and cost us large amounts of time.  Jeffery Warner did great and got the deal closed.", "rating": 2}, {"title": "We will find someone else next time", "text": "We were very disappointed in our team. There were multiple incidents where information was either withheld or they just didn’t understand the process. Instead of having a plan in place we had to play catch up. Then arbitrarily a dead line would be set that actually didn’t seem to matter. We would ask direct questions that were never addressed. We provided a time frame for when information would be available for us to share but we still received several emails, almost daily about the subject. Ultimately it was clear that they did not listen to us or our concerns. They get two stars for actually processing the loan.", "rating": 2}, {"title": "Too many hands on the account", "text": "Always too many people working on one account. We signed paper work that had a complete different persons name on it whom we had never spoke with. Everyone’s not very knowledgeable about the process. Needs to be one person on an account. Company needs to understand quality over quantity. Didn’t listen to our needs of the title changing either. Glad it’s over. We’ll just pay our bill.", "rating": 2}, {"title": "Rate too high.", "text": "Date of experience: October 15, 2023", "rating": 2}, {"title": "t was hard to get hold of my agent…", "text": "t was hard to get hold of my agent after they went out of the office. Talked to more agents and they gave me different stories about my down payment. First I was approved after they ran my credit check then all of a sudden they said I need to get my credit score above 620. Ran my credit three times in all so my credit went down after my actually got it past 620.", "rating": 2}, {"title": "Not a good experience overall", "text": "The loan amount that was originally approved was based on calculating our income and income-to-debti ratio ncorrectly on RM's end after we explained that the income was incorrect early in the process, then we had to explain that the income was incorrect again later in the process. The second time was due in part to the RM form not requesting our total annual salary from HR, only the monthly pay. But the loan officer tried to talk us into accepting a much lower loan amount over and over again, while completely ignoring that we told her multiple times that the income was incorrect. It took a few days, but because we were persistent about getting our income reported correctly, it was finally corrected, so that our debt-to-equity ratio could be calculated correctly and the loan amount offered increased accordingly. Also, the Appraiser had to reschedule on us twice, we rescheduled once ourselves, so we were OK with changing the date so many times until we were receiving an insane amount of calls from RM, 9 per day, and throughout until the end of the process, even after we explained what was going on. We had to eventually have calls sent to voicemail automatically. Unlike, the first time when we decided to try RM out with our mortgage, after being with BofA so many years, this second loan experience was bad from beginning to end. The first loan process went very smoothly. But, after the 2nd loan process, we would likely go back to BofA in the future.", "rating": 2}, {"title": "This is our second experience with…", "text": "This is our second experience with Rocket Mortgage. We were extremely happy with our experience the first time around; our second experience was pretty much the exact opposite. While our “banker” was very good, our mortgage processor was an entirely different situation. She harassed us, our realtors and the title company. We were constantly told we were “psst due” on the requirement to have the closing numbers weeks before closing inspire of her being told by us, the realtors and the closing company that the statement would be available 3 days before closing. She called each person - me, my wife, my realtor, the closing agent and got the same message from everyone. I was told by all involved that they didn’t appreciate our mortgage representative. At one point I called the banker to see if he could get her to back off. We would HIGHLY recommend you find another mortgage company. We will never use them again. VERY POOR EXPERIENCE.", "rating": 2}, {"title": "We would have been more satisfied with…", "text": "We would have been more satisfied with ONLY 1 contact person. Certainly others were involved along through the journey but we kept getting new people calling us and maybe only 1 time. A bit confusing especially when we learned of closing date 3 days before we were contacted by yet again another agent.", "rating": 2}, {"title": "Salesman was not knowledgeable about…", "text": "Salesman was not knowledgeable about the loan specifics. Very  un knowledgeable", "rating": 2}, {"title": "Took equity from my house", "text": "Took equity from my house. I asked about paying one of my creditors. Turns out I get a check made out to my creditor for amount 500 dollars over what I owe. I’m responsible for mailing the check and coordinating my refund why? Not very good for the customer. Also took 5 days to get my money.", "rating": 2}, {"title": "It was going good until our mortgage…", "text": "It was going good until our mortgage agent became ill  which happens in life. So they handed it off to someone else to handle and they totally dropped the ball never even looked at it until my husband called and said we're these few changes adjusted and what are my final numbers. The agent never touched it for a week it came down to closing and all went to hell in a hand basket. Very disappointed in rocket mortgage and the way this was handled or as should I say never handled  it was very stressful", "rating": 2}, {"title": "Not the experience we expected", "text": "After using Rocket to refinance our previous him and how easy the process was we were quick to go to Rocket for a new purchase. Unfortunately we did not get the same experience this time around.  During the account application process our banker told us what we needed to do including what to payoff to assist in the debt to income ratio, which we did and even shared multiple times how we were accomplishing it. As the application process went on it became very frustrating with all of the different documents that was request to send, many was repeat of what we already sent or had nothing to do with the mortgage. The next representative we were connected with never had a clear answer on why the underwriters needed something, all I would get is let me get back to you because I’m not the money person I just collect the documents. Then as we were a week from closing we were told that the loan had to be restructured which caused our payments to go up over a thousand dollars all because the banker that took our application never said anything about not using cash to payoff debt or what would have been the best way to do it.  At that point our hands were tied because we were supposed to close in less then a week so felt we had no choice but to agree to the new terms. This left a very bad impression of Rocket. The only reason that I gave two stars instead of one is because of two of your employees we interacted with was extremely helpful during the process.", "rating": 2}, {"title": "I looked at local mortgage provider", "text": "I looked at local mortgage providers and their closing costs were much cheaper and more accurate. You said my closing costs would be about 5800 and then you said 6300 and then it came out to $7600. And my agent had me pay $1500 to buy basis points and there was no point to do this, when you buy basis points you are beating that rates will not go down for 2 years or more and rates will 100% go down within two years of getting my mortgage.", "rating": 2}, {"title": "Lack of communication", "text": "Lack of communication, delay as in closing, incorrect Information. No resolutions when we called.", "rating": 2}, {"title": "First payment due date changed somewhere in the refi process", "text": "One of the bigger draws pushed by the mortgage banker to refi at this time was that the first payment wouldn't be due until December.  Not sure when that changed in the process but at the end of it all, the first payment is due in November.  Overall, fairly satisfied but very disappointed to find that out.", "rating": 2}, {"title": "We kept getting different info from the…", "text": "We kept getting different info from the people working out on loan. One would say we were getting this amount back in pocket then we would talk to another person and they would say different. Even down to the last day when we signed our final documents we were told our fist payment would be December 1 and our loan documents ended up saying it November 1st. There was obviously no internal communication with the people who were handling our refinance. We were close to backing out multiple times. Not very happy with our experience.", "rating": 2}, {"title": "Communication was not good throughout…", "text": "Communication was not good throughout the process, especially when it came to closing costs and what to expect.", "rating": 2}, {"title": "Poor customer service", "text": "Date of experience: October 05, 2023", "rating": 2}, {"title": "Not as promised", "text": "It look way longer than they initially told me. Things they told me would work and be fine we’re not and that delayed closing. Them checks they sent me to pay off debt were no longer accurate when we closed and it’s a headache for me having to pay the differences.", "rating": 2}, {"title": "First home purchase", "text": "All they care about is securing your money. Disorganized, good at omitting  information, and quick when it benefited them. Would consider else where, when it comes down to doing this again.", "rating": 2}, {"title": "The initial was great", "text": "The initial was great. Waited til the last week to have so many delays. Kept blaming issues with other companies that are contractors with Rocket Mortgage. Amrock is a third party title company and it was like pulling teeth to get a straight answer on whatever the delay may have been. Bait and switch of smooth sailing to get to the finish line then get jerked 10 steps back and then move closing date over a week later. Nobody once mentioned how the closing could happen with so many issues or the last minute approval process and timelines- wanted to bow out numerous times but they had me so far in it would’ve been an even longer process to find a different lender. Closing agent didn’t initiate conversations- I had to consistently ask for updates and then when I would get calls, was told she gets off at 5 and was trying to push for closing before then but doubtful it’d happen. I can’t fix the issue if it’s on my end if you don’t tell me about it until 4:45! Then when we finally get the clear to close, I quickly get called back stating the attorneys needed 48 hours and she was “super sorry” very unprofessional and by the way, NOT TRUE! The attorney stated she/her office didn’t need that! Not a good first time home buyer experience toward the end whatsoever!", "rating": 2}, {"title": "For starters when I asked what my…", "text": "For starters when I asked what my interest rate would be and was told 7.25% I thought that was great and fair.  What I didn't like I'd when I got my closing documents and saw I was paying for 3 points to get that rate.   You should be transparent and upfront with your customers.   The only reason I'm giving 2 stars instead of 1 is because you did take me from 3 to 2 points.", "rating": 2}, {"title": "My mortgage process was delayed 72…", "text": "My mortgage process was delayed 72 hours every time there was an issue Not sure who does your title search.  Certainly not thorough at all!  You need a new company!1.  Wanted to know if we still owned condo in Willow Bend.  I forget unit # (NOT the one we had owned).2.  Asked if Gary Weller was David Weller in Conway.  No never heard of him.  Wote a letter stating that.3.  The question arose AGAIN at the last moment.  Said the outstanding tax lien of $4000+ had to be paid.  I said no way.  Give me the info.I HAD to do the research.  It WAS NOT a tax lien on our property AT all.It WAS NOT my husband.It was David Weller in Conway.  And oh by the way that lien has been paid in 2018.", "rating": 2}, {"title": "I was very disappointed as I thought…", "text": "I was very disappointed as I thought after going through the first mortgage it went very good.  The second one was a little up and down.  I have to contact them to find out what I’d going on. I knew our credit with credit cards was a burden but I knew we  will pay off  which that is how it end up.  I think the person that was helping me I have to email to ask question about the loan but it was finally close.  The deal was we closed the loan and told me that they will pay the credit cards off to get out credit done. I understand that so we accepted and move forward,  we closed on the 25 and I was told checks will be mail out and I have to mail the checks out.  Wr received the money direct deposit soI expected to get the check in a couple days.  When I did not get the check On the 4 I contacted them and they told me the checks was mail ups overnight.  The next day they gave me a tracking number and I contacted them telling them I did not get the checks and I still don’t have them.  I know we are going to sell this house and get another house .  I will think before I go through you guys again ad this time your customer service sucks", "rating": 2}, {"title": "Worst communication ever", "text": "Worst communication ever . I have had well over  a dozen mortgages and this was the most cumbersome repetitive process ever .", "rating": 2}, {"title": "Impersonal", "text": "Impersonal, expected me to do the work", "rating": 2}, {"title": "Poor and Slow Responsiveness", "text": "Initially very impressed with the responsiveness until I was handed off to a group of people that were not able to didn't want to answer my questions. I had to really push a number of times to get this loan closed and it became unpleasant. I would not use Rocket Mortgage again. They did not love up to their claims.", "rating": 2}, {"title": "When you got to a certain point in the…", "text": "When you got to a certain point in the mortgage process your contact person was changed. The new person often had different instructions and answers than the previous person. They also must not communicate with each other. We were often asked the same questions from each different person. Better notification of new tasks would have been appreciated as we.  Often there were new tasks that we knew nothing about.", "rating": 2}, {"title": "Don't trust the Snake Oil salesman.", "text": "Basically everything the mortgage broker told me wasn't true. I didn't find out the truth until I got the closing documents and clarification from the closing agent.  It least someone told the truth.  What I ended up with wasn't at all what I was promised.   The company should honor the original deal.", "rating": 2}, {"title": "Not listened to", "text": "Overcharged for points that I did not request and was not listened to. I was shoved thru the process but I do not feel my best interests were kept at the forefront.", "rating": 2}, {"title": "I was given information erroneously", "text": "I was given information erroneously that closing in October ‘23, that I can make my first payment December 1st, by calling the closing department same day when my closing date was scheduled.  It was enough to put a sour taste using Rocket Mortgage.  I didn’t like being lied to. Rocket Mortgage representatives are professionals and should know their business in my state where I live.  I don’t take lightly being told wrong information and cannot refer RM to anyone else.  Any good agent working my loan has the lable that they do not know what they’re talking about when informing the customer of those closing options.", "rating": 2}, {"title": "Will NEVER use or refer ANYONE!", "text": "Too many problems involved without knowledge of loan and whom are unable to answer questions. Loan officer passing us off 10 days after closing when homeowners insurance was not paid and needing to file claim following storm damage. Insurance department not knowledgeable in how escrow even works at closing! Seriously the worst experience EVER!!!", "rating": 2}, {"title": "we had to due a closing twice....", "text": "we had to due a closing twice..... which was a problem", "rating": 2}, {"title": "Too many stories", "text": "I was told several times that I had completed all of the required tasks, only to find out that I needed several more items and several more weeks of jumping through hoops. It was not an easy process and too many people were involved.", "rating": 2}, {"title": "Need to be more transparent upfront…", "text": "Need to be more transparent upfront about rates and fees to be helpful. Bouncing around to multiple people when there was a problem with the processing and delayed follow up on the issues with no timelines caused stress up until the day before closing.", "rating": 2}, {"title": "Nice people, but the company lacks organization", "text": "First, this was the fifth home I’ve bought in my lifetime and by far, the most frustrating and aggravating process of all of them.  Rocket pairs up with Amrock ( escrow/title division). I believe they are basically the same company but separate divisions.  Between the two, I had 10 different people emailing or calling me.  One didn’t know what the other was doing and it would take 24hrs to get things straightened out.   Then at the end, there was a discrepancy in the amount that the closing costs were and I got it sorted out with one representative and two days later, a different person says I owe the first amount, which was almost $1800 more. That took 3 days to sort out, although I sent screenshots and receipts. My closing was delayed a week.   I will say though,  every person I spoke with was polite and professional, I just wish they would assign ONE point of contact and all correspondence should go through them.", "rating": 2}, {"title": "My issue is not that I was asked too…", "text": "My issue is not that I was asked too many questions.  My issues are1.  I was asked the same question numerous times.  I felt that nobody was listening.  I would answer a question and then a week later the same question was asked again.  And then a week later the same question was asked a third time.  This happened all the way up until two days before the closing was scheduled.  2.  Days or weeks after supplying information and answers to questions, I was asked more questions and asked for more information.  I feel all these requests and questions should have occurred in one batch or at most, two batches.  Instead it was drip, drip, drip.  This made the process nearly unbearable.", "rating": 2}, {"title": "The first person we had contact said it…", "text": "The first person we had contact said it was ok if my wife was a travel nurse then it changed as the process went on.  Seemed like every day you needed more from the co signers. Should all be spelled out in the beginning.  Too many people involved at your end. Seems like everyday we were handed off and was confusing.", "rating": 2}, {"title": "False promises", "text": "Information was manipulated during the initial pre-approval/quote process to make the initial quote look much better than what was actually possible. Contrary to the promise of a rate lock the interest rate that was “locked” was not honored.I have been spammed and harassed due to insecure practices or the sharing of my information.", "rating": 2}, {"title": "It started out good then it wasn't", "text": "It started out great then it wasn't. There was a mistake in appraisal and then had to do it all over again, and then they tried two more times because of confusion from rocket and the title company. Also Had to give the same paperwork more than once because the appraisals delayed it long enough that the original timeframe was up and so, had to do it all over again and none of it was our fault...and then the rates went up. We lost money because they all made mistakes and delayed our closing. And now our monthly payment is higher.And they claim I spoke to someone to address my concerns....no one talked to me.", "rating": 2}, {"title": "Was not clear on closing", "text": "Date of experience: September 14, 2023", "rating": 2}, {"title": "During the application process I needed…", "text": "During the application process I needed to submit my proof of residency multiple times.  I also need to follow-up myself on the application progress and promises on closing timelines were not accurate.", "rating": 2}, {"title": "Be careful", "text": "The process was going pretty good, until closing.  Come to find out, I had 3 bills that were added to the closing that I was not aware of.  One was for $2,347.00, another for a little over $300.00, and one for $37.00!  I would have paid them off before closing but was NEVER asked to.  Now I'm paying on them for the next 30 years!!!!  Bad business and you didn't watch my back.", "rating": 2}, {"title": "My overall experience was not the best…", "text": "My overall experience was not the best with rocket mortgage.   During the initial screening to determine qualification for my boyfriend and I was not complicated. However, when submitted the application for the loan we were taken through hoops due to our status in NY and the sale of my boyfriends existing home to purchase the new home in NC.    The turnaround time of letting me know of document requirements was slow, which push it to the last day of closing to get everything finalized.    At this time I’m not sure if I have the opportunity to refinance that it Would bd with rocket.", "rating": 2}, {"title": "Constantly asking for the same…", "text": "Constantly asking for the same documents over and over again.  Wanted more recent paystubs although we sent them paystubs thar were only 2 data old.  Very frustrating process.", "rating": 2}, {"title": "Find a local company that will tell you the truth", "text": "The processor did very well. The loan officer was totally unresponsive. He was just to busy to be bothered to return calls. When I was able to reach him, he talked mostly about what was going on in his life but very little attention to what I needed to do to get answers. He told me on three different occasions that my rate was locked, It was not!I would not recommend Rocket, nor will I use Rocket when I refinance. I will.ignor your company in return for being treated that way by you.staff. Alicia was great but her hands were tied by Shane Roring. I was mortgage banker for 42 years. I went from loan officer to.president with several different firms during that time.I terminated loan officers for less infractions that I had to endure dealing with your firm.", "rating": 2}, {"title": "Didn’t get cash out I was looking for", "text": "Date of experience: September 11, 2023", "rating": 2}, {"title": "Terrible experience trying to close", "text": "Terrible experience trying to close. Given misinformation, no information and wrong information all of which resulted in delayed closing and ME being charged fees for the extra days even though it could have very easily closed in time. I will not recommend your services.", "rating": 2}, {"title": "Not good I hah to do almost everything…", "text": "Not good I hah to do almost everything by myself", "rating": 2}, {"title": "I already wrote a complaint regarding…", "text": "I already wrote a complaint regarding Adam the banker I worked with and had a call from a Rocket representative.Every other time I financed with Rocket I have been very pleased", "rating": 2}, {"title": "Big regression from last time", "text": "Big regression from last time. I used Rocket (then Quicken) for my first mortgage and was pleased with their performance. They communicated well, got me a good rate, and cut me a few deals to really help me afford the house and feel good about it. This time was very different. I felt bounced around and shuffled between representatives, none of them really knew anything about what was going on. I constantly had to fill in the gaps as there hand-offs were sudden and poorly done. Multiple times we would have to request things multiple times or just get told \"don't worry about it\" only to be chastised about it later. The upload portal was worse and by the end, we didn't really get any help from Rocket on closing costs or interest rate this time.Really disappointed after how well the last mortgage went.", "rating": 2}, {"title": "i have purchase 2 homes in the past and…", "text": "i have purchase 2 homes in the past and had a much smoother experinence with providing documentation and accpeting what was submitted", "rating": 2}, {"title": "I have some complaints about how my…", "text": "I have some complaints about how my mortgage was handled. First I had problems with the online closing. One little mistake and it was rescheduled. Two- we were called on the same day of closing, to tell us that we couldn’t close because they had to verify my son’s employment. Third my funds didn’t come in a timely manner. My first payment is due in 2 weeks and I have yet to receive all the funds due to me.", "rating": 2}, {"title": "This was not a positive experience", "text": "This was not a positive experience. I would not recommend", "rating": 2}, {"title": "delay in closing after papers were…", "text": "delay in closing after papers were already signed and lost....information needed was not passed along to proper channel resulting in me having to send information needed several times   extremely frustrating", "rating": 2}, {"title": "The banker I had at first kept telling…", "text": "The banker I had at first kept telling me one thing and another happened.", "rating": 2}, {"title": "It was the most unpleasant and unprofessional experience", "text": "It was the most unpleasant and unprofessional experience I have ever had nobody could answer a question. You waited until the last minute to ask for proof of proof of stuff I already entered you ask me for information you had access to I was terrible and will be the last time I ever use you. The only reason I left a 2 star and not a 1 is because I actually closed on the house and the title company said that you guys were a pain and the realtor on both sides said they hate dealing with yoy", "rating": 2}, {"title": "The mortgage origination was not very…", "text": "The mortgage origination was not very transparent and ended up costing me a lot of money.  Had the person informed me along the way I could have made some changes to my application.  I went with Rocket because you were a 1/2 Percent less than a local loan I already was approved. In the end cost me more.", "rating": 2}, {"title": "Communication was horrible!", "text": "Communication was horrible!! With everyone! They would say one thing then that’s not what they said! Would tell u they would call back at a certain day and time that NEVER happened! Calls were never returned to anyone- us or any of the realtors! Not a good experience at all! Was very frustrating!", "rating": 2}, {"title": "When talking to Charlie", "text": "When talking to Charlie, he was very helpful and great to work with. Omce it went to underwriting it was awful. I had to send documents over and over again. When I would try to answers of you text on line, it not helpful at all. I also talk to people after Charlie that was not very helpful and kinda rude.", "rating": 2}, {"title": "Good, Bad, and the Ugly", "text": "Jennifer Winfelt was fantastic! Then we were passed to loan processor Lillian. This is where things went south. She called and asked questions which I responded and provided all information. More often than not the questions were asked again where I recited our previous conversation and gave her the answers again. The home owners I had all set, then she stated a wrong address for mailing and Lilian gave me the address via text and I called and had this changed.  I have gone through many closings/refinance of homes.  This was the worst customer service I have experienced.  The  closing costs were to be included into the loan. The day of closing someone called from rocket to explain what we would need at closing. It initially didn’t click with me this was not in included in the loan. It was maybe 40 minutes later that I called and talked with Lilian explain this was to be included in the loan, and asked if this could be changed. She assured me it could, there was plenty of time and since we haven’t signed the paperwork this will be no problem. Well it was a problem, we went to closing and going over the paperwork work the closing costs still showed we were paying this at closing. After explaining this should have been changed the title company checked emails, messages and found nothing had been sent. So we either closed as scheduled paying the closing costs today or we would need to reschedule the closing. The question became pay the closing costs or be homeless? Which would you choose? We chose to close.", "rating": 2}, {"title": "Wasn't aware this would be a dry close", "text": "I've been disappointed with the time it's taken for everything to be processed. We cruised through the initial steps and closed pretty quickly, but then it took a week and a half after closing for our initial loan to be paid off and our closing funds to show in our account. We also are expecting checks to pay off our creditors (the reason for refinancing), and we still haven't received them. I thought it would take a couple of days after closing at most, but it's looking more like a couple of weeks.", "rating": 2}, {"title": "Question your Rocket Mortgage Bankers background", "text": "The service was great, the banker assigned to my account Taylor Cline was not familiar with my state closing.  I was told I would get checks on the date of closing which I didn’t and names on the deed was discussed over and over which at closing it was not what we were told during the whole process it was only me which really pissed me off especially after other people had signed documents. and I thought about pulling and going to another lender but the rate I got was good so I just felt with it.  If you’re in Texas ask for a Texas banker.  Mine was in Ohio.  Not pleased with that part at ALL!!", "rating": 2}, {"title": "They mailed us checks to pay off our…", "text": "They mailed us checks to pay off our debt…. Which took time…. Which costs money….. then we have to mail those checks to our creditors which takes time… AND more money…. ETFs would be better but didn’t know how to do them if they were available…I would not recommend you at this point because of this issue.", "rating": 2}, {"title": "Communication about how I could have…", "text": "Communication about how I could have not made the payments on everything, like my current house payment and my cards. It wasn’t communicated until after I made all my payments. This was super frustrating as I could have saved more and been more prepared for my next loan.", "rating": 2}, {"title": "I found out after I turned in all kinds…", "text": "I found out after I turned in all kinds of documents like check stubs, w2s, and income tax forms, that they even called my employer 3 times to verify my employment.Like they didn't believe my check stubs and stuff.", "rating": 2}, {"title": "For the money spent on closing costs", "text": "For the money spent on closing costs, credit card payments could have been sent electronically instead of me having to address and mail myself.", "rating": 2}, {"title": "To many chiefs", "text": "Everything was good but for some reason even after being told at least four different times they could not get the individuals identities correct for payoffs. This delayed closing.", "rating": 2}, {"title": "When I was purchasing my home and we…", "text": "When I was purchasing my home and we were dealing with locking in interest rates, I didn’t know that I would be charged for my interest rate. This was unexpected because I was aiming to secure the most current interest rate at that moment. However, when the closing date arrived, I realized they hadn’t informed me about the charge for the interest rate, which took me by surprise. Despite not being informed, I went ahead and signed the papers at that point. When I look back, my only wish is that I hadn’t been charged over 6k for an interest rate that I never intended to purchase.", "rating": 2}, {"title": "Unprofessional experience", "text": "They tell you from the beginning to make sure you stay on top of all the things they ask for so it doesn't prolong your closing date. So that's what did. My lender had stated that the purchase agreement my landlord provided didn't meet MI standards so he was going to put one together for me. 4 days passed and I had not heard anything so I texted and asked how was it going. I received a call stating he forgot but would get on it. My closing date changed 3 times without me knowing about it. Once was because my lender never locked on my rate. None of these times were my fault and I should have been aware of these date changes and same with my landlord as they had to sign off as well.  The process was very unprofessional, especially for a first-time home buyer who is not familiar with the process.", "rating": 2}, {"title": "Was to drawn out", "text": "Was to drawn out, and so our rate hiked up twice", "rating": 2}, {"title": "Guy Levin was great", "text": "Guy Levin was great. All the closing reps were below average. The underwriter was completely incompetent, he repeatedly asked for same info over and over. Bank account was linked, but kept asking for statements.", "rating": 2}, {"title": "Had a hard time with home insurance…", "text": "Had a hard time with home insurance addresses which was a minor problem of lot # verses street address.Now I have pay off checks to an account that was closed 14 years ago and to other companies that say they have no records of accounts with them and no money owed them but I am findig it hard to have new checks issued to me even though I am now paying interest on the money", "rating": 2}, {"title": "Unfortunately I was not impressed with…", "text": "Unfortunately I was not impressed with this company. I was told a certain purchase price at a much higher price than what they actually would approve. This led to quite a bit of waisted time looking for houses I couldn’t even afford. It wasn’t until I put an offer on house that I was told I had to put more money down than I had saved. Then I was told that I needed to pay off more credit cards in closing. We closed on our house and then the title company contacted me that they can’t reach the lender to get the credit card pay off statements. When I reached out to the lender for guidance on how to help the title pay these credit cards off, I got no response. I also got an estimated closing statement with additional points I had to pay for that I never approved. That made me feel like they were trying to sneak that in for more money. We never discussed this additional cost. I am a very trusting person and my trust with this company was being doubted almost immediately after I got an offer approved. It’s very rare I leave bad reviews but I feel like other people should know my experience. If I had time to switch lenders, I would have. I will never use Rocket Mortgage again and I will not recommend them.", "rating": 2}, {"title": "Communication is horrible", "text": "Date of experience: August 18, 2023", "rating": 2}, {"title": "Did not like all the different people…", "text": "Did not like all the different people we dealt with, and after my credit score was ran I continually receive phone calls from lenders and other solicitors, which made me think rocket mortgage sold my information. Not happy with most of the process.", "rating": 2}, {"title": "Our banker seemed inexperienced", "text": "Our banker seemed inexperienced.  She gave us a very rosy picture speediness and efficiency, and it was everything but.  Sometimes, I felt we were doing her job about dealing with title companies, and they even questioned why I was contacting them and not the banker.  Did Rocket Mortgage train her properly?  She got the selling down properly, but not much else after that...  We got through the process and was successful, but we are not fully positive we chose the right mortgage company.", "rating": 2}, {"title": "Night mare on Chaparral second loan", "text": "Every time I send documents on their portal I got a success, but then the processors said they didn’t get them. This is not one or two times, it is like five and six times!  This is absurd and unacceptable! You want us to use the portal, we do so and get a success, but then the processing team says they don’t get it. A waste is my time and yours. I sent and resent multiple documents! The underwriter that had my account was unreasonable and if you asked me, rude! I was doing a second mortgage and to think my first mortgage is ROCKET MORTGAGE, the same mortgage company, and they have all the information right at their fingertips! Your underwriting department cost me half a point because we did not close on time and had to get another close rate. This was the hardest loan to ever obtain, yet also told our credit scores are in the excellent range! I am still upset that ROCKET MORTGAGE employees cost me half a point which should’ve not been my problem. Additionally, no one was willing to talk about any compromising on this problem. I hope someone in ROCKET MORTGAGE looks at all the screw ups and what it took for this mortgage. I reached out to management. I never got a callback or they just didn’t simply care! Nolan who was my senior leader told me all the right things I wanted to hear and I don’t know if he was the problem too, but he was  always in contact with me, so I have to say thank you, however with a big I don’t know? Whenever I needed information I got it right away, never more than 12 hours! And Nolan can verify that! So again, I hope somebody looks at how this loan was a complete and utter pain for me!", "rating": 2}, {"title": "Don't send creditors checks to us", "text": "Don't send creditors checks to us, send them to the creditors.Its easier for us to not have to mess with it.", "rating": 2}, {"title": "I was told my payment would go down and…", "text": "I was told my payment would go down and it didn’t it went up also I regret refinancing now the interest rate went up too.", "rating": 2}, {"title": "Took way to long from start to finish", "text": "Date of experience: August 17, 2023", "rating": 2}, {"title": "Be Sure To Wear Your Boots", "text": "As I have said numerous times. Scott Cardenick is a cut above the refinance depart. Once my loan went to the closing team- My Lord!!!!!! - what a mess. The loan has closed and life moves on. No more reviews please", "rating": 2}, {"title": "Not what we hoped it would be", "text": "This whole house buying experience was horrible. First, Andreas was handling the loan.  He gave us ridiculous numbers for the house and the loan. He didn’t enter the numbers correctly for the house. He  talked so much that we couldn’t even ask questions to understand anything. Then,  Rob Worthy took over.  I would give 5 stars just for him. He helped us out a lot. He was good at explaining things.  I didn’t like having multiple people to deal with during this process. Everyone told us something different.  Everytime we thought were were finished turning in paperwork, there was always something else we needed to turn in. By the time closing came, we weren’t even excited about the house anymore.  We’re thankful it worked out, but wished we had gone with someone else.", "rating": 2}, {"title": "When your mortgage specialist ghosts you.", "text": "When your mortgage specialist ghosts you, via email and phone, I find it extremely difficult to want to continue to do business with them.  If they were truly out of the office why not have your emails forwarded to another team member or at the very least include and I stand reply stating you were out of the office and who to reach in the mean time.  Every time I called, though I left a voicemail, my husband received the call back, not myself.  We both were very unhappy with the lack of communication and the promise that “we can have this closed really quickly” that turned into almost 3 months.  The only really redeeming quality was the ability to close while on vacation.", "rating": 2}, {"title": "I was disappointed in the communication…", "text": "I was disappointed in the communication as the process went on. I found discrepancies in our closing estimate and brought it to their attention. It was brushed over and no one contacted me to discuss. Then, our account showed everything was completed and ready to close and no one contacted us for closing. When I reached out to the original loan officer, the only response I received was to tell me we would schedule closing on the same day our rate lock was set to expire (10 days from the date I was calling.) Only because I personally reached out to the closing agent did the problem get resolved.", "rating": 2}, {"title": "…….…", "text": "…… confused and stressful", "rating": 2}, {"title": "Disappointing", "text": "Started out great! We chose Rocket for our refinance because we used them (or Quicken) for our last two mortgages. Our first contact for a refinance was on top of it. But our house didn’t appraise for enough so we got booted to the home equity loans people. Our first contact there was OK. Then we didn’t hear from him for about two weeks so I called to check the status. I was told he no longer worked for the company. Then I was handed to someone else. Told we needed another appraisal even though we had just had one two weeks prior. Second appraisal came in at $30k more than the first (which ironically would have been enough for the refinance). The closing was a mess with so much lack of communication. It took us almost three months from starting to get our money.", "rating": 2}, {"title": "I was blindsided with a PMI because of…", "text": "I was blindsided with a PMI because of my appraisal value. I ended up putting 18% instead of 20% down but I haven’t been able to put the remaining 2% down to remove the PMI. I would like to do so", "rating": 2}, {"title": "Numbers to closing not accurate", "text": "More honest because on the beginning of the process the numbers like  cash to bring to the closing is too different, and no body told me after do the 500 deposit, i was too farbonthe process to just cancel", "rating": 2}, {"title": "This was the worst experience I’ve had…", "text": "This was the worst experience I’ve had at buying a home you’re people kept asking for the same papers I fell like you expected me to do the foot work we gave you all of my husbands pay stubs except for one so he went and got a letter from his work then you sent his work paper work to fill out that that they did right away and sent it back to you guys but all that wasn’t good enough so then we have to call his employer and ask them to call you guys then you tell me that me the purchaser to contact the seller and get copies of paperwork that was the sellers responsibility so it was all very very frustrating I was never so stressed out through the whole process  calling me to ask me to call my realtor because she wasn’t returning your calls or emails so I call my realtor and she’s like I just talked to them what are they(you guys) talking about or I call my realtor asking where do I have to go to get the title because you guys are telling me I need to get a copy of the title and the survey and send that to you it was a nightmare", "rating": 2}, {"title": "Asked for the rate on a Home Equity…", "text": "Asked for the rate on a Home Equity Loan and instead started an application for a refinance and said it was a better option. Keep in mind I currently have a 3.875% on my loan and the refinance rate was 7.5% which he said was better than the 10-11% home equity loan. There was also a $6000 refi fee and he said I could refi again in 20 months for a lower rate. Brian Ronayne is his name and apparently he has been doing this for 10+ years. Wow, I feel sorry for the people that actually believed that this was a better deal ... terrible service, deceit (or maybe he truly doesn't know anything) and a waste of my time.In response to your response: I would hope you are unable to look up my loan based on the information I gave. However, I do not think there is anything you can do to remedy the situation. I was told by Brian and a customer service rep that this is your company policy to do it this way. So unless you can change company policy, sadly this will continue.", "rating": 2}, {"title": "I do not think we were treated fairly", "text": "I do not think we were treated fairly. The process took longer than it should. Very disappointed with the financial aspect of it as well.", "rating": 2}, {"title": "Was told in the morning that there was…", "text": "Was told in the morning that there was still an inspection pending that hadn't even been scheduled yet.  That afternoon, I find out that Rocket has scheduled closing 2 business days later.  Very little notice or transparency in the process makes a cross country move that is already stressful even worse.", "rating": 2}, {"title": "Multiple issues", "text": "Multiple issues. Not respecting asking not to be texted. Multiple errors in the documents like fixed rate on interest rate, tax escrow, other. Rep at times was reluctant to fix errors.", "rating": 2}, {"title": "Wouldn’t be used as my first option.", "text": "Our First Gentleman we were working with quit 2 weeks in.  That was followed by serious lack in communication, and when we did receive phone calls they were between 6:30 to 10 pm.  We originally chose Rocket Mortgage for lower rates, when all was done it really wasn’t the case. Hurdle after hurdle we finally got it done which is why I am giving 2 stars. It would be hard to recommend rocket mortgage to anyone in the future.", "rating": 2}, {"title": "Rocket Staff were not responsive to the…", "text": "Rocket Staff were not responsive to the level I expect and often times omitted responses to my inquiries. I used Rocket because I am a shareholder and wanted to give my business to an entity I have financial interest in- I cannot help but feel duped in terms of the quality of service and follow-up and am reconsidering my financial position.", "rating": 2}, {"title": "Our broker lied to us about two months without a payment being due.", "text": "Our refinance went through, but our broker told us that we’d have two months without having a payment due, but when it turned out to be one month he gave us a lame excuse about our loan being approved too quickly.", "rating": 2}, {"title": "Sent checks instead of paying bills…", "text": "Sent checks instead of paying bills electronically. Like they’ve done before. Pain in the ass. Thanks", "rating": 2}, {"title": "My banker was great! My experience was awful.", "text": "My banker, Martin Reyis, was the only positive part of this process. It seemed that there were only delays, problems, stalling and \"new requirements\" with every other department involved. It seems as if the goal of anyone other than Mr. Reyis was to impeed any progress toward closing. Also, closing costs were through the roof.", "rating": 2}, {"title": "Promising deals/discounts before…", "text": "Promising deals/discounts before actually getting them approved by higher ups. Not being able to explain points or knowing if they are tax deductible mortgage points. Communication behind the scenes needs work", "rating": 2}, {"title": "I have emailed my agent several time…", "text": "I have emailed my agent several time asking questions about closing. He did not respond. Also I have had to sign 3 different sets of paperwork from Amrock, because they are not sending everything needed. I was told all the money will be available on the 3rd of August it is now the 10th and still nothing. The start process was great, however the closing and finalizing of the loan is completely unprofessional and embarrassing.", "rating": 2}, {"title": "Communication from the original loan…", "text": "Communication from the original loan agent Cedric Addie was awful and he seemed to hold up the process and waste a lot of our time. Would absolutely not recommend, never discussed or even mentioned we had to buy points and simply applied part of our loan toward it. Only stated what our rate was, without disclosing we were actually paying to get the rate lowered. Once we got past him, the company was better at communicating", "rating": 2}, {"title": "We are extremely dissatisfied with the unfair Hybrid", "text": "We are extremely dissatisfied with the Hybrid Appraisal.  That was the worst appraisal we ever had.  We noted approximately ten things about our home and property that were incorrect.  In addition, the comparison of our property to other properties that were not even in our demographic.  I researched and he did have properties in our area to compare our property to.The one positive out of our experience was the patience and professionalism of Tyler.  We thank him for his help.", "rating": 2}, {"title": "The fees that were discussed and agreed…", "text": "The fees that were discussed and agreed upon where never what showed up in the documents. We must have redone the terms of the agreement 15 times and they still were not what was promised. Additionally it took days to get a response on why the numbers didn't match our agreement. It was a incredibly frustrating process", "rating": 2}, {"title": "Review team made things so much more…", "text": "Review team made things so much more stressful than was necessary. Asked for the same documents over and over. Days from closing we were still waiting on acceptance of basic documents. Just amateurish.", "rating": 2}, {"title": "PENALIZED For Things Out Of My C", "text": "Penalized for The banker and everyone was perfect.  It took 46+ days for my loan to close because:1.  I had taxes due on 4680 Delano Rd and other properties.  I was getting the loan to pay off the taxes and put a new roof on one of the properties.2.  Rocket Mortgage and Amrock's computers didn't connect.  Why was I penalized for that?3.  The person servicing my loan was on sick leave.As the result of all these things I am still screwed basically.  I had to make extra payments on my debts that should have been paid off in less than 40+ days.  I provided everything they asked for immediately.  I should not have had to pay for those huge companies internal issues.  Rocket Mortgage and Amrock are  large business I am a poor single black woman but I had to suffer because of situations out of my control.  Extra interest, payoff amounts changed, extra interest/penalties on all taxes, etc.  Everyone should hear/read my story.", "rating": 2}, {"title": "Would never use Rocket again. Unnecessary Agita", "text": "Due to the inefficiency of every person who handled my loan at Rocket, my closing was delayed a day. My problems with Rocket are set forth in a long e mail that I sent to my Loan officer over a week before my close. If you want a copy, please ask for it. Your appraiser misappraised my property, a brand new home and I was required to put down more than I intended. This late report came at a date when it was too late to seek another lender. Your tax team couldn’t get the proper tax amount over a three week period? Very nice people to deal with on the phone. They promise you everything will be fine but they don’t deliver. You’re going to need to do better if you want to continue to disrupt the mortgage industry.Oh, I gave Rocket an additional star because I ended with a good rate. But it was hell to get there", "rating": 2}, {"title": "Clearly I did not learn my lesson the first two times.", "text": "This is my third time dealing with this company. My frustration is that they don’t communicate very well. The person I dealt with today I believe her name is Jasmine she was very short and spoke over me without letting me explain my situation. They initially told me they could not help me with a loan. How ironic that on the day we filled out an application with another institution right after we hit the send button within minutes the story changed and all of a sudden they can help me. Every time I get to this stage there is some shenanigans. I was shopping around for loans at the time this company magically decided they could help me. Now the issue is I need to provide a copy of statements for lenders who have pulled my credit report. Come on Rocket Mortgage!!!!! I’m hoping the people who work in this company is smarter than this. Let’s talk about the employee/ income verification as well. It’s always dramatic.  Just ask me for another pay stub. I can probably give that to you before you get that verification. Also, you have access to my account for verification.  The direct deposit will show up there. Clearly, in this situation third time is not a charm. I’m beating myself up for actually answering the phone. I did not learn my lesson. Silly me.August 25thThis company continued to play games even up to closing. They cleared me to close. However, right before closing they started with the shenanigans again. No one communicating. Tell me again that my income doesn’t match up.  This is after they verified it a million times. Continued to nickel and dime me and just over all unnecessary stress.  Credit score over 720. Original loan is with them where I’m paying more than is required per month. Guess what!!!!! I cancelled the loan. NOT WORTH THE STRESS…. DON’t DO IT PEOPLE. TRY SOMEONE ELSE.", "rating": 2}, {"title": "The process took longer than expected…", "text": "The process took longer than expected based on what was expected. It seems like there was a disconnect in communication. The reps were attentive, but didn't have access to what was happening in real time.", "rating": 2}, {"title": "Had issues the day of funding which…", "text": "Had issues the day of funding which delayed funds for 2 extra days and additional interest charged to me   unacceptable.", "rating": 2}, {"title": "Delay after delay", "text": "The application started off great and we got all of our initial paperwork done in a couple of days.  When we paid for the appraisal everything just stopped.  I waited several weeks and nobody contacted me about the appraisal.  I got in contact with three different people and the story I got was that the VA was holding it up, then the story changed to, we have to get a VA approved appraisal team and finally when I was ready to drop the process my personal contact for the loan investigated and found out someone dropped the ball.It took them two months to find out why the appraisal was stalled and get the loan going forward again.After the appraisal snag was corrected the loan stalled again and the only reason I could get from Rocket was that it was undergoing a final review.  I kept calling back and finally the closing was set.This refinance was a nightmare and if I had known it was going to be this much hassle I would have gone with someone else.  The only bright spot in all of this was the person they assigned to me as my loan consultant.  If it wasn't for Josephine I can imagine me still waiting on a closing date.To be honest, my first mortgage was with Rocket and it went so well I decided to refinance through them so not sure why they were great the first time and terrible on the refinance.The refinance started in May and finished in August.", "rating": 2}, {"title": "Idont know you  would have to think…", "text": "Idont know you  would have to think about how you dealt with the public", "rating": 2}, {"title": "Wasn't Up to Expectations!", "text": "I have re-fi'd thru Rocket Mortgage twice and those previous times, everything from communication, to time to close, etc were spot on.  This time - NOT SO MUCH!I simply wanted to take some cash out of my house... I've got over $600K in equity, so the little bit I needed should have been a breeze and in my opinion done within a week... But it took a month - ridiculous!  Also, it was such a formal process, I had to keep checking to make sure I wasn't buying a new house!  I'll never do this again with this company!  I'm within about 6 years of paying the house off... After that, I'll seek other ways to get loans against the house/equity.", "rating": 2}, {"title": "The interaction with the 1st person I…", "text": "The interaction with the 1st person I dealt with for the start of my 2nd mortgage with ROCKET Mortgage was very difficult and suboptimal in terms of timing, communications. This is my 4th investment in 6 months - 2 with Rocket Mortgage. I enjoy my experience the 1st time with Rocket which is why I chose Rocket this time. Next time I may go back to my original mortgage lender from my 1st two properties.", "rating": 2}, {"title": "Underwriting needs serious improvement", "text": "All individuals we encountered/spoke to on the phone were very nice. Underwriting process was absolutely awful.  They took until 3:30 the day before we were supposed to close to clear us to close. We have owned two other homes and did not experience anything like this.  We were renting and had already given our vacate notice, made all the necessary arrangements for utilities/mail, so on. Underwriting team began sending requests for information that should have been taken care of at the front end of the loan and MAYBE a quick re check at the tail end before closing.  The week of closing, every day was something new, had to get up in the middle of seeing a patient to take a call, my husband had to take off and drive to one of my offices to have the doctor I work with stop in the middle of patients the DAY BEFORE we were supposed to close, to take a call from them. So many things should have been done before the week of.  We couldn’t arrange anyone to help us move, or tell our jobs when we needed to be off due to having to wait until less than 24 hours before we closed to have confirmation we were actually going to be able to close.  It was as if they waited to look at paperwork until week of and then would call to verify something, then clear that and call right back to verify the very next line on the same paper.  Never so frustrated with a mortgage loan.  Again, loved the people, (Charles,Pao, Shabre), and their kind attitude until it got to the underwriting part.  Will not use Rocket Mortgage again for sure.  Way too much additional stress that could have easily been avoided.", "rating": 2}, {"title": "Communication was very unclear from…", "text": "Communication was very unclear from multiple people.  It made things extremely difficult and we ended up $6000 short at closing because of this.", "rating": 2}, {"title": "Rocket team failed me.", "text": "So called experts did not listen, and moved in the wrong direction from the first step. I had to repeatedly explain critical details concerning the estate; to include the legal aspects surrounding it. Lesson learned: Do not use Rocket Mortgage if you are involved with probate estate issues. I used Rocket for a previous purchase and it went very well. This particular team did not perform well at all. Poor communication skills. They did not listen to me or my concerns throughout. My words did not seem to register during several different conversations, and emails. Time was lost, all the while frustration mounted.", "rating": 2}, {"title": "It seems like it took a long time to…", "text": "It seems like it took a long time to get all the needed information to them. Once one thing was done, we received another notice to do another item, why couldn't all the needed information be given to us at on time so we could send it in at one time. Also why numerous people to work on the loan and them not being informed when they asked about something and it was already submitted to you.", "rating": 2}, {"title": "Not transparent throughout the process", "text": "Not transparent throughout the process. Disorganized.", "rating": 2}, {"title": "The first few weeks seemed like a…", "text": "The first few weeks seemed like a waste. People not following up with my paper, people not remembering my wife’s name and calling us other names, a staff me ever went on vacation during the week we were supposed to close so we had to postpone. Anyways, lots of things here and there who let us thinking we could have been better off with a different company. This is the second time we do this with you all. The first one it went flawless, but this time not so much.", "rating": 2}, {"title": "Took way to long got passed up the line…", "text": "Took way to long got passed up the line to way too many. Finally with someone who had 20 years experience. Misleading info prior to closing. Not a pleasant experience", "rating": 2}, {"title": "Lack of communication", "text": "Lack of communication on what we needed to do and when. Rocket kept asking for specific things and when we provided them, they realized they asked for the wrong thing. This happened twice during the process, therfore the closing was delayed because of their errors. Ultimately we refinanced and got what we were hoping for but it was a frustrating process because of the lack of communication on Rockets end", "rating": 2}, {"title": "Maybe a 3 rating is reasonable....but.", "text": "Maybe a 3 rating is reasonable.. Each person seems very nice and all are good sales people, but as soon as you're passed on you're an after thought. The service seems great at first but is very fake if you stand back and look at everything going on. Almost robotic. You served a purpose, I have my house, but likely will not refinance or purchase again with you. I've received an unknown number of emails regarding the success of my purchase except from the person I spoke with the most. He was your best salesman. However, I now realize how he created a great deal of stress and anxiety with changing markets that I feel now accelerated some of my decisions. At one point I even delayed my closing to shop around, but decided it simply wasn't worth the hassle and was a bit worried that waiting would cost a ton more out of pocket. And that simply is why I'll likely be a one time customer and won't be an advocate for you.", "rating": 2}, {"title": "Not happy!", "text": "They can accept the word of a customer when they show actual proof they paid in full a creditor. They can accept that tge last 4 of that customer's credit card may differ from the credit reporting agency for security reasons.", "rating": 2}, {"title": "Unnecessarily frustrating experience...", "text": "The back and forth regarding additional paperwork was ridiculous. A complete list should have been provided at the beginning. Every day there was another request for documentation. It went on for weeks . In addition, there was a lot information that wasn't provided until after the fact. For example, you make the selection on your payment preference after you go to closing. We wanted to pay biweekly. After I selected that and submitted everything, I found out they would hold the first payment until the second one was made. The only benefit to paying biweekly is that you make 2 extra payments a year. I could have done that on my own.", "rating": 2}, {"title": "A lot of little scams, screwed up escrow", "text": "There were a lot of little scams built into the mortgage, places where things like outside fees were inflated.  You don't see them unless you know where to look and how to check up on them (and you bother), and anyway I'm sure their attitude is, \"Who's going to gripe about four or five hundred dollars here and there on a $500,000 deal?\"  My agent was a sweet-talking shark.  After complaining (and threatening to notify the Attorney General) I got the fees refunded.Also, a couple years in they screwed up our escrow so our payments jumped 60% overnight.  Not cool.", "rating": 2}, {"title": "Not the best start", "text": "It started like other encounters with ROCKET. Then things got messy.  Over and over again new info was needed to move forward.  Then the calls started coming in on mine and my wife phone from lending company’s. Over 200 calls came in just over a few days.  Once David was off the case Nick moved things along nicely.  Also David tried to sell me on a 7.25% interest rate at the beginning and when I told him at that rate I would stay with what I had he came back with a better rate.  Thought I was buying a used car.", "rating": 2}, {"title": "Lots of last minute changes the week of…", "text": "Lots of last minute changes the week of closing.", "rating": 2}, {"title": "HE Loan is somewhat misleading from advertised", "text": "They advertise (new to them) Home Equity Loans available up to 90%LTV, with credit scores over 660. I see FB posts EVERY day. I applied (joint) and was told they need both of our credit scores over 180 (mine was 174). They have a team that helps with that, so I got it up to 182. They then said we were approved for $50,000, pending UW review. Unfortunately, they ran a hard check again dropping my score to 176,(even though legally they should only run this ONCE in a 3month period) & they said they couldn't approve that. I paid a credit card down and my score went to 185. Then they came back and said that they couldn't do the $50,000 because it was too risky for them (they have our first Mortgage, a 30yr at 3%) Appraised at $500k and the first at $392K, is about 78%; adding a $50k note is about 88%LTV. (still under the advertised 90%). Then they said that if we have them Pay Down our first by $18k (they roll it into 1 loan at $42k), they could then make it work and give us $24k cash.  Essentially they traded $18k at 3% for 11.5%, saving Rocket money! The whole transaction would put us at 83%LTV. There was 1 other pre-approved, then denied transaction in between these other 2. Rocket (Amrock, their title Co. affiliate) ran our credit score 3 times within 2 weeks, dropping my score each time. The whole process was stressful and took too long. Although it appears probably cheaper than a personal loan we keep getting offers from some of our existing banking relationships (like Bank of America) at 6% for a HE Line (not even a full paid loan). Rocket was great last year when we refinanced at 2.99%, but this latest scheme (HE Loan) is horrible.", "rating": 2}]