[{"title": "Trip Delay Refund", "text": "I called to ask about why members of the group received $500 more than I did in reimbursement.  I was directed to call EF Tours, which I did.  EF tours recommended I cal back to seven corners with neither being able to give me an answer.", "rating": 2}, {"title": "Read the fine print!", "text": "We bought coverage believing that we were covered for ANY reason, but the fine print said our trip needed to be interrupted to receive reimbursement. We had a tropical storm disrupt our last day which caused the ferry back to mainland to be shut down, airport was shut down and I missed a speaking engagement! We were paid for extra hotel stay but not for work. Read the fine print before purchasing! ", "rating": 2}, {"title": "Policy terms not clear- missed connection", "text": "Terms of policy not clearly spelled out.  Turns out that the \"missed connection\" benefit only applies to the start of your trip and not your return segments.  On your return there is only a \"trip delay\" benefit.  This scant reimbursement of $150/person is supposed to cover hotel, transport and meals.  Doesn't seem worth the paperwork and headache.", "rating": 2}, {"title": "Why is my claim taking so long…", "text": "Why is my claim taking so long ($6,900). All needed material has been sent--Drs. letters---credit card payments---cruise co cancel info--travel co. letter of payment and cancel--ETCEach time same notice --info sent for review---It seems I always have been sent to the rear of the linr.I will be needing ins. for 2 future cruises--(I've been on 33 and only had to cancel 2 cruises that required Travel ins. intervention.I'm having second thoughts about Seven Corners!!Let me know why I should continue to use your Co.First contact to Seven Corners about claim  7/19/23", "rating": 2}, {"title": "Still waiting after 5 months", "text": "We paid over $6000 for a policy to cover 4 of us. My husband got sick and died before our planned trip date. I have been waiting over 5 months to be reimbursed for this trip. I don’t understand why it has to take so long. I cannot recommend this company due to this ridiculous lack of customer service.Update 3/16/23- I got your proposed settlement- for 65% of the amount I am legitimately owed.  Unacceptable!", "rating": 2}, {"title": "Disappointed with Seven Corners COVID Coverage", "text": "While working with Seven Corners was very easy, I was extremely disappointed when I actually needed coverage.  I tested positive for COVID on a Friday evening in Israel.  In order to cover me, they needed a physician's clinical note.  While I understand this, I needed a new room that night, so that my roommate wasn't further exposed.  In Israel, most things are closed Friday night to Saturday night so getting the note would have been very difficult.  Had I been able to get the note, they would still have only covered $100 of the $400 cost of a room at such short notice.  This was NEVER made clear when I signed up.  Of course a hotel room would cost more than $100.", "rating": 2}, {"title": "I needed to speak with someone on a…", "text": "I needed to speak with someone on a weekend and no one was available.  My luggage was damaged on the flight, but didn’t notice it until unpacking at the hotel.  Tried to call on a Saturday, but was informed by answering that no one would be there til Monday.  Our tour started on Sunday so I was unable to place the return call.  Had to purchase new luggage at my own cost to get home.", "rating": 2}, {"title": "Payment", "text": "I filed a claim towards the end of July, they told me it would be reviewed in 30 days, which it was. I got the confirmation email that it was review and it listed everything I was being paid for and told me that the delivery of my payment would take UP TO 10 business days, which you’d think that it would come maybe a little early or at least on the 10th day but it still has not. I could just be overreacting because it’s the 10th business day but it’s 10pm and obviously won’t be delivered. In my opinion, 10 business days is plenty of time to ship a check, it should be here by now.", "rating": 2}, {"title": "Poor customer service", "text": "Representative never returned phone calls or responded to emails after the initial cancellation period was over.  It was a relatively large policy - trip cost per person was over US$50K.   I contacted Customer Service directly and have to be transferred a few times to get the right support.   I will never insured with this company again.", "rating": 2}, {"title": "I wrote a stellar review as purchasing…", "text": "I wrote a stellar review as purchasing the insurancewas a very positive experience.  Now I havea claim and it's totally opposite.   Difficult to getagents on the phone.  When you do they continueto stall and delay.", "rating": 2}, {"title": "It took way too long to finalize claim…", "text": "It took way too long to finalize claim and I had to send in appeal for full amount that is still pending.  4 months is too long once the claim is filed.  Also the travel company doesn't tell you that you have to file direct to you within 90 days to even get reimbursed.  It really takes diligence to get claim processed.", "rating": 2}, {"title": "Due to COVID", "text": "Due to COVID, we could not travel on our trip and notified Seven Corners of same, requesting a way to either receive a refund or to extend coverage. No response was received.", "rating": 2}, {"title": "Claim processing very slow", "text": "I filed this claim 717844, i understand(from support) it takes over 2-3 months to fulfill it, very dissatisfying. If it takes couple secs to take the payment..why a claim cannot me addressed in 3-4 weeks time.", "rating": 2}, {"title": "Travel insurance feels like a waste of…", "text": "Travel insurance feels like a waste of money.  It is expensive, the goal is not to need it and if you do its more time consuming and frustrating to redeem then just eat the money..", "rating": 2}, {"title": "Claim submitted 11/2022 no update yet", "text": "Currently I am waiting on an actual update/ response to my claim submitted late November 2022. All I have received was anEmail saying my claim was received and I would get an update every 3 weeks. Unfortunately I had to cancel my trip to South Africa for my 35th birthday because my grandmother was taken to the ER one week prior, where we learned her cancer had spread and worsened, she was then referred to hospice care. As her primary caretaker and power of attorney it was recommended by her medical provider to not travel so far away for so long. I really don’t want to have to worry about my claim and this process as I am currentlyUnder a tremendous amount stress. I invested so much money and time into my birthday trip but my grandmother is more important. I’ve submitted her ER visit summary, her CT Scan, a letter from Hospice and everything else requested. It would be very helpful if I could get anActual update and this princess be expedited. It’s ridiculous that this process takes this long. I was skeptical about this company at first and probably should have went with another company if I knew it would take this long. I will wait a little longer before I contact the BBB.", "rating": 2}, {"title": "A Salutory Saga", "text": "Our return flights from Cairo to the US were cancelled by the airline due to a strike at Munich Airport, so we purchased alternative flights home and submitted a claim for the additional cost, which was modest after net refunds for the cancelled flights.The initial claim was denied \" as the interruption was not triggered due to the strike being a planned event \" Since the strike was NOT planned when we started the trip, let alone when we bought the policy, we appealed this decision.The appeal was also denied, but now for a different reason -  \" a strike must result in cessation of travel services for at least 48 hours of the carrier \". While the strike itself in Munich airport was 24 hours, the earliest flight option offered by the airline was 48 hours later !I did not expect Seven Corners to resort to differing and illogical explanations to avoid reimbursing a reasonable claim.", "rating": 2}, {"title": "Hard to process claims", "text": "Too much info required to submit a small baggage damage claim.  Makes me feel like I have to jump through hoops to get you to pay a very small claim.  This feels like a delay tactic to get me to go away.  ", "rating": 2}, {"title": "I have previously sent many complaints…", "text": "I have previously sent many complaints and comments about improvements needed on claim turnaround time being inordinately excessive and that alone needs to be improved. I understand you have hired additional staff, to speed up turnaround time but that was the issue. In addition, your decision regarding our  claim for multiple baggage damage was denied , which refused reimbursement for our matching baggage request,  is not in line with standard insurance line of sight practices  and is currently awaiting appeal to Seven Corners. This practice has caused us additional stress to have to appeal  an issue that should have been reimbursed initially and immediately and may lead to future litigation and Federal, State and Local Agency involvement with Seven Corners.Gerald Aquino847-956-8036", "rating": 2}, {"title": "No call back", "text": "Called to inquire about a possible claim, got told on hold that I could receive a callback. Chose this option, but never was called back.", "rating": 2}, {"title": "Trip cancellation", "text": "Mom passed and had to cancel trip this was in August I contacted them to ask if their was any additional documents needed for my claim and I was told no , and I was to wait because claims take a minimum of 90 days to review this is pretty extreme 😑 i'm just glad i didn't have a emergency while on vacation out of the country and had to contact them to file a claim i would of been on my own to solve any problem", "rating": 2}, {"title": "Taking too long to review the Claim. Still unreviewed", "text": "Its been more than 60’days and my claim is still not reviewed. I expect timely response and claim reviews.", "rating": 2}, {"title": "WXyz", "text": "Tried and tried to get answers to questions about how to expand geographic area of travel and also about how to submit claim after a street accident and injury. No one responded. Quick efficient subscription and payment system but bad client responsiveness.", "rating": 2}, {"title": "Could not find any hospital accept the…", "text": "Could not find any hospital accept the insurance in Lexington KY", "rating": 2}, {"title": "Almost 3 months and still waiting for my claim to be processed", "text": "I'm still waiting for an update on my claim. They told me after 2 months that they are behind and it'll take 80-100 days for them to get to mine. They also say they'll email me an update every 3 weeks but haven't. They had the best policy I could find for my trip, but now I'm disappointed because there's several thousand dollars at stake - and I'm still waiting.", "rating": 2}, {"title": "Need better communication", "text": "I bought insurance for a trip to Central America.  However, a couple of days before I was to leave, I found out that due to heavy rain, roads were closed and there were mudslides.  I was able to cancel flights and accommodation so I didn't lose any money.  I tried to cancel the policy or find out if I could get credit for a future trip.  I called, was told to send an email which I did.  But I did not hear back.  The two stars reflects the poor communication as I never actually needed the policy.", "rating": 2}, {"title": "The worst claim department", "text": "The worst claim department. They do everything possible to delay or not pay your claim.  They loose documents and make you submit them again. Although the front end purchase experience of the insurance was very good, I would not reccomend this company due to their horrible claim department.  I have been waiting to have a claim under 500.00 paid since early May.", "rating": 2}, {"title": "Typical insurance company", "text": "Typical insurance company. They charge you for a trip and when you ask for specifics, they can't give a straight answer. I didn't have to use the insurance but when I had questions, customer service was vague and unresponsive", "rating": 2}, {"title": "It’s been months since my claim and I…", "text": "It’s been months since my claim and I have gotten road block after road in processing. I call and have m been able to speak to several  people about my claim but never my actual claim rep. They keep requesting same information that is already attached to original claim  like I was instructed.They can’t seem to connect claims and read notes well enough from their own reps to get it processed.Very frustrating", "rating": 2}, {"title": "Run away, this is a scam", "text": "I am still not convinced this isn't a scam, everything takes so long to process, and nobody ever has any answers. Their hope I believe, is to move so slowly and request the same information in different ways you just decide to quit. If you have nothing else to do, buying this insurance will work for you.", "rating": 2}, {"title": "I called specifically to find out what…", "text": "I called specifically to find out what funds I'd receive if I cancelled my trip.Due to travel concerns and warnings by the US travel to Italy travel should be postponed. (COVID, Heightened Terrorist Activity) IF I cancelled my trip I inquired as to how much of my financial layout would be recouped. The gentlemen could not tell me. He said I would have to cancel the trip THEN file a claim to see what moneys I would receive.", "rating": 2}, {"title": "Poor customer service", "text": "When I called to purchase insurance the response time was excellent but when I called with questions I couldn't reach a live person and it took too long to receive call backs. No one even came on your chat line and I was holding to chat with someone for over an hour. Thank God we did not have a problem while traveling because I was concerned about your customer service given your inability to answer the phone or chats or to return calls on a timely basis.", "rating": 2}, {"title": "Be prepared for reimbursement delay", "text": "They seemed very helpful when I called for help with my delay...but forgot to mention that it will be MONTHS for the claim to be reviewed! The advice to \"put all charges on a credit card and file the claim when you get back\" is not helpful when the claim will take 115 days to review!", "rating": 2}, {"title": "After having the service for 2 years I…", "text": "After having the service for 2 years I had an incident where I needed to go to an emergency care Center in NY.  I handed them my paperwork from seven corners and rushed into the back for treatment.  3 months later I started receiving emails requiring I supply my primary travel insurance paperwork.  As a Canadian I did not have any ‘primary’ coverage.  It took multiple emails to convince seven corners that there wasn’t any other insurance.  Finally the emails stopped.  So frustrating", "rating": 2}, {"title": "Unresponsive", "text": "I tried calling and sat through multiple promo offers and was then hung up on. I was given another number from one of the prompts in that message, that number had no options that met what I needed. I chatted twice and was told they're expediting my case both times, never got a call back. I also emailed, no response to that either.", "rating": 2}, {"title": "I filed the claims and still waiting…", "text": "I filed the claims and still waiting for status over 2months, and still waiting.  That’s was the only negative things.  My agent was very good and knowledgeable about the products when I asked.", "rating": 2}, {"title": "Radio Silence", "text": "It has been nearly 3 months since we submitted a claim and over 6 weeks since submitting additional documents requested and we have received no update. i have inquired multiple times without response.", "rating": 2}, {"title": "When I decided to take out insurance on…", "text": "When I decided to take out insurance on my trip it was to be insured in case of any reason I could cancel the trip. It was not clear to me that it was optional. I thought it said optional cancel for any reason included. Before my trip I looked at my insurance again and realized I didn’t have that insurance snd it was too late to add it. Please make these terms more clear during the sign up.", "rating": 2}, {"title": "Abandoned and disappointed.", "text": "I'm currently experiencing difficulty due to trip interruption. I've called in, I've utilized the chat feature, etc. I've asked for my policy to be extended beyond my original travel date and was told this was possible, but then received notification the policy was ended anyway. I was told I could file a claim, but I won't have the supporting documentation to do so until my travels come to an end and I return home. I'm frustrated and disappointed.", "rating": 2}, {"title": "What is actually claimable?!", "text": "I bought this policy because I wanted “Cancel for any Reason” which, thankfully, I did not have to use. They were very helpful and responsive when I was purchasing (multiple) policies. But when we arrived at our destination and the minivan we had reserved was not available and renting one from another agency was going to cost $220/day, I was told that Rental Cars are not a valid trip interruption. Also, when the kitchen island in our Airbnb fell over and damaged one of our cell phones, I was told that cell phones are excluded from personal effects. How would I have known that there is a specific exclusion for cell phones?! Both of these seem like legitimate claims to me. Seems like travel insurance isn’t worth the cost.", "rating": 2}, {"title": "Victim of a smooth-talking saleswoman...?", "text": "Due to COVID I made the decision to insure a trip to Austria.  I explicitly talked about wanting insurance in the event the trip was canceled.The trip WAS canceled yet my insurance failed to cover my loss.  I feel like a victim of a smooth-talking saleswoman.", "rating": 2}, {"title": "OK, until you have a claim...", "text": "You buy insurance hoping never to have to use it. That's what your insurer hopes, as well. I purchased 'cancel for any reason' insurance for an upcoming trip and as luck would have it, I had to cancel my trip. I filed a claim a month ago and got a confirmation a week later that they had received it. Since then nothing. When I called customer no-service, I was told that it can take 91 days for them to respond. This must be the legal limit, although they couldn't tell me what the legal limit was. I am going to file a complaint with the BBB since other people are having the same struggles with this company. I won't use them again.", "rating": 2}, {"title": "48 days seems unreasonably long.", "text": "My return flight on my trip was delayed and I missed a connection to my final destination after 24 hours of travel. Due to the delay, I had to purchase a later flight to my final destination and had a 7 hour layover in the airport. I filed a claim and am now told that it will take 48 days!  from the date it was filed to get any action. It did not take me 48 days to pay for my travel insurance.  My finances would be eased if I could get my reimbursement for the claim in a timely manner. 48 days seems unreasonably long.", "rating": 2}, {"title": "Very satisfied in the past, but disappointed this time!", "text": "I've used SC for numerous mission trips in the past and been well satisfied. However, this was a personal trip and being over 70, coverage is limited. I had some questions. Could not \"connect\" with anyone other than the answering service who first recommend I search online at the website, which I had already done without success. You had to declare your inquiry and \"emergency\" to get a phone call returned. Even then, I did not receive the return call until after I had departed USA for Europe--with my questions unanswered.", "rating": 2}, {"title": "Unsure if I will see my refund", "text": "***update- They did respond promptly and my claim has now been accepted, so I will change my review to 5 stars for responsiveness. I made a claim a month ago as we had to cancel our plans due to US tourists not being allowed to travel in Europe. I have not heard anything about the status of my claim.  We had “cancel for any reason” insurance but so far it’s been crickets.", "rating": 2}, {"title": "Easy to take out a policy; Not easy to cancel", "text": "The ease with which I was able to able to take out a medical policy for a planned vacation was fantastic.  However after taking out the policy, I became aware that the resort where i was vacationing also offered coverage.  I therefore attempted to cancel the Seven Corners coverage but was only able to reach the answering service.  My requests for return calls were futile.  On the last call the service operator assured me that i could expect a return call within the next 24-48 hours confirming that the policy was cancelled.  The call never came and the charge appears on my Amex statement.  Never again!!", "rating": 2}, {"title": "Cheap, and you get what you pay for", "text": "Although very cheap, not cheap enough to justify such a poor customer experience navigating their website, mobile website, and app. Nothing is ever easy. Plans are not associated with your name until YOU link them. Logging in is a multi-email process. Always. Why it even takes one email blows my mind. Claim updates are nowhere to be found. Truley impressive. Recommend looking elsewhere.", "rating": 2}, {"title": "More needs to be done to make things easier for Customers", "text": "Website is not very intuitive if you want to check the account information, claim information.I had to talk to customer service for my Dads claim, they need a verbal agreement for every conversation or written authorization from my Dad to do that. At every stage sounds like more paperwork and more things to do from the customers end. I was not very satisfied.", "rating": 2}, {"title": "Poor claim processes and assistance", "text": "Filed a claim over 3 months ago and reviewed request for additional information but no mention of what additional needed.  Submitted additional info and now 6 weeks later just the sound of crickets.", "rating": 2}, {"title": "Failure to Notify of Claim Outcome", "text": "I submitted a claim for a physical, vaccinations and lab tests on 14th November 2020.  I received an email on 18th November saying my claim was being reviewed and that someone would be in touch if they needed further information.  No communication on this matter was received until I called on 30 December 2020 to try and find out where the payment/claim was and was notified that it was denied on 18th November but no email or explanation had been sent.  Disappointing outcome but more disappointing claim process and communications.", "rating": 2}, {"title": "Got me into trouble", "text": "Easy to contact, promise response every time, never respond once there is a claim. I understand if they cannot issue my benefit, but I only got the \"news\" that my claim is denied one month later when I have to call again and asking for it. It's a huge frustration to work with and got me in trouble with the medical collection agency to pay more than I should.", "rating": 2}, {"title": "Never needed it but didn’t receive help when I asked.", "text": "Never needed it but I emailed them several times about not being able to login on the app And I received no help. or answers as to why I couldn’t login they just asked for information on my phone. Very frustrating not getting answers. Even if I had gotten a it’s a bug we are working on i would have appreciated it.", "rating": 2}, {"title": "Zero Help", "text": "The one time I called to ask for assistance, the customer service agent had no idea what my coverage entailed. I was basically told to seek medical help and then submit the receipt - without even knowing if it would be covered!I will go with another provider next time.", "rating": 2}, {"title": "We submitted a receipt for medical …", "text": "We submitted a receipt for medical expenses incurred.  We tried very hard to communicate with Seven Corners & the urgent care center to receive the reimbursement due us.  Seven Corners kept sending us generic & useless e-mails instead of resolving the claim.  We are out the amount & have given up on ever seeing it.  We were really surprised as they have always been excellent with customer service in the past,  Very disappointing.", "rating": 2}, {"title": "Into month 4 and claim not even in review", "text": "Update now past the max 89 days needed and its not even in review.  It is still in received. Filed cancel for any reason with all supporting documents uploaded and even numbered with detail. Filed claim in early July its now October and its not even in review.   I was told customer advocate would contact me. After several attempts i did finally got someone. I asked about delay and said due to covid they are at least 100 days to review claim due to airline and covid We are in year 3 with covid at this point as the cdc says time to live with it and this is what its going to. After 3 years its time to be staffed appropriately.  Airline issue was months ago. I understand but there will always be something in the travel industry hurricanes etc and should have staff to handle ebb and flow. Chat says agents unavailable over and over after going through their very long chatbox. Very frustrating. I will say when you finally reach somome they are polite and nice no issues there.Its just its time to be staffed accordingly.", "rating": 2}, {"title": "I do not recommend!", "text": "When I needed them, it was almost impossible to contact them by phone or email.I only received a response hours later by email.Because of that, I do not recommend this company.If I had had a serious problem, I would be dead if I had to rely on this company.", "rating": 2}, {"title": "We used 7 Corners for the first time…", "text": "We used 7 Corners for the first time for a trip to Europe. We paid approximately $800 for a policy that included medical transport and insurance for 3 people. This was approximately two weeks prior to the COVID pandemic. When we went to cancel, we were denied a refund; only allowed to apply our policy to a future trip. We were able to take another trip this past November that only included 2 people. We also traveled to the Bahamas for 4 days vs a 7 day European vacation. I feel that we should have been refunded our initial payment since we cancelled during a global pandemic and prior to our vacation. I was able to use my policy for my subsequent trip but I don't think that I will use Seven Corners again.", "rating": 2}, {"title": "Claim process a nightmare", "text": "Every time I've had to make a claim, it is months of waiting for any notification and countless emails trying to get someone to address the claim. Half the time they hadn't even begun to process the claim, and the other half they try to convince you it's not covered. I've checked, every time I've submitted a claim I've checked, and double checked that it's covered. I don't really see the point in having a reimbursement process or even getting this travel insurance, if when you need to use it they just ignore you. Very disappointed with my experience with them over the past two years.", "rating": 2}, {"title": "very disappointed with this insurance", "text": "very disappointed with this insurance. It was a waste of money. It was frustrating to make the claim, they asked me for a number of documents simply to hinder me and in the end have excuses to deny me the claim.", "rating": 2}, {"title": "Getting help with a claim is difficult.", "text": "Getting help with a claim is difficult. I have been waiting for 3 weeks trying to get them to even initialize the refund I need. Great service as long as you don’t need it!", "rating": 2}, {"title": "Couldn't extend my coverage", "text": "I was very happy to have your coverage after reviewing your ratings. You are listed as one of the top ten in an article of Forbes that make me pay for your coverage.We extended our trip for a week and I got two e-mails from you with notice of coverage end and an invitation to extend the coverage if needed.I tried twice to extend the coverage and it was impossible. I had no option but continue for a week on my own.Your link does not refer to a page to an extension of coverage but to contract a new one. I do not know if your system, reading a US IP address refused to proceed the extra week of coverage desired.That is the reason of my 2 starts rating. On the other side, happily of not having any issue during the trip, so no basis to rate another aspects of Seven Corners.", "rating": 2}, {"title": "I have NOT received good response or …", "text": "I have NOT received good response or help from 7 Corners. First, I could not receive a call back from the first person that I talked to at seven corners. I understand she was out sick but no one else took her calls and got back to me. It caused me to miss the 20 day period for pre-existing condition. I will contest that! In addition I emailed to get some help in downloading and printing the insurance paperwork. Your website is terrible.  I kept getting error messages. I emailed to try and get some help and received a response that someone would get to me in three days. It has now been one week and still no response. I wish I had gone with a different insurance company.", "rating": 2}, {"title": "Hard to contact from abroad", "text": "Hard to contact from abroad. No answer or number busy. Failure to assist or provide advice is poor service. Simply emailing claim form is not enough.", "rating": 2}, {"title": "The agent not helpful", "text": "The agent whom I chat with was not really responsible and not willing to help me. The response was late and when I asked several questions, they have stopped answer my questions at the end and ignore my questions.", "rating": 2}, {"title": "Insurance company refusing to pay for…", "text": "Insurance company refusing to pay for tests ordered by physician in a visit covered by insurance.", "rating": 2}, {"title": "Review of seven corners", "text": "After opening account I received an email from Seven Corners saying: We are writing to let you know that if you renew your plan on or after April 18, 2017, the changes shown below will apply to your plan beginning April 18, 2017:The daily rate you are paying for your plan may increase.It felt like pressure to renew for another contract after just purchasing one. Maybe this is for all policies but the email was vague. I'm also wary of all the pre certifying required and the fees for not precertifying. Am I supposed to pre certify the ambulance even in an emergency? I don't think global nomads works like this...I get the sense that this is cheaper but they get you with the fees for not precertifying.", "rating": 2}, {"title": "Good prices, not good customer service.", "text": "I emailed Seven Corners with a few simple questions, and a week later I still have not gotten a reply. I ended up purchasing 2 plans, because I have a pre-existing condition and it seems to only be covered if you purchase it within 20 days of the trip deposit (but I am not even sure because no one answered my email). Now, I am trying to add the 2 plans to the my account, and they will not sync to my account.I bought the plans because Seven Corners covers pre-existing conditions and also has an additional car insurance option (which I would like to know more about and am still waiting to hear about). I needed these 2 options, and Seven Corners offered them at a great price. I wish the website and customer service was better.", "rating": 2}, {"title": "Good luck receiving your reimbursements", "text": "I was all set to write a glowing review of Seven Corners as the review process of our claim seemed to be progressing smoothly and efficiently.  However, until it came time to actully receive our approved reimbursement payments.  The first payment arrived 16 days following date check was issued, 2nd payment was received promptly; 5 days following date of issue and we are still waiting for the 3rd payment in excess of $1300; 21 days and counting from the date check was issued.  Excuses given by Seven Corners were \"the check is in the mail; or the check is lost in the mail\".  Call me a skeptic, but I've never had problems receiving my mail in the past so this doesn't seem like a coincidence.  Maybe they were hoping we forgot we had another payment due.", "rating": 2}, {"title": "Getting them to pay is like pulling teeth", "text": "I am quite unsatisfied with Seven Corners. I had to receive emergency medical assistance while traveling abroad. Because of my injury, the doctor said I needed to change my flight. I spoke with Seven Corners contact, forwarded all of the hospital records to them, and the medical team at SC approved of the claim. They told me I would be reimbursed for the change that I paid for out of pocket. Now, it's 5 months later, and I have submitted my forms 3 times and they still haven't paid me. I call them every month and they apologize and say the payment will be processed within a week, but it never goes through. I am looking into other insurance companies for my next trip. Two stars because at least the people I speak with seem helpful and polite.", "rating": 2}, {"title": "Well not the experience that we were…", "text": "Well not the experience that we were hoping with a travel insurance company for a Premium Insurance policy. We purchased the cancel for any reason policy due to the uncertainty of COVID. We filed on claim on April 5th and finally got approved for payment on June 25th. It took a while longer for the funds to hit our bank account. It appears that they are very unorganized as we were asked multiple times to submit the same supporting documents for our claim. They tried to communicate the lack of response by sending emails saying it could take an additional 30 days. A courtesy phone call was nice but they didn’t have any answers as to a timeline to processing our claim. Disappointed with the lack of organization and overall experience. We will not be purchasing travel insurance with this company again.", "rating": 2}, {"title": "I filed a claim on 2/23/22 on your…", "text": "I filed a claim on 2/23/22 on your website, but have had no response.Policy number 1RTB21-AOS-109835.  Hoping for resolution.  Thanks,Matthew King", "rating": 2}, {"title": "Extension creates new policy.", "text": "When i tried to extend my policy, it just created new policy instead of extending my old policy.  Hence I had to cancel the new policy  as i needed extension but not new policy.", "rating": 2}, {"title": "Impossible to find a clinic with direct…", "text": "Impossible to find a clinic with direct billing in Buenos Aires.  Let's see if I get the reimbursement from Seven Corners now....", "rating": 2}, {"title": "Unresponsive", "text": "Three emails asking a basic question resulted in no response from Seven Corners.  One was generic to the email address on the website and the other two were to a specific contact person.", "rating": 2}, {"title": "Is hard to get in touch with an agent…", "text": "Is hard to get in touch with an agent here in USA I no want to imagine how well be from a foreign country; thanks that we wasn’t need", "rating": 2}, {"title": "Very limited coverage", "text": "This insurance company has extremely rare contact with you in any way (email, phone, mail...) after you purchase its insurance product.  This insurance has rarely limited coverage.", "rating": 2}, {"title": "Good policy, horrible claims servce", "text": "While I believe the coverage is good, the claims process is so awful I would hesitate to recommend Seven Corners. I turned in what I expected to be a very cut and dry claim and many items of documentation, but several weeks later I received an email asking for more information. Every time I follow up I am told to give them \"21 days to respond.\" To both my claim, then the email I received. And then...?? So, each time you do anything, they get 3 weeks to ask for more info or to follow up. I am still unsure what the final disposition will be, though I expect to be paid given the policy I purchased and the claim I have. Admittedly, I'm nervous to write this review, though requested, as I fear this will cause another hold up or issue and that I will be pushed back yet another 3 weeks.", "rating": 2}, {"title": "Tried to contact customer service", "text": "Tried to contact customer service by phone. Tried multiple times over several days without getting through. I even tried the emergency number  but couldn’t at that either", "rating": 2}, {"title": "I left a phone message when my trip was…", "text": "I left a phone message when my trip was cancelled.  Never heard anything.  I did try to communicate online but at that time there was no option for the service I needed", "rating": 2}, {"title": "They found every excuse not to pay any…", "text": "They found every excuse not to pay any part of our cancelation.  I would not use them again or recommend them as they find the loop holes to not provide coverage.", "rating": 2}, {"title": "90 Days behind on claims", "text": "My trip was delayed and I filed a claim. I called to follow up and was told that Seven Corners is 90 days behind on claims processing.", "rating": 2}, {"title": "Customer help was good", "text": "Customer help was good. I was upset that the email was not sent to the correct address. It took me hours to find my policy a month later. Any way to fix this?", "rating": 2}, {"title": "I cannot find anywhere on their site to…", "text": "I cannot find anywhere on their site to see my policy. They have me in the system. I tried calling but busy. I’m going to try calling first thing in morning.Bought this insurance in the past and it was great. We were able to file a claim easily but now??Afraid with virus they are overwhelmed.Want to find out if we cancel our trip because of the virus and me with all the check offs of medical conditions. It is now considered a pandemic by WHO. My definition of natural disaster theirs we will see.I have raised my star to two because of live chat. Unfortunately, when I was transferred to an administrator our connection was broken off and I was not re connected. No one tried to contact me. I was sent finally a PDF of the policy I have and definitions. There is a paragraph on pg 18 about travel advisories regarding contagious diseases which I brought to their attention but have not gotten a response. Not holding my breath.", "rating": 2}, {"title": "Misunderstanding", "text": "I agreed to purchase a one month travel policy at the price quoted. However, what was charged to my account was more than $50 higher than what was quoted.", "rating": 2}, {"title": "It very difficult to have anyone answer…", "text": "It very difficult to have anyone answer the phone to provide direction as well as advice.", "rating": 2}, {"title": "No pandemic coverage.", "text": "You need to include coverage for a pandemic.  People have no choice in the case of a pandemic but to cancel their plans and you offer no help.", "rating": 2}, {"title": "Cancel for any reason- NOPE!", "text": "Vacillated between giving 2/3 stars. We had 2 trips planned & purchased “cancel for any reason” ins. for both. 1 trip everything was refunded from the airline & hotel anyway because of Covid. The 2nd trip was Disneyland. We went 1 day & decided not to stay the rest of our trip as Disney was shifting down 2 days later & we were getting nervous with all Covid shutdowns. 7 corners would not cover our cancelled Disney days or hotel “for any reason”. Disney did offer to let us use 1 day later after they open but we knew we can’t make it back within the time frame they gave. We’re out the money. Their communication is good though & they are easy to get in touch with. Just don’t bother with “cancel for any reason”. They won’t honor it.UPDATE: received response from 7 corners- Per the policy- “cancel for any reason” is only if you cancel 48hrs before or pretty much death/injury. Bummer we don’t get $ back, but communication still good.", "rating": 2}, {"title": "Trip cancellation?", "text": "I submitted a trip cancellation form a week ago, received an automated email confirming that the cancellation was received and nothing further.", "rating": 2}, {"title": "I did not receive a confirmation…", "text": "I did not receive a confirmation E-mail.  Otherwise, everything went smoothly and if I had received the E-mail. I would have given 5 stars.", "rating": 2}, {"title": "Insurance not accepted", "text": "This insurance was not accepted by any physician or pharmacy. I had to pay the entire bill out of pocket. I wonder what's the point.", "rating": 2}, {"title": "the custormer hotline is hard to reach…", "text": "the custormer hotline is hard to reach from places outside the country. They should set up online chat on the website for easy acess.", "rating": 2}, {"title": "unnecessary amount of money I pay for…", "text": "unnecessary amount of money I pay for something that insures if deceased my body will be fully insured to be flown back to USA", "rating": 2}, {"title": "Not very good/helpful", "text": "Such a care insurance provider for international tourists holds so rare responsibility that it does not mail you one single letter.", "rating": 2}, {"title": "Hard to use", "text": "Hard to use. Should have asked for all docs up front. Claims process sucks! Still working on claim from the fall.", "rating": 2}, {"title": "Lots of uncertainty. Coverage not as applicable as thought.", "text": "Customer support seemed unsure when interpreting the language of my insurance. Not covered as much as previously thought.", "rating": 2}, {"title": "Still waiting on a refund from…", "text": "Still waiting on a refund from cancelled insurance policy.  Received a bit of a run around regarding the cancellation.", "rating": 2}, {"title": "Have not received an answer about new…", "text": "Have not received an answer about new date change for our trip . Sent email 2 days ago. Very disappointed.", "rating": 2}, {"title": "Claims are pending for months", "text": "Claims are pending for months, although the documents are asked and supplied as required still there is no respond.", "rating": 2}, {"title": "Well first the mumbers given", "text": "Well first the mumbers given , there is no answerWhen you get on chat .... there seems to in edequate or no response", "rating": 2}, {"title": "\"My ACCOUNT\" NOT WORKIN SO ALMOST CANCEL POLICY", "text": "Bought new policy and within an hour could not log onto \"My Account\" on 7Corner website so I can start reading Policy. Called 1-866 number, after long wait, \"Mike\", customer assistance rep told me to open website and use Software Chat box for help. Obviously Mike was cherry picking. Fine, use Chat Box in 7 corner website and Rep in chat box did not want to help. He typed up to call 1-866 number and talk to Customer assistance rep. Another cherry picker. Told my self everybody is passing the buck and I can not open \"My Account to view my Policy or see receipt proof of just bought insurance or print ID Wallet cards. Something is shady so I decided to cancel my Travel Policy. Called 1-866 and talk to \"Angie\" customer assistance rep and informed her of issues with \"My Account\" on website so want to cancel my Travel Policy. But Angie so sweet and funny, calmed me down and fixed \"My Account\" on seven corners Webstie. I did Not Cancel. To Test: I Logged on and Logged Off \"My Account\" several times within 24 hours and had not issues.", "rating": 2}, {"title": "I had an awful experience using seven…", "text": "I had an awful experience using seven corners. I had their insurance while traveling in Thailand, I got dengue and was very sick. I had to stay in the hospital for 5 days. When I checked into the hospital I called my insurance to verify they would cover the hospital I was staying at, and the guy told me the total was over 1000$ I wouldn't have to pay anything out of pocket as they would send a letter to agree to pay when I was discharged. However, when I was discharged this did not happen.... 2 weeks later still hadn't sent anything. They have awful customer service because most of the people I actually managed to speak with were rude. Never responded to any of the 10 emails I sent. I ended up having to pay the hospital over 3000$ to get my passport back from the hospital as they hold it to have promise of payment.. 2 months later they finally paid the hospital and luckily the hospital refunded me. Overall I am thankful I ended up getting my money because but the amount of time I spent stressing over this was awful because I could never get in contact with anyone who could ever give me more information. I wouldn't recommend using this company.", "rating": 2}, {"title": "insurance without any need I paid most…", "text": "insurance without any need I paid most of my doctor's visits and expenses", "rating": 2}, {"title": "Non-functional phone app", "text": "After contacting the company by phone twice, with extended waiting to talk to a person, the app still didn't work on my Android phone.  The first time they insisted that I send them a screen shot of the 404 - site not found error message and said that their IT people would get back in touch with me with a solution.  After two weeks without hearing from them and having my departure approaching, I called again and was told a fix would be in my email inbox soon.  I received an email quickly enough, but the bottom line was that I could access the app on my desktop, but not my phone - not too practical for travel insurance.If they can't make it work, they need to quit saying they have an app and admit they are troglodytes.  I ended up taking a paper copy of the information that I would have accessed on my phone, but I wasted a fair amount of time trying to make their \"app\" work.I didn't have a claim, so I have no idea how they respond to claims, but if it is anything like they respond to requests to make their app work, you could be in trouble.  Forbes rated them highly, so I am guessing people who have claims receive much better service than people who want to use their supposed app.", "rating": 2}, {"title": "Discount card did not work", "text": "Discount card did not work, I don't want to imagine a medical problem. I have been a loyal customer.", "rating": 2}, {"title": "Poor customer service and slow claim…", "text": "Poor customer service and slow claim response time, disappointed. onlz upside is that its cheap", "rating": 2}, {"title": "Difficult to make first call to know…", "text": "Difficult to make first call to know providers and information. Phone  Numbers always occupied.", "rating": 2}, {"title": "Stay away from Seven Corners", "text": "Stay away from Seven Corners! I purchased the Roundtrip Choice (AOS) plan from Seven Corners almost nine months ago for my trip from the US to the UK and France. My travel from the UK to France was derailed when France closed its borders to all tourists coming from the UK because of Covid. I bought a ticket back home to the US, and then sent all the receipts and information to Seven Corners, including screenshots of the news headlines about the border closing and all tourist travel being suspended. Nine months later, I still have not received any reimbursement from Seven Corners - the opposite - they closed my case instead! At first they sent automated e-mails just asking for the same documents over and over, and I kept re-sending them. No one could tell me what - if anything - was missing, only that I should keep re-sending the documents. And then finally they just closed my case. No one responds to my email follow-ups. When I call them, no customer representatives can provide me with any information - I've spoken to different representatives each time, and each one of them said they don't know the people reviewing my case, and there is no way to escalate or contact them. In the end, Seven Corners has wasted my time and money, has provided no helpful information, no reimbursement, and no way to escalate. It was an enormous waste of money and feels like fraud. I imagine Seven Corners will do the same to you as well - I would stay far away from them.Update: Seven Corners finally responded right after I posted this review. They are reimbursing me for my smaller claim, which I greatly appreciate (I'm now changing my rating from 1 star to 2 stars), but my larger claim is still closed and I have not heard any update about it.", "rating": 2}, {"title": "cheap insurance, no customer support", "text": "good and cheap insurance, bu terrible customer service (emails and calls repeatedly ignored)", "rating": 2}, {"title": "Hard to file claims", "text": "Hard to file claims. My coverage was denied after 180 days.", "rating": 2}, {"title": "Not well-organized", "text": "Not well-organized. Long time... I have not heard the decision on my claim yet!", "rating": 2}, {"title": "Avoid Seven Corners medical policy unless you like wasting money and taking risks with your loved one's health", "text": "Seven Corners is really slick at taking your money for a policy - people are friendly and knowledgeable, web site is informative and the buying experience is fast and easy. But paying out on a claim is a different story - every claim has been refused on the excuse that more information is required from the doctor. Call the doctor, they say they have sent the information. Call Seven Corners again - they claim they received nothing from the doctor, please ask them to send again. Then next excuse is that Seven Corners cannot speak to me (the purchaser of the policy), they can only speak to the patient because of HIPAA rules. By now, patient has been back in home country for 4 months. Explain that I am only trying to resolve the claim/billing issues, not talk about the treatment or anything that might infringe patient's privacy. Response: I shouldn't even be speaking to you because of HIPAA... so just going round and round in ever decreasing circles. Totally frustrating, a waste of money, and more importantly, the policy purchaser is living a dream thinking that he/she is protected from the risk of a large medical bill because they purchased a medical insurance policy. The reality is you are going to pay a lot of money for the policy and still be stuck with paying all the medical bills if the insured falls ill. A huge financial risk, which I thought would be mitigated by taking out the policy.", "rating": 2}, {"title": "Very long wait to get answers and seem…", "text": "Very long wait to get answers and seem like lots of hoops to jump through.", "rating": 2}, {"title": "Slow response time", "text": "Filed a claim 2 weeks ago and haven’t heard a word", "rating": 2}, {"title": "I called them for question of …", "text": "I called them for question of insurance, no on replied until one week later.", "rating": 2}, {"title": "Took advantage of COVId 18 pandemic to…", "text": "Took advantage of COVID-19 pandemic to hyper inflate cost", "rating": 2}, {"title": "Messy", "text": "I usually don't write reviews, but I think insurance is so important that I want to help others find the best plan. I am from northern Europe and did my bachelor's in the U.S. I had the Liason Student Economy plan. During my studies, I had to visit a doctor and do different tests many times. They covered about half of all the procedures. For example, since I visited a doctor and a specialist regarding pain in my bladder and testicles, they didn't cover the visits by appealing to their exclusions of std's and other venereal diseases, even though I didn't have any (all the std tests were negative). I didn't want to use time and money to start fighting with them, especially since I was afraid that they wouldn't cover even the other expenses as \"revenge\". Also, you will need to ask for a pre-certification two days before certain procedures, which will delay your care. They also charged me a 100-dollar \"deductible\" on my prescriptions, even though the plan says that deductible doesn't apply to prescriptions – therefore breaking their own rules. They never changed this even though they promised to revisit the claim after I called them. On the other hand, the customer service was rather good and they almost always responded quickly – except one time when they told me that they'd call me back the next day regarding a bill but they never did. In conclusion, they are an \"ok\" provider but do expect them to use every possible way to not pay your claim, and sometimes not pay even though they should, and do read their long exclusions list before purchasing.", "rating": 2}, {"title": "Doesn't include flu shots", "text": "Doesn't include flu shots, or vaccines. Appoinments", "rating": 2}, {"title": "not an understanding company", "text": "The process of making a claim wasn't to difficult.  But when it comes to claims review they are a very black and white company that does not or will not account for shades gray. I signed up for a class trip for my daughter in February of 2020 and my wife was lined up to be returning to work in March, however COVID-19 broke out and my kids could not return to school forcing my wife to have to stay home as well.  we tried to wait it out and continued to make payments but when we no longer could and were forced to take away my daughters trip because of bills.  we filled a claim and explained everything but were told to bad this doesn't meet their criteria of hardship. you would think that during a pandemic there would be some understanding/compassion for hard times during a unique situation but i guess not from this company.Update:I received an email response to my negative review that told me \"Your claim was processed by analysts who are trained to interpret policy language, and simply disagreeing with our decision is not sufficient to change the denial\" but i can try to appeal if i want. I read all of the policy documents and denial letter and it is all black and white, got it.  The denial said i didn't meet policy outlines  for cancellation.  obviously since no one knew this pandemic was coming.  But if you paid attention to my complaint its that COVID-19 is an unusual circumstance that required a unique perspective not just simply quoting a policy that doesn't even cover this circumstance.  Looks like i will get no where with this and need to just cut my loses and move on.", "rating": 2}, {"title": "Love the insurance", "text": "Love the insurance, website usability needs a bit of work.", "rating": 2}, {"title": "I got different info from each rep that…", "text": "I got different info from each rep that I spoke with.", "rating": 2}, {"title": "I didn’t receive my money till now .For…", "text": "I didn’t receive my money till now .For the claim.", "rating": 2}, {"title": "We called you but you never answered…", "text": "We called you but you never answered the phone", "rating": 2}, {"title": "We should be reimbursed fir the covid…", "text": "We should be reimbursed fir the covid tear", "rating": 2}, {"title": "I received no response to recent …", "text": "I received no response to recent communicatin.", "rating": 2}, {"title": "It's very easy and effoedable polacy …", "text": "It's very easy and effoedable polacy ....", "rating": 2}, {"title": "I'm not able to make changes easily", "text": "Date of experience: July 09, 2018", "rating": 2}, {"title": "No response", "text": "Sent an email to agent. No one replied.", "rating": 2}, {"title": "The service is not so good.", "text": "Date of experience: July 14, 2021", "rating": 2}, {"title": "Not as easy to claim", "text": "not an easy info to apply online", "rating": 2}, {"title": "It’s nice", "text": "It’s nice I like this service", "rating": 2}, {"title": "pretty bad travel insurance", "text": "Date of experience: August 02, 2019", "rating": 2}, {"title": "Basic level coverage does NOT guarantee \"100% coverage\"", "text": "Back in Dec 2019, a friend and I purchased their “Basic” insurance for a travel package to Europe. Seven Corners seemingly offered a great value for what we paid: “100% coverage” regarding several travel-related issues, as well as for any non-refundable costs and cancellations made by our travel agency.Then COVID came along and suddenly, they weren’t so “100% coverage”. In fact, they put great effort into NOT taking any responsibility regarding COVID, based upon the completely hands-off nature they handled the situation in: just look at their webpage entirely devoted to COVID-related travel issues outlining what they’re NOT responsible for! Obviously, no one knew COVID was going to happen back in 2019, but they acted as if they wrote it specifically into their stipulations from the beginning, and it’s likely in reference to some vague, jargon-filled clause that nobody knew about (certainly, we didn’t), used as an all-encompassing means to not cover any non-refundable costs and penalties due to situations like COVID. Honestly, what this COVID situation did to disrupt our travel plans was stressful enough to deal with; having their “coverage” not help out with any COVID-related cancellations and fees (due to a travel ban, mind you) only resulted in false hope, which was actually worse than not having any coverage at all. In that case, at least you save yourself some money. To have “coverage” felt misleading, in other words. And communicating with their support staff didn’t leave us with any great sense of comfort either—their “industry-speak” conversations via email or phone always left us feeling like Seven Corners will make sure they have the last word—and dollar.The reason why we didn’t give them “1 star” however, is because at the very least they’re letting us transfer the travel insurance over to our rescheduled trip (which was an issue in itself—what is it with these travel agencies and not giving refunds?). We’re not sure WHAT they’ll be covering however, although if it involves “accidental dismemberment”, then we’re golden. Given the quality of service experienced, we wouldn’t be surprised if there's some hidden stipulation preventing anything—including any loss of appendages, from being covered—and in that case, we hope we’ll never find out!Overall, a poor experience. The plan purchased turned out “too good to be true”, and even though we thankfully didn’t lose an “arm and a leg”, it’s a lesson we learned the hard way. We will likely be finding another trip insurance provider for future trips once this pending trip is all said and done.", "rating": 2}, {"title": "REVIEW", "text": "The plan is of no use.", "rating": 2}, {"title": "Too expensive", "text": "Date of experience: January 27, 2022", "rating": 2}]