[{"title": "Great reasonable price for good…", "text": "Great reasonable price for good products.", "rating": 2}, {"title": "Well I have not received my nugget ice…", "text": "Well I have not received my nugget ice machine no way of tracking it. It says it is still processing. I understand I placed the order on Saturday. But it Should have processed and shipped By now. My payment was processed quickly", "rating": 2}, {"title": "Need to impropve on customer service", "text": "The Customer service was not that great. I talked to the sales guy over the phone before actually visiting the place. When the sales representative came, he looked confused when I told him that we talked over the phone.", "rating": 2}, {"title": "Need an invoice for shipper tried call", "text": "Need an invoice for shipper tried call Larry no answer left messages as well, goods are still at the mailboat, kindly email invoices please to t let me know results2426011396", "rating": 2}, {"title": "Wrong size rack delivered", "text": "Even though the wrong rack arrived the team at ACityDiscount quickly ordered the correct one, arranged to have the first rack picked up and everything was handled correctly.", "rating": 2}, {"title": "Read the Terms and Conditions", "text": "CS wanted my credit information a second time, after receiving it via website.  Claimed trying to verify my identity.  Tried to cancel order, since this was not in the terms and conditions and I am very protective of my credit rating.  CS was going to charge me for cancellation, even though their terms and conditions of sale did not require a second credit authorization.  After extensive back-and-forth, CS manager finally sent machine, but with caveat:  I had to personally inspect merchandise prior to signing for receipt, or I would be liable for any damage.  I don't know if they would do business with me again, even though this transaction ended up being proper, legal, and not fraudulent.  I could not do business with them again, at least via their website, because I am not sure they believe that I am who I say I am (in other words, they believed my sale to be a fraudulent transaction).", "rating": 2}, {"title": "Am new here so am just see what going…", "text": "Am new here so am just see what going to happen", "rating": 2}, {"title": "Annoyed & Frustrated", "text": "I was not very happy with my experience. All the items were great, with the exception of one thing. If you are considering ordering a commercial hood here, don't! The sales staff do not have the required knowledge to help in markets across the country. I am in MN and my salesman sold me a hood that is illegal here. I would suggest using a local company, as they know the local codes, even if it costs a little more. The consumer should not be required to read all codes and know them. If there is a so called sales specialist, it should be their job to know the requirements.\r My other annoyance has to do with payment. If you are custom ordering something or getting custom pricing, then this is not the place for you. My salesman would email estimates, I would confirm the desire to order, then wouldn't hear anything! I guess it is my job to track down the salesman to buy something? Last I checked, when someone wants to give you money, you should be seeking them out. I felt like I was working to place my order, not acting as the consumer. Everything that is custom has to be ordered by phone, so this is where my issue was. I guess the entire process was just far too difficult. To really put the icing on the cake, my salesman would very rarely call me, or return a call. If I didn't call him, then nothing would happen. Even then, nothing happened. I would ask questions, but never get any actual feedback. Just frustrated I guess! \r Stick to the standard stuff and you'll be just fine! Also, know what you are ordering, because the sales staff doesn't!", "rating": 2}]