[{"title": "awesome approval process..", "text": "awesome approval process... one glitch with notary.... verify code they sent had one extra digit.... had to call to correct.. no problems here... money arrived fast...dashboard issues... no payoff amortization calculator if i want to make additional payments ... no way to set up automated biweekly payments... my other mortgage has that simple feature.... smh... your IT guy can easily add a way better pull down menu with biweekly choice.... that choice allows me to pay off early.... need text alerts too.,, date due etc...... overall great cutting edge service.... seems like they want you with no automated biweekly or additional payments choice etc to maximize their bottom line....... now i have to remember to pay every other week... come on guys/gals... or is dashboard a third party canned software that you have no update control over...i am happy customer... you revolutionized the industry...", "rating": 2}, {"title": "I am not able to log onto the website…", "text": "I am not able to log onto the website to pay my bill. I am forced to call and have them initiate the payment. ", "rating": 2}, {"title": "Closing attorney process horrible", "text": "The closing attorney process was atrocious.  Besides being late with no call, I phoned her to be told she was running behind and wanted me to change the time and location when I was already sitting at my credit union for execution.  So I had to return home and then meet her at the UPS store where she said they would witness. Once there was informed no. Then had to return to my credit union (another 5 mile trip) to get the document witnessed.  She even wanted me to change the date. None of this was my doing as I was in the agreed upon place 15 minutes prior to time   Furthermore she had an attitude like it was my fault.  In my opinion she should never be used again. I wouldn’t recommend this service to anyone if it involves her. I have done this before with absolutely no issues.  So please address the problem - her!  ", "rating": 2}, {"title": "An associate sent an email to my wife and never informed me!", "text": "An associate sent an email to my wife who hardly ever looks at her email on a Saturday when time was of the essence since I was trying to beat a deadline so I could get a $6,000 discount from my contractor and the associate never CC me so I did not know the form was in her email. I could have told her had he told me. It wasted three days until someone at Figure called me 3 days later on Tuesday that the form was sent. Because of this I missed my deadline and I will probably lose the discount! A Figure associate had told me that the associate should have CC me. Now, an associate is telling me they don't do that. Someone is lying!", "rating": 2}, {"title": "I was not given the full breakdown of…", "text": "I was not given the full breakdown of how the payments was going to be. It’s like having another mortgage which very little goes to your principal very month. I did a really big mistake taking out this. It’s better to get a personal loan if you need the cash to fix anything or to consolídate your debt. So very careful getting a loan like this you will end up paying triple for what you ask. Don’t do it find other ways. I’m telling you for experience.", "rating": 2}, {"title": "Stupid policy", "text": "So I applied and apparently I put Tim instead of Timothy which is my legal name. Good customer service would be changing the name from Tim to Timothy on the application or allowing me to do that myself. But no. This company has to cancel the application and I have to start all over and risk running my credit which I don't want to do again. So I canceled the application and will be likely going to a competitor at some point. It is a ridiculous policy and is extremely poor customer service in my opinion.", "rating": 2}, {"title": "Meh.", "text": "I sent in insurance paperwork they requested. They charged me anyway for additional insurance. I finally got it straightened out. Next month rolls around, I see that they're going to pull out the additional amount again. I reach out AGAIN to get this resolved. Nope. Bye bye money.", "rating": 2}, {"title": "Too much information on consumers to keep safe", "text": "I was ask to show proof of account ownership because I was using a different account to make my on time payment to Figure. I won't do that. I have more than one account in which to make my payments. I feel companies have to much information on consumers to keep safe", "rating": 2}, {"title": "Not a good first/last impression", "text": "This company uses a third party to verify your home address and value before you can even apply for a loan. Because of this, this is the first company I have dealt with that could not verify my address. I volunteered that I am exempt from public records and they used that as why they could not verify. That would mean that any first responders would not be able to borrow if that was true. Then, after telling me they could not help me due to not finding my address, they send me an email stating I was ready to continue with my application and it showed the address and value. The representative told me he didn’t not feel comfortable providing his last name, yet he was supposed to be a supervisor, and they expect you to provide your personal identity information. I am glad I didn’t go with this company. The customer service seemed sketchy, and the follow through was lacking.", "rating": 2}, {"title": "Easy application, but where’s our funding?", "text": "The application was mostly easy. There were a couple of hang ups that no on emailed or contacted us about,  so I had to chat with someone to find out what the issue was. Was no one going to let us know? Got done with the notary signing and states loan has been funded, however here we are 8 days later and we do not have the funds in our account- where is it?", "rating": 2}, {"title": "Flood Insurance scam!", "text": "I was told i had 30 days in a written letter to get flood insurance. I got and sent them within 3 weeks my flood insurance. The day after my flood policy started they sent me a $3,000+ bill for the three months I didn't have flood insurance. So basically I had to pay for past flood insurance at 3X my current rate. My new flood policy is $800 for a year not $3000 for the past 3 months.", "rating": 2}, {"title": "Not very helpful with the hazardous…", "text": "Not very helpful with the hazardous insurance of my equity loan . Called in many times but never got the problem solving after 3 weeks.", "rating": 2}, {"title": "Mis/poor communication", "text": "Getting the HELOC was a breeze but they transferred the money to my bank and then charged me $340.70 as a payment when they were suppose to keep the money until I finalized the Contractor's for, my remodel.  I emailed when they charged me the $340.70 and that was two weeks ago and i have yet to hear from them.", "rating": 2}, {"title": "I would never recommend Figure to…", "text": "I would never recommend Figure to anyoneThe website is buggy. I keep clicking things that don't work or throw errors. I should not need to go to Chat for help with using a web site.I am also VERY UNHAPPY with the rate and the process. We took out a HELOC at 7.16%. Unlike HELOCs from other institutions, all of the money is deposited to your account when the loan is funded. We weren't ready to use it yet, so we \"put it back\" for a month and a half to avoid paying interest on money we weren't using. That was a BIG mistake. Two months later, the interest rate has gone up 1.5%.I'm sure this is buried in the documentation but Yowza. Most loans lock in a rate when you get the loan. So, our plan to save a few hundred dollars turned into a loss of a few thousand. NOT GOOD.We needed a loan and we got one. There were fewer hoops to jump through than with our bank. Those make Figure worth two stars.But we will never use them again and wouldn't recommend them to anyone.", "rating": 2}, {"title": "Predatory interest rates", "text": "Predatory interest rates. Automated system is not user friendly.  Sliw turn around time.", "rating": 2}, {"title": "I asked them to stop direct payments…", "text": "I asked them to stop direct payments from my checking account! They said ok and. Took the 901 out anyway! So today I will be closing that account!", "rating": 2}, {"title": "Loan paid off 2 years ago still had lien on it!", "text": "We had a loan with them 2 years ago which was paid off in a year. I called and found out that the lien is still on it two years later! I contacted Figure and spoke with Hailey/CSR and she told me a lien request has not been completed and she will send me a form. Never received it. We contacted Figure again a week later and spoke with Quinta/CSR. I asked her why it had a lien hold on it almost 2 years after it was paid off. Quinta said they sent me an email, requesting to close the lien in 2021,but when I asked them to forward a copy to me, because I never received it (Quinta/CSR) told me to check my emails from Aug, to Oct.2021. I did - nothing with a lien request. Why else would a request a copy, since I never received it. This was Sept. 19, 2023.I received the lien request form finally and paid off the $95 .00 on Sept.21st. I called today and nothing had been done Melissa/CSR told me She said it would get expedited today.  I contacted the Federal Trade Commision and they said it was Figure's responsibility to follow through and close it out. Since they can not send me any proof they requested to close it. So, here we are again. I will call them every week to see if they are following through. I will be submitting a form to the Federal Trade Commission, BBB and Consumer Financial Protection Bureau to make sure this get expedited correctly. Folk due your due diligence. After checking their reviews on Google this seems to be 37 complaints lodged against them with the Consumer Financial Protection Bureau .I'm disappointed, because my experience has been good with them, but to find out a lien for a loan that was paid off was still on there was shocking. Every time I call, I get the run around. Robert J. Lopez", "rating": 2}, {"title": "The Math Was Not “Mathing”", "text": "Figure Loans helped me when I needed it. At the time, it was next to impossible to find a bank that offered HELOCs on an investment property. However, their fees are high. They make you draw all the money off the loan when you first get funded and I paid about 3% on the funds up front. I paid back what I didn’t need right away to lower my monthly payment. But when I got ready to draw additional funds, that is when things got confusing. First off,  It was different interest rates depending on when I drew. So part of my loan was at 11% and another part was at 12%. I received different statement amounts due for the month. Then my minimum payment due went up by 30%! I ran all the numbers and it still didn’t make sense. Even with all the money drawn, at the max interest rate, amortized over 30 years, I should have been paying no more than approx $535/month.  But they were charging approx $850/month on a $50,000 loan amortized over 30 years at a max interest rate of 12%. When I asked about this, They came back with something about me drawing more money off the line on a certain day. So they had to re-amortize my loan. Had I not contacted them, I still would have been paying 30% more. That math was not “mathing”. Why was I paying $300 more per month? Why was I getting different statements with different amounts due for the same month? I finally refinanced with a credit union. There were no upfront fees, I didn’t have to draw all the money off the line, the rate was fixed and lower (for an investment property), and my minimum payment due is 1% of the loan, no matter what day of the month I take a draw. Oh, and I had to wait to be approved to draw off a line I had already been approved for. If your choices are limited, this may be the way to go.  But if you have options, go somewhere else.", "rating": 2}, {"title": "Figure advertises 3% APR and then…", "text": "Figure advertises 3% APR and then offers you 8% APR after you fill out the form. Their rates are extremely high. Also, they say it is a HELOC, but it's not a line of credit. It is a home equity loan, with a set withdrawal amount that needs to be take all at once. Deceptive advertising.", "rating": 2}, {"title": "Rates suck compared to other HELOC providers", "text": "Don't understand all of the great reviews. I'm speaking with several HELOC lenders. I have a 770+ score and really good DTI. However, Figure's proposed APR was double the rate of Quorum FCU or Lower.com - both that I had been approved for the week prior. There is no way I will pay double the APR just because I will be funded in less than a week. I'd rather wait a couple of weeks and pay thousands and thousands less. I cannot recommend this companies rates as they are not competitive with other's that specialize in HELOCs.", "rating": 2}, {"title": "NOT HAPPY-TAKEN ADVANTAGE OF....", "text": "NOT HAPPY, FEEL TAKEN ADVANTAGE OF......Was able to get the loan very quickly, which was nice but we sold our home 7 months after and they charged us over $3100.00 in interest and fees for borrowing the money from Jan - July.  Rip off.....shouldn't be allowed for these organizations to do this to people.  Dishonest.  Would never recommend them to anyone.", "rating": 2}, {"title": "It would really be good if they built bank confirmation into the initial process...", "text": "It would really be good if they built bank confirmation into the initial screening process. I only found out by reading negative reviews that this was sometimes a problem after people authorized a hard credit pull, only to find out that their system would not work with their bank. Good thing I checked first because they told me that my credit union was not one of their partners. Be sure to confirm before applying if you are with a credit union or small bank.The up front experience with their website is awesome, but doesn't do any good if they can't work with your bank.", "rating": 2}, {"title": "Have to fill some cracks in their system.", "text": "Paperwork, appraisal, and the approval process were quick and smooth.  Actually getting funding was a problem.  It took an inordinate amount of my effort (phone calls and chat sessions) to get Figure to tell their bank to transfer the funds.  The associates I spoke to were largely ignorant of the details of the ACH transfer process, repeatedly gave me incorrect information, and resulted in delayed funding.", "rating": 2}, {"title": "Loan process was easy", "text": "Loan process was easy, but website has problems, difficulty setting up auto pay and can't pay my first payment. Costumer service is no help, I get the run around. 5 attempts at re-adding my bank account with no success.", "rating": 2}, {"title": "We were denied based on their appraisal…", "text": "We were denied based on their appraisal system, but we have a new appraisal that's been done within 90 days showing value from our mortgage refi. Our home is custom and semi-rural, but it does have comps. A 25% difference between your automated valuation and an actual appraisal dine by a professional is a significant difference. We have made significant improvements on the house since that appraisal was completed as well. We just want a Home Equity LOC in place to make more home improvements. Credit score is great and debt to income is also great.", "rating": 2}, {"title": "Sent $100,000.00 more than I needed…", "text": "Sent $100,000.00 more than I needed when I paid $90,000.00 back would not change payback payments so paying back in 3 years instead of 10. Refinancing with different lender as Figure wanted points to refi.", "rating": 2}, {"title": "Not a Pleasant Experience", "text": "It started out nice, but things went south when I was approached by another lender with a better offer.  I gave the better offer to them to see if they would match it.  they waited 3 days to tell me \"No\".  The guy then told me that the terms were so similar that I should not care that they refused.  I do not consider over $2,800 from my pocket to be \"similar\" at all. By that time they finally got back to me I missed out on the rate from the other bank.  Also, it did not seem like their loan specialist was actually reading my emails.  I would email details and answers to questions and then have to answer the same questions over the phone.  I actually asked her \"do you actually read my emails or skim over them and call?\"Overall, they were nice people but lacked in the service department.  I ended up going with a different bank because of the interactions.Lastly, they stuck me with a \"cancellation\" fee for canceling my appraisal.", "rating": 2}, {"title": "Beware of hidden extra fees", "text": "Pretty happy at first with how quickly the loan was approved.  Finished my home project in six months and immediately called for a pay off quote.  Was told they needed it in writing.  So I sent the request in writing and was told 24/48 hours for a response.   Four days later still nothing.   Second request sent and finally 24 hours after that msg a  payoff amount was sent.  Three months after the loan is paid in full with their additional taxed on interest for the delayed pay off, I get a 9pm phone call .  Now they are telling me that to close the account,  there’s yet another fee.   Now I would need to pay a closing fee with my county?   Never heard of anything quite like that.   Seems like they are going to get their money by making up fees.  Definitely not happy10/14/2019 Update:  After expressing my unhappiness with the extra fees, a representative from Figure contacted me and refunded them.", "rating": 2}, {"title": "This process has been ridiculous!", "text": "This process has been ridiculous!! If I hadn’t told the other company’s that I was going with you, I wouldn’t have finished this process. I tried to write the CEO from the web site, and just like everything else it didn’t work. Your “team” as they called it, was never on the same page. I was told one thing by one person, then another by a supervisor. I was called back by someone different to tell me what the supervisor said was wrong and that I needed to start the process over. Then called back and told no it will work, only to be called back the next day and told that I needed to start over. After talking to about 6 different people I just started over. Once I started over I made it to the video call, of course it wasn’t done correctly and I had to call back and do it over because whoever did it didn’t do it right. Had to talk to some condescending ass named Lane. I don’t want or expect response to this review! You need my money and I need yours. That’s all this is.", "rating": 2}, {"title": "The process was not exactly as it was…", "text": "The process was not exactly as it was explained or described.  Funding took much longer than anticipated.  Many obstacles......", "rating": 2}, {"title": "I recently closed on a cashout… Word of caution", "text": "I recently closed on a cashout refinance with Figure. The loan officer I worked with was great and tried to keep me informed throughout the process. I would caution anyone considering Figure to be careful. I was told that Figure refinances faster than a bank and was repeatedly told this. My experience is that this is not the case. The blockchain automated process that is supposed to speed up the process has many bugs that seemed to cause multiple problems and delays. Also, it seems like the closing department is horribly understaffed.  It would take 6-8 days for them to review one item for me. I was supposed to close on a Thursday but received a call at 9:00 pm, the night before the 10:00 am closing, from my loan officer telling me that Figure was going to have to delay my closing due to a payoff statement expiring. I later received an email after 10:00 pm that same night saying that my closing was back on. The next morning the closing attorney was 45 minutes late because she received the paperwork the morning of the closing. If you are looking for a quick and efficient refinance process that is stress-free this is not your company.This company outsources almost every aspect of the refinance to other companies. This allows for many opportunities for delays and problems. These 3rd party companies seem to cause additional delays.If you decide to use this company stay on top of them and make sure things are moving in the right direction.", "rating": 2}, {"title": "No way to account for crypto assets.", "text": "I got screwed out of 15,000 because I counted my staked crypto earnings as part of my income and there was no way to verify that. I sent “feedback to the CEO” that read - “You claim to be powered by Blockchain, but your company doesn’t allow crypto currencies to count as assets when verifying income for a loan. Seems like a conflict of ideals. I was approved for a $40,000 loan based on an income of 106k. Then I’m asked to verify income. Attaching my checking auto verified 98k. The rest of my income comes from blockchain staking where I have ~ $100k worth, depending on market. You can attach stock assets through standard banks, but there’s no way of claiming income through crypto assets? To a bank “powered by blockchain”? Moreover, instead of my approved loan of 40k falling proportionately, say down to $36000, my loan falls all the way to $25k. It feels like I’m being punished disproportionately just for thinking as future-mindedly as this company pretends to be. I get that crypto is volatile, but it should count for SOMETHING.”I got a curt form letter back saying “Figure provides applicants numerous options for income verification and allows multiple sources to be linked.Linkage of tax returns or  Payroll Provider, and Financial Institution is required to verify your stated income.”Notice that was something I already knew and doesn’t address my problem at all. Some of my income isn’t in US dollars. If they won’t recognize my crypto assets, they should at least honor a loan for 98k worth of assets. My verified income was less than a 10% difference from the income I originally claimed and the income they found. But my approved loan offer dropped by 40%!", "rating": 2}, {"title": "No trust in this company", "text": "A little over a year ago, I took out a home equity loan with Figure lending.  The process was pretty easy to get through and I was very satisfied with the experience. When I decided to refinance my principle mortgage and consolidate my debt, Figure seemed like the natural choice.  I was refinancing to lower my monthly payment amount so I could prepare for retirement in 10 years.  When I initially started the loan process, I had options to pay to reduce the interest rate, but the rate and payment they offered was in the range that I wanted so I opted not to pay to reduce my rate.  I started the process and locked in my rate.  Once I was locked in, the process became complicated.  Instead of a check list letting me know everything I would need to prepare, it was one thing at a time and it seemed like I was dealing with Columbo...\"Just one more thing.\"  I suppose for people who have their own scanners and save everything electronically, the process might be easer, but for me it was a nightmare.  For every \"one more thing\" I had to find the information they were looking for, leave my house to use a scanner, send it to my e-mail, then go home to load it in on the Figure website.  By the time, we got to the appraisal phase, a lot of time had been wasted on all those back and forth trips.  Unfortunately, there was an issue that came up during the appraisal that had to be corrected before the loan could go through.  I had the work completed as quickly as I could but due to issues I could not control, it took several weeks.  When the work was done, I got a generic e-mail stating I was approved for the loan at almost a full percentage point higher than what I had originally \"locked in.\"  The payment was almost $200 more than the original terms and out of the range that I wanted for retirement.  I understand that circumstances might have changed during the loan process, but nothing about the rate increase was communicated to me by my loan officer...just a generic e-mail.  Also, I was upset that Figure could change the terms but I did not have an option to do so.  I could have reduced the loan amount request as I had already paid off almost $7000 in debt while the loan process was going on.  I could have opted to pay the points and reduce the interest if I had been given an opportunity, but I was not.  When I read the e-mail, I felt like Figure was a company that would make sure their best interests were met, but had no concern for me.  I no longer trusted the company and turned the loan down.", "rating": 2}, {"title": "OnLine Application", "text": "This review is specific to Figure's online application.  I have no complaints about the Home Equity product that Figure offers and none about its customer services staff - Daniel, Roderick, and another chap, each of whom was extremely professional and extremely helpful.      Your website needs to be more user friendly.  Adjusting the loan amount is not obvious that you have to use the slide bar and nothing on the screen told you to use the slide bar, consequently my application was delayed for a day because I could not adjust the loan amount and had to cancel my first application.  The second and by far, the WORST problem on the application is the four attachments the customer has to read and sign.  The fourth one is about 15 pages long.  The quality of these attachments is EXTREMELY POOR.  First the font is way too small and the contrast of type color and background very poor, and for me, impossible to read on the screen. I decided to copy it and paste it in Word - the formatting was ridiculous in Word and I spent almost four hours adjusting the format in Word so that it would be reasonable as I adjusted it from 27 pages to about 15. Daniel then suggested I do a \"control plus\" to make the font larger, which worked for some type and for others the font washed away completely into wavy shadow like lines.        I believe it is absolutely unbelievable that a company lending large sums off money could possibly have such an inept and incompetent attachment that was critical for the customer to read and for completion of the lending process.  This problem delayed the completion of my loan by 4 days (still not completed) and as I write this I am so incensed at such incompetence that I am wondering if Figure is just another corporate entity that takes unfair advantage of its customers by giving them barely readable \"fine print\".  You must admit that the recent economic collapse revealed how banks, insurance companies, and other financial institutions lied and took unfair advantage (cheated) of their customers in processing financial instruments, so one's suspicions of your ethical standards in light of a critical attachment that is unreadable is very understandable.         Under no conditions should your website/application cause me or any customer to do hours of work just so they can understand the fine print.  Then again, maybe most customers do not read the fine print, but I do.  I strongly suggest you correct/improve these attachments immediately.", "rating": 2}]