[
    {
        "title": "Satisfactory services.....",
        "text": "Date of experience: April 20, 2022",
        "rating": 2
    },
    {
        "title": "Be Upfront and Disclose it All",
        "text": "I'm disappointed that I must write a negative review. I took it literally when Chris Ohm said, \"There won't be any additional charges/fees, just $3000 to list and 2.5-3% buyer's agent fee. Even after asking two or three times about more fees or charges. But Clever didn't mention the closing cost that sellers must pay in the end. It wasn't until I spoke with my agent that I was told those additional closing fees aren't a part of the $3000 listing fee. I guess it was naive to think it matters if the ads or representatives don't express to the consumer, \"But there might be the closing cost to discuss with your agent.\"",
        "rating": 2
    },
    {
        "title": "Sellers real eatate was great. Clever not so much.",
        "text": "Sellers real eatate was great. Clever and its reps non existent. No follow up theoughout transaction. Very poor. I thought you guys went out of business.",
        "rating": 2
    },
    {
        "title": "They let in a bad agent, but connected me with an agent who acknowledges the model, but he too changed his mind",
        "text": "I’m received the email to get my Clever Partner Agent Markus with eXp Realty. His response, \" I charge 3.6% commission on the listing side\". Clever sounds like BAIT and Switch\" operation that doesn't do much screening!He also said:Subject: Re: Meet Your Clever Agent Match 🤝 Markus: Clever is a challenging referral source.  I don't offer full service flat fee listings, but they keep connecting me. -  we should talk about what you want out of an agent - cheap and basic or an actual pro who knows how to close deals quickly for the most cash in your pocket.  Markus I sent the above email back to Clever. I said I would give them another chance and now have a agent that understands the Clever model and agrees to abide by the rules. I may need to adjust the rating up or down later depending on the service.Today I got an email from Gary my new agent that Clever referred that said \"in this market, for the extreme discounted commission you agreed to by using Clever Realty, we don't feel we can be of any service to you at this time.  Good luck to you.\"",
        "rating": 2
    },
    {
        "title": "You Get What You Pay For",
        "text": "My agent assigned by Clever led me to believe that he had special tools and algorithms to maximize the price of my property. His initial CMA showed a price that was aspirational to me and compared favorably to other agents' estimates. Upon signing with him, he immediately told me that the market had magically softened, and I needed to list substantially less than we first agreed. Upon asking for some backup on where his data was coming from, he immediately backed down and said, “I just estimate the price”. So, he then went with the price negotiated down somewhat, but not all the way, from what he first proposed. Upon having someone else take photos and poorly \"virtually stage\" the unit in non-sensical arrangements of furniture, we listed. Did I mention the property description on the MLS was filled with grammatical errors?  Yeah, poor written English for my agent.  Three whole weeks later, he finally held an open house, the only one in 6 months of our engagement. Thirty or so days in, I asked him where we could move the price to generate more interest and he again just estimated and when asked to provide data of any sort, failed to do so. Despite this, we dropped the price.  Again, no open house, no follow ups, and I don’t think he even attends showings or visits the property to be sure it’s locked.  I went to my property one day and found, after a rainstorm, that the windows to the property were left open and the floors were wet from where rain blew into the unit. Thankfully there was no damage.  After ninety days on the market, I asked if we could have another open house, combined with a price reduction and a more thought out marketing plan.  No clear or real response followed. I chose to pay to cancel our engagement and in the spring I will list with a real agency.  Yeah, it’ll cost $4k more but they’ll be sure to help avoid $25,000 in price decreases after being misled on the potential for the property.",
        "rating": 2
    }
]