[{"title": "Didn’t fix my issue and the repair guy…", "text": "Didn’t fix my issue and the repair guy didn’t really investigate what was needed to fix it or explain what the real issue was.  However the the fact that my repair bill was refunded was very good customer service. ", "rating": 2}, {"title": "I just received order confirmation", "text": "I just received order confirmation. No details about delivery dates. The prices appeared to be higher on line that purchasing at the store", "rating": 2}, {"title": "City Limits 4 piece sectional.", "text": "I bought the City Limits Sectional last October- the end piece broke within a couple months, you’re responsible for bringing it back to the store which wasn’t possible. The fabric has pilled so much it looks terrible- not to mention the price dropped almost $500 not long after I purchased it. Also it was advertised as zero interest for 48 mos then the credit card company added a fee and you either had to pay it or cancel your account. Very deceitful.", "rating": 2}, {"title": "They didn’t connect the Sofa right", "text": "They didn’t connect the Sofa right, was causing it to slide around ", "rating": 2}, {"title": "While I have always appreciated the…", "text": "While I have always appreciated the construction of what I buy there. This is the first time I have every been told I would receive my product in 2 weeks and not getting it until the end of the month which is over a month for delivery. Said I should have known before I left the store. Since I was told about 2 weeks, I thought she would have offered some sort of a discount for not being told the truth. Good business, but nothing. Just I should have know before I left. No help ", "rating": 2}, {"title": "Went there with my kids and felt unwelcome ", "text": "Went there with my kidsDespite you having a child room almost all your staff was staring at us rudely simply because my son was loud( go figure 2 year olds still have some stuff to learn).Only one lady spoke to us the whole time and she’s the one that we ended up doing the sale with.The store as a whole felt hostile and unwelcoming except for that one lady.Maybe they could train staff in Abilene to not just smile and be polite only when making a sale but to be polite and welcoming throughout the whole visit ?", "rating": 2}, {"title": "Queen size comforter set", "text": "I wanted to purchase a queen size comforter set - was told only available in King size but there was a price listed for the Queen set as well. Doesn't make sense to tell customer only available in King when the comforter has a price for Queen or price for King", "rating": 2}, {"title": "Installer gets an F", "text": "The furniture that arrived is the same we selected in the store. The furniture gets a solid 4 stars for value and style. The installer gets 1 star for stripping a screw, taking the completion picture and leaving. He played it off as if everything was good to go and that is what hurts the experience. The screw fell off on its own less than a week later. Took the husband about 20 minutes to fix it.", "rating": 2}, {"title": "Need to have better delivery service…", "text": "Need to have better delivery service employees, that are responsible and honest about their work. We pay too much for furniture, and the delivery person is in such a hurry to get it delivered that they run into doors and damage the new furniture, which cost a lot to deliver. Stop covering up your messes with a marker when you cause a chip or scratch on furniture, etc. It's taken too long to get this resolved.", "rating": 2}, {"title": "disgruntled customet!", "text": "I've phoned the store, called customer service, and even left a voice mail 2 times for a salesperson to reform my call. I am still waiting and it has been one week. I will definitely go to another location in the future to complete my shopping!customer! I purchased & picked up my loveseat on 5/10/24 in Abilene and started phoning on 5/13/24....", "rating": 2}, {"title": "Customer service wasn't the best while…", "text": "Customer service wasn't the best while making a large purchase. Almost made us feel like we were a burden even though we were making a large purchase. Condescending and rude. We were not offered any incentives or provided with discount options. Didn't provide details on how to sign up, didn't warn us to not click on Payment Security program. Made us feel as if it was our fault. Could've done a better job providing us details.", "rating": 2}, {"title": "Had to exchange nightstands for the…", "text": "Had to exchange the nightstands for the smaller mirrored ones. Picked up 2 nightstands at the NRH location. Got home and they packaged broken merchandise. Highly upset set as the initial delivery was on 6/4 and here it is 6/9 and  still can't use all the pieces. Very upset. Had to submit a claim and now waiting to hear back on a resolution. ", "rating": 2}, {"title": "I was rung up for the wrong item", "text": "I was rung up for the wrong item, as I was in a hurry (do to family emergency) did not notice, sale associate should have seen their mistake and fix it. I got the wrong item, and the deliver people could not care less, Call got it fix new deliver at my convince. after stress you did make it right so thank you.", "rating": 2}, {"title": "Furniture arrived on time but bed was…", "text": "Furniture arrived on time but bed was damaged. Delivery guy said that someone from Home Zone Furniture would call me in 1 hour to inform about next steps but no one did. I had to call to remind of damage furniture. Received a call the following Monday to inform that I would have to wait 3 weeks for them to replace damage parts.  I believe if something like this happens the customer should get compensated one way or another. The only thing I received was a \"I'm sorry\"", "rating": 2}, {"title": "No flexibility on delivery. Great people that deliver though. ", "text": "Very strict on when it can be delivered. No flexability on time. Corporate doesn’t communicate with delivery people. The store was supposed to keep it for pickup since they wouldn’t work with us on time. It still was delivered early when it wasn’t supposed to. The delivery people were awesome though. ", "rating": 2}, {"title": "Picked up recliner to save $100…", "text": "Picked up recliner to save $100 delivery charge. Headrest did not function. Now I am being asked to load and return for a replacement since part is not available. I believe that if a store sells defective furniture they should take care of replacing, not the customer. Lousy warranty policy. They have lost a customer as I will probably not shop there again because of this issue as I have to get help to load and again off load plus gas. Request they debox, assemble and test beforehand on replacement.", "rating": 2}, {"title": "i just bought a king size bed with…", "text": "i just bought a king size bed with mattress and under 2 months the whole bed has fallen apart. I spent over $6000.00 in home zone thinking i made a good investment but with this bed issues am beginning to wonder if other furnitures i bought also from Home zone will be the same", "rating": 2}, {"title": "Given incorrect delivery timeline at…", "text": "Given incorrect delivery timeline at first. Had to go pick up to have it by time needed. Had to stand in water in loading dock to help employees load sofa and loveseat with no equipment. Once home and unwrapped, found broken boards and leather rips on both pieces. Only reason 2 stars because they quickly offered to replace.", "rating": 2}, {"title": "The sales person was very friendly and…", "text": "The sales person was very friendly and we found a set we were interested in and asked that she send us a price for sofa, chair and ottoman.  We were going to lunch but we never received any correspondence from her.  Our 1st time in the store.   ", "rating": 2}, {"title": "Cheap furniture ", "text": "The quality of furniture is cheaply made. Within a week after delivery of the couch the pillows began to separate. Additionally, I ordered the triple power port Arthur recliner and was informed they are on backorder. However, after the first delay was told again that it would be an additional month before delivery.  Furthermore I checked website to find they were in stock. Very disappointing!! Had it not been for the exceptional customer service of your manager (Katey and Jessica) I would have given 1 star.", "rating": 2}, {"title": "Store employees need to know their policies ", "text": "We went in knowing what we wanted, should have been quick and easy.  My husband wrote a check.  It took three of them 15 minutes to try to figure out how to process it.  They said the system was down and that would call us when they have it entered.   We left and then later got a call that we would have to wait 5 business days for the check to clear and that our recliner couldn't get delivered when we wanted it to.  We had to go back to the store and use our debit card. If the sales people had known their store policy this could have been avoided and we would have used our debit card to begin with. ", "rating": 2}, {"title": "Nice furniture but customer service sucks!", "text": "I was promised a delivery with Albert.. even though Thomas made it happen.. we had to go back and forth because Albert basically lied and then made it seem like he didn’t remember the conversation.. the delivery guys didn’t take any of the paper off the bedroom set.. I asked them to place the sectional in a certain spot before I had to leave and that wasn’t done", "rating": 2}, {"title": "I could get no concrete answer on…", "text": "I could get no concrete answer on pricing. The salesman had one  price, the manager another.I wasn't shopping. I was there to purchase 3 items.That did not happen. ", "rating": 2}, {"title": "Purchase", "text": "Purchased a week later called me to say one of the items in stock was unavailable and canceled the order had a few calls after that.the company can improve by letting the customer know right off hand if and when items are or will be available before the purchase.", "rating": 2}, {"title": "CHARITY.", "text": "Extend charity to to low income people in any part of the globe,I will appreciate if this is extended to me this will serve as publicity for your company.", "rating": 2}, {"title": "Return paid for with cash will NOT be refunded in Cash!", "text": "I purchased and paid cash for a bed frame from Home Zome in San Angelo,Texas.  Upon arriving back home, in a small town, I found that my son, who lives in another state, had ordered a complete bed for me.  When I returned the bed frame I bought to Home Zone, I was told that since I had paid cash, I would have to wait approximately two weeks to receive a refund.  I was not advised at the time of purchase, that if I returned the item, I would not receive a cash refund. I find this absolutely unacceptable and will never shop at Home Zone.  Furthermore, my family and I are spreading the word in hopes that others will not be affected by this scam.   Fingers crossed that a check actually arrives for my refund.", "rating": 2}, {"title": "Still waiting for  mirror brackets for…", "text": "Still waiting for  mirror brackets for the dresser to be installed. Customer service promised to fix the issue on last Saturday. But no tech was dispatched and when contacted customer service told us that there was a glitch in the system and tech will show up on Tuesday to fix the issue.", "rating": 2}, {"title": "Delivery mess up", "text": "As far as your store employees they were awesome! Order was supposed to be in Friday, I took the day off only to have box springs delivered with no bed frame or recliner. Now I have to take another day off to get the furniture Wednesday.", "rating": 2}, {"title": "Disappointed", "text": "The experience in the store and customer service have been great. However, the delivery not so much. The wedge is not leveled so it is unable to sit still on the floor and the right section arm chair looks very worn/torn. I’m disappointed, because all of the items I bought was supposed to be brand new and is not. This weighs down my experience and my enjoyment.", "rating": 2}, {"title": "This started off as a good experience…", "text": "This started off as a good experience at the store when I purchased my furniture. I set my delivery date a week out because that was the only day I was available. The confirmation says that it will be delivered between 2:30-6:30pm on 04-12-2023. I called at 5pm just to get a ETA because I needed to go somewhere and didn't want to miss it. The lady told me the eta was 6:15pm, It didn't show up until a little after 7pm. On top of that they were missing pieces so they couldn't deliver nor assemble it. They came back at at 9:15 am to actually deliver and assemble the furniture. This was such a inconvenience because I had to push business meetings back. I understand things happen but this is unacceptable!", "rating": 2}, {"title": "Sales people were helpful and polite", "text": "Sales people were helpful and polite.  I would give them a good rating.  Service since then has been lacking.  Apparently the truck came in to be unloaded before 9:00 AM this morning.  It is not 1:30 and we have received no notification as to the status of our order.", "rating": 2}, {"title": "I had a great experience at Home Zone…", "text": "I had a great experience at Home Zone and will return to purchase other furniture. I find their furniture to be excellent quality. And  Thomas was very helpful and able to answer all our questions.", "rating": 2}, {"title": "I believe the managers could have been…", "text": "I believe the managers could have been a bit more friendly, warm and more accommodating to my order especially being a more family Texas brand would have expected great service.  I ultimately end going to Living Spaces spending 11k.", "rating": 2}, {"title": "The salesperson got mad when I started…", "text": "The salesperson got mad when I started questioning and the salesperson insisted that I was getting great deals, etc. Also, the salesperson went back on his word. ", "rating": 2}, {"title": "We had no screws for the (2) couch", "text": "We had no screws for the (2) couch, ottoman, chase.   We picked up the product…it was tightly wrapped and we were told that all of the installation items were included.    We had to go to Home Depot to buy them. ", "rating": 2}, {"title": "Pickup order communication and issues", "text": "1. Order was placed incorrectly by employee in store, therefore items were not scheduled to be delivered to the pickup location on the pickup date. Had I not called, I do not think the items would ever be delivered to the pickup location.2. Pickup communications were nonexistent. I received a text that the pickup location will contact me when the items are ready (confirming that the phone number on file is accurate). I was told at time of order that I would receive a call once the order arrived at the pickup location. I called the pickup location, which told me they send out text notifications.  The text notification never arrived, although I did call later on pickup day, and they told me that the order was there waiting to be picked up and that I should have received a text message. Upon picking up the order, I received a text saying, \"Your order is scheduled for PICK UP. The pickup location will contact you when your items are ready. It won't be long now!\"3. Employees in store were friendly and knowledgeable overall and fairly absent, allowing customers to browse. Store was clean and had good variety.", "rating": 2}, {"title": "Check furniture before leaving store", "text": "Everything was fine with store purchase and finally got piece of furniture home. Then we opened it up to remove from box. It had a crack going down the back of tv console.", "rating": 2}, {"title": "The reason I started purchasing with…", "text": "The reason I started purchasing with you were your prices were where normal folks could afford to shop, but apparently you've gone away from that.", "rating": 2}, {"title": "Recliner issues", "text": "The recliner I ordered does not sit well at all. The back of the chair pushes your back  out so far that it’s uncomfortable to sit in. I have made sure the lumbar support is not extended, if you use the lumbar support it makes it that much worse.  I had to go back to the store to get them to exchange the chair.", "rating": 2}, {"title": "The table I picked up from the store…", "text": "The table I picked up from the store was damaged. The box was damaged. The $109 delivery fee is too high. Other stores I bought items from only charged $29 delivery fees with setup. ", "rating": 2}, {"title": "Was o  good timing but they wasn't…", "text": "Was o  good timing but they wasn't doing wat we ask them to do. They act like it was a bothered wen they was doing the work wasnt happy with the service at all.", "rating": 2}, {"title": "I bought a big rug", "text": "I bought a big rug. They told me I would get a text when it was ready to be picked up in Richardson. We live in Sherman about 50 minutes away. So I received the text that it was there and ready for pickup. So I called just to verify it was there before we made the drive and I was told it was there. We went to pick it up and it was not there. They got on the phone and told us we could drive to your Allen store that they had one there and it would be ready for pickup. So we drove to Allen and was told they did not have it. They said they would deliver it for free within two weeks. So we are just waiting for it to be delivered.", "rating": 2}, {"title": "Wrong mattress we received", "text": "We tested the mattress in the store and we fell in love with it. Nice and soft and comfy. After we bought it and I looked at the number on the plastic bag, they loaded it up on my truck and took it home. Once placed on the box springs and we layed on it, it was hard as a rock, not the mattress we tried on the showroom floor. We were told to trade it in there would be a 20% restocking fee, for a mattress that wasn't what we tried to begin with. What a bait and switch. They said there's a break in period but never told to us when we bought it. You can't break in memory foam. What you get is what it is! Second time we bought a product at Home Zone we were very dissatisfied with and you won't do anything about it. I will slam this company on every web site I can for as long as I can! You are a non service company and do not care if the customer is satisfied only want our money. Terrible company!", "rating": 2}, {"title": "Delivery time is really long and kind…", "text": "Delivery time is really long and kind of expensive for the waiting time", "rating": 2}, {"title": "I liked the buying process…", "text": "I liked the buying process. When I arrived to pick up my furniture it was in a box that I had to bring home and build myself. I was led to believe it would be built and ready to be put in place at pick up. Box also looked like it was thrown down 9 flights of stairs.", "rating": 2}, {"title": "When I received  my merchandiseit smell…", "text": "When I received my merchandise it smell horrible like strong cigarette smoke. The delivery guys smell like strong cigarette smoke. I had to spray mattress down with febrezze an let it air out for a few days. However the seller receives a 5 🌟", "rating": 2}, {"title": "So disappointed at  Homezone…", "text": "Well I tried to really like Homezone because their sales people are very kind , but the furniture has been very disappointing, We bought a living room set, dinning room set  and a bed set all at ones and our dinning room set chairs have been breaking one by one , we went back to get them to replace them and in the mist of that our bed mattress  started to sink, I didn't want to put two claims in  at this time because it was around the holidays and I needed  my chairs mainly for my guess, But the mattress keep sinking and my back hurting . I finally couldn't take it and we went back to BUY a new mattress . Long story short we found out we had guarantee and ended buying a new kitchen table set instead, Fast  forward to now  they came to view the mattress and they told us is not sunk enough. But told us to keep using it  as it was half an inch away from it. To \"comfort \" us they gave us  pieces of foam to cushion the  sinking  areas. Gosh the bed looks terrible . I don't know if I am able to post pictures  but  I will post them if I can ( or in another review page as soon as I can)  now the sinking part is high and the normal none sinking part looks sunken and it has a slang looking bed . It's  ridiculous!! I was under the impression we will get store credit and go back to get a new one of equal  value . I am beyond disappointed and  I hate to be arguing with people . The only times I get the courage to  do so is when my back is killing me in the morning and is then that i regret buying anything from HOMOZONE...... I thought maybe because they did their own furniture themselves it would be better than  rooms to Go but  I was wrong", "rating": 2}, {"title": "Our furniture was the wrong color that…", "text": "Our furniture was the wrong color that we picked out. I should have looked at my paperwork better.", "rating": 2}, {"title": "We received our bedroom furniture and…", "text": "We received our bedroom furniture and the lights on the mirror didn't work.", "rating": 2}, {"title": "Found a good deal for our son but had a…", "text": "Found a good deal for our son but had a very difficult time just getting the deal done. Paid for two different deliveries when everything could have been done once. Took a lot of time & extra phone calls to get things done right. Very frustrating!", "rating": 2}, {"title": "The rep has a bit of", "text": "The rep has a bit of an attitude or sounded frustrated /tired", "rating": 2}, {"title": "The sales rep seemed inexperienced", "text": "The sales rep seemed inexperienced, uninterested, and very slow in the process of my purchase. She didn't seem interested in helping me, but very focused on people coming in the front door, even though I had made my selection. I didn't feel valued as a customer.", "rating": 2}, {"title": "You sent us the wrong sofa", "text": "You sent us the wrong sofa. The one we ordered was Navy Blue. The sofa that was delivered is Black. Please come and pick up the one you delivered and replace it with the correct sofa we ordered. NAVY BLUE", "rating": 2}, {"title": "The buying experience", "text": "The buying experience was good at the Wichita Falls, TX. Courteous staff.Delivery people were respectful.However, immediately after the truck left, I noticed a huge unsightly gouge in the front leg. Wood literally chipped off about 2 inches in length. I immediately called Customer Service. I asked that the truck come back since I was the last delivery and the guys had just left. Customer Service requested photos and I sent them via email. I soon received a call telling me they could send a tech out to repair, but they only service our area on Fridays. I scheduled. The day of my service, the truck breaks down and I had to reschedule for another \"Friday.\"I understand Customer Service was following their policy and they were respectful in dealing with them.However, I will not do business with Home Zone again. I have purchased furniture from other companies who REPLACE the furniture immediately. Yes, it is on their \"agreement\" that they reserve the \"right\" to send a service tech to patch or repair damage. That is a deal breaker for me from now on.When a customer buys furniture and it is damaged before arrival, immediately replace the item and fix the item in your warehouse upon its return! Change your policy!", "rating": 2}, {"title": "Chair out o", "text": "I left a review earlier this week with 4 stars, now I  need to make that a 2 stars or less, after paying over $500.00 my chair no longer works. I  picked it up last Monday, and it stopped working this Monday morning. It's in a reclining up position and apparently the cut cord that I  was not told about has cut the power completely out!", "rating": 2}, {"title": "Smile Diego!", "text": "Sales Representative Diego persisted to be impersonal despite my efforts and my hope to gain confidence in him.  Perhaps he was having a bad day.  The store was incredible however!  Fair prices and specials for Labor Day.  May shop there again, maybe with a Representative more personal though.", "rating": 2}, {"title": "Quality furniture, terrible and disgusting delivery service", "text": "The in-store experience was awesome. The staff were friendly. The product I purchased was quality. My problem was with delivery. One of the delivery drivers was chewing sunflower seeds. I found chewed seeds, recently spit out, in my apartment, on my brand new couch and around the apartment building (indoors). I can't even begin to imagine spitting chewed sunflower seeds anywhere near a customer's apartment, much less their new furniture.", "rating": 2}, {"title": "Bring your own moving crew", "text": "So far furniture seems decent but cheap. We decided to pickup instead of having shipped (to save a week on the delivery time). The warehouse just dumped the furniture out of an above ground bay door on the curb and you have to load everything yourself. Would have been nice to know to bring your own dolly and a few hands to help load in 107* temperatures. Just thought spending $3,000 somewhere would get a little better service. Ill spend my money somewhere else next time.", "rating": 2}, {"title": "Delivery was good", "text": "Delivery was good. Sales was goodProduct one of the chairs is not flat on the ground.", "rating": 2}, {"title": "We repeatedly asked the saleswomen if the box spring was included", "text": "We repeatedly asked the saleswomen if the purchase included the boxspring and she repeatedly said yes. That was a lie. This person needs to be retrained and home zone will be at the bottom of our furniture store list.", "rating": 2}, {"title": "Bishop sofa- already need a replacement seat cushion", "text": "We purchased the Bishop sofa. The size is nice and very comfortable to curl up on and relax and the fabric is beautiful. However, there is not enough stuffing and batting in the seat cushions. One of the cushions is already wrinkling up, and I have only owned the sofa for about two weeks. I contacted Home Zone regarding the defect , and they will replace the cushion but it will take months for the replacement cushion to arrive.", "rating": 2}, {"title": "Feedback from Service Experience on 9/13", "text": "When the representatives came out they had to switch the bracket out on both pieces of furniture that were replaced. This was the initial issue and what I had asked for to take place on my 1st call. Also, there is now a tear/blemish on the chaise that needs to be repaired. The reps. that came on Monday were great. They went above and beyond, were professional, and fun to talk to.", "rating": 2}, {"title": "Frustrated with delivery of furniture", "text": "I got my chair & ottoman and love them but the couch & loveseat keeps getting pushed back on arriving... I bought them in July & won’t be here until November... but it’s been pushed back twice so might be pushed back again. The man who sold us the furniture was very nice - James & we appreciate the service we got but it’s very frustrating to wait so long.", "rating": 2}, {"title": "I went in to the store shopping for a…", "text": "I went in to the store shopping for a bedroom set and I did end up making a purchase and also ordered some lamps. Well it has been almost three weeks with no word on when the lamps will be arriving. They keep telling me the lamps are in transit. Not sure where they are being shipped from but this taking so long I have lost interest in the items and will be requesting a full refund.", "rating": 2}, {"title": "Shipping Damage", "text": "All was fine. Except one thing. because the area rug I purchased is not kept in stock. Much better packaging / shipping material should be used. I would have been very upset. After waiting a week only to return it for damage goods. With the shredded packaging I was praying it wasn’t damaged. I got lucky. Had it been damaged I would have demanded a complete refund and purchased it somewhere else.", "rating": 2}, {"title": "Wrong product Delivery", "text": "Date of experience: July 16, 2024", "rating": 2}, {"title": "Cheap material. Covered in sand.", "text": "I bought a couch at the tent sale yesterday. Requested them to wrap it in plastic 3 separate times and they did not. Came to pick it up and it's been baking outside with no shade and is now completely coated in sand. I am not sure if the material was this bad when I first looked at it or if it was a result of baking outside for a day, but when I went to brush off the sand the fabric on the armrests tore. I have owned this couch for less than 24 hours. It now has multiple tears on each armrest and is coated in sand. I am not confident that cleaning the couch with an upholstery cleaner will not further damage the fabric. What happened to the days when you got what you paid for? Certainly was not the case here in quality or service.", "rating": 2}, {"title": "If I wanted to have to put the…", "text": "If I wanted to have to put the furniture together I could shop at IKIA store. I should not have to pay to have my ideas put together. Or because I’m old or handicapped have to pay some one to do it.   Why can’t I buy the floor models and let them stay at the store until the ordered ones come in. Expecelly if there are several of them and I’m not buy all of them. Like kitchen chairs.  If everything is ordered why have a store at all", "rating": 2}, {"title": "Product was initially received damage", "text": "Product was initially received damage,  both doors warped,  we were informed that both side piers would need to be replace,  new product was received,  however,  only doors brought in,  which one of them he dropped onto the pavement from the back of the truck,  for which he started to use a paint pen to touch up.   The doors are still warped and do not open close properly", "rating": 2}, {"title": "My sales rep was rude and didn’t know…", "text": "My sales rep was rude and didn’t know what she was doing, and unfortunately when I came back in to purchase the nightstand.  I was greeted by the same salesperson.  She lied straight to my face and it wasn’t until I demanded to speak to a manager did my issue get resolved.  She was belligerent and demeaning I will never buy another piece of furniture from her ever again.", "rating": 2}, {"title": "Friendly staff, but delivery delays", "text": "My salesperson was very friendly and accommodating. He found my item at a nearby store location and we scheduled the pick-up for a few days later. It has now been a week later, and no one can even give me an estimate as to when my item will arrive. I have ordered other items from here with a similar experience.", "rating": 2}, {"title": "The furniture is great but the Delivery…", "text": "The furniture is great but the Delivery people would not set up everything and if you don’t pay them they’ll leave it outside your door ,when you purchase the furniture they should tell people that so they will know upfront my daughter and I was struggling to get it in the house in the big boxes that came in until we got $100 together to pay the delivery guys what kind of delivery services is this", "rating": 2}, {"title": "I like the couch but I felt like I was…", "text": "I like the couch but I felt like I was cheated by the salesman. I bought a couch, paid $50 for delivery and $50 for put it all together. Well, all they did just brought it from front door to my living room. I wish the salesman told me that in the beginning with so I could brought it to the room instead lied to me and said they have to put it all together. I’m so disappointed!!", "rating": 2}, {"title": "I still missing my carpet", "text": "I still missing my carpet, they told me we have it here if you can come and pick your carpet because we can’t take it to your house. Then I went to the store and tell the lady I’m already pay for my delivery so I need my carpet and she say that the manager will bring it on Tuesday but I still waiting for his call to see at what time he can come", "rating": 2}, {"title": "Wrong product", "text": "This was the fifth item we have bought from them, we received the wrong product (recliner chair) and then had to prove to them that we weren’t lying about it. There was an option to get an electric one for the same price and they neglected to tell us, so we got the manual version. The service was just not as good as the previous times. Check online before you buy!", "rating": 2}, {"title": "Very disappointed customer", "text": "I purchased a set, (bedroom). The dresser was back ordered but paid for with the promise that it would be delivered in 2 weeks. After not hearing anything from anyone in 3 weeks, I called. I was told that the delivery wouldn’t happen until late July! All I got was an apology that she was sorry no one updated me! Now it will be another 3 months til I get to complete my set. That is not very good customer service, I guess they figure they already have the money so no need to be customer friendly anymore. Just pitiful.", "rating": 2}, {"title": "Purchased a Palmer table", "text": "Purchased a Palmer table. When assembling noticed under piece of wood came off. Re screwed it. Then noticed dents on corner of table, staples showing in corner, table bracket broken. Etc. Was informed tech would come over to inspect table a week later. I would like to cancel my order with home zone.", "rating": 2}, {"title": "When we went to put our bed together we…", "text": "When we went to put our bed together we discovered we had been given the wrong footboard.  When we took it back to store and told them wrong footboard was shipped, they told us no it is in warehouse. After a search of their warehouse it was discovered that yes wrong foot board was indeed shipped.  We had to wait another 3 or 4 days for the right part to ship to store.   The order was not checked at the warehouse when it was received to make sure order was correct", "rating": 2}, {"title": "Would be better if they hadnt delivered…", "text": "Would be better if they hadnt delivered it upside down with a hole in it. I have called 5 times in regards to this and keep getting told it is being looked into. I spoke with a girl named Ashley. I am also missing the decorative pillows that were supposed to be included. I am not happy with the communication and delivery experience from Homezone.", "rating": 2}, {"title": "I ordered a dining room table", "text": "I ordered a dining room table. Waited two weeks for delivery. When it was delivered they were missing the hardware to put it together so they took it back. It was delivered a second time and it was missing a piece to put it together. I contacted the sales manager Dacia who assured me someone would be out with the missing piece the same day. I never heard back from them after waiting several hours. This is my first and last time buying anything from Home Zone. Such a disappointment.", "rating": 2}, {"title": "They have not send the hardware on my…", "text": "They have not send the hardware on my mirror dresser.  And when I received the supposed to be hardware to connect the dresser and mirror, the screws are missing.  We have to buy our own screws. It took more than 2 weeks before we got the missing hardware. But the Bedroom set furniture is really a nice one.", "rating": 2}, {"title": "I was in the store yesterday", "text": "I was in the store yesterday. I was helped by Dylan and was not very happy with the customer service that was given to me. He seemed more concerned with his what he was seeing on his cellphone then helping my wife and I. We planned to go back Friday but will be going to the Lawton location instead.", "rating": 2}, {"title": "Floor model", "text": "I received a piece of furniture that was damage and replace with a floor model. I could tell because screw on footing where already on not like the first one received and the (Do not remove tag where removed) instead of given me a discount there swore up and down that it was not the floor model.", "rating": 2}, {"title": "SO VERY DISAPPOINTED", "text": "The Mattress does not work for my back.. so I am unable to use it.. however, I can’t return it for 60 DAYS!  That makes no sense from a customers perspective.. you want to keep your customers happy so they come back to you... so they recommend you to your Family and friends. This makes very hard to even walk into a Home Zone again", "rating": 2}, {"title": "Well the sofa came and had a few…", "text": "Well the sofa came and had a few imperfections idk if it’s from the delivery or packaging process or what. I called to see what the policy was and they told me I had to take pictures email them and wait so I’m not feeling that process at all  especially cause I paid a lot for the sofa!!!! Update as of 3/8/2021 So I did the process that home zone ask us to do regarding the sofa still no response from them on how to correct this situation, after I have emailed them several times!!! Maybe this review will get someone to respond to me!!!!", "rating": 2}, {"title": "The two mattresses we received for our…", "text": "After speaking to Customer Service I want to update my review.  I can’t say enough about how well Customer Service has responded.  Very professional and helpful.Again, our issue was and still is with quality control from wherever the product was shipped.  Attention to detail would have prevented this issue.Thank you, Emanuel with Customer Service!The two mattresses we received for our adjustable bed did not match each other.  One is at least two inches thicker than the other.  Impossible to sleep comfortably like this.  Still don’t have a date to receive the correct mattress.  Seems like it should have been very easy to make sure that matching mattresses were delivered.", "rating": 2}, {"title": "Couch", "text": "Bought our couch, decided to do pick up. The day we were supposed to pick up we were on the phone with them all day then drove an hour and a half to get there and they didn’t have all my furniture there like they said it was. So had to wait days and drive again to finally get all of our stuff we bought.", "rating": 2}, {"title": "This was the second delivery for the TV…", "text": "This was the second delivery for the TV console. They delivered the same unit I rejected the first time around. I had left instructions to Delivery. Where is the QC? The item had paint issues, the delivery man tried to touch it up with paint but it looked shabby so I had to have them take it back. So unnecessary.", "rating": 2}, {"title": "I would not recommend this furniture!", "text": "I would not recommend this furniture!! I bought a dinning room set, bedroom set, mattress and couches all from here.. the bedroom set I bought the finish came off of the side table incredibly easy like it’s painted on and just rubbed off!! The mattress has already dipped in and I bought a more expensive set.. and last the dinning room table was the same way the finish scratched up the first day I had it and now a piece is missing off the side! You can tell it’s not real solid wood and is not stain more of a paint!", "rating": 2}, {"title": "Broken Table Leg", "text": "The shopping for furniture was great our Sales Rep in the store was awesome and very knowledgeable. We received the furniture and it was assembled quickly. The next day we noticed the leg of the table is completely broken and was broken when being assembled. It is difficult to use the table because we have to hold up the leg so the table won’t fall. It has taken them over a week to finally decide to replace and it’s a huge inconvenience when we have 3 small kids that need a place to eat and do homework.", "rating": 2}, {"title": "I was promised my money back after…", "text": "I was promised my money back after warranty was up and I went to go get it with receipt in hand I was told no I couldn't do that. I spoke to the DM and he finally told me that I wouldn't have to spend another 299.99 in order to use my 84.00 comp pay. I told him I wouldn't leave without my money or money's worth. So they I finally got a nightstand for that price. The point is I shouldn't of been told I can get my money back and then them making me feel as if I would lose that money.", "rating": 2}, {"title": "I ordered the urban sofa and loveseat", "text": "I ordered the urban sofa and loveseat. it was gray on the website but when i got it... Denim... i didnt wanna go through the hassle of having to have it re picked up, select another couch and wait for that to be delivered too so i have to make it work. its still cute.", "rating": 2}, {"title": "As much as I want to be impressed, I'm not.", "text": "As much as I want to be impressed, I'm not. I always say, you pay for what you get. In this case, I overpaid for what I got. I literally had to return a piece the day it was received, and tonight, noticed one of my recliners is messed up.  It's been under a month and all I can do is think about how bad I want to return my furniture. The salesmanship in the store may not be driven by \"commissions\", but these associates are all about their quota and will feed you whatever bs you want to hear in order to reach their numbers.", "rating": 2}, {"title": "We bought a room set and on 3 occasions…", "text": "We bought a room set and on 3 occasions they had to bring different pieces of the room set because they came seriously broken in the back and in other areas the slot was touched up and painted.  It was our first time with you and a great nightmare.  Customer service employees have a 100", "rating": 2}, {"title": "The service, not the product, was great!", "text": "The service was great! However, once I assembled the couches, a bracket broke from the connector plates. Definitely did not expect that to happen. And since then, I've found a random screw here and there. After paying almost $3000.00 for furniture, I would have expected higher quality.", "rating": 2}, {"title": "Great showroom experience", "text": "Great showroom experience. Furniture and my house was damaged with delivery. Also a draw was broken on arrival, they couldn’t fix it and now have to replace it. The drawer with the light had broken wires and I needed to cut wire and crimp to fix it. Get your quality and delivery together!", "rating": 2}, {"title": "Delivery went ok", "text": "Delivery went ok. Some damaged pieces. Have a service call in for that. The sales person read off what they had on the list, but somehow got an additional piece on the list. I was charged for it, I accepted it at Delivery because I will use it eventually. However I didn't need the piece. Also, I was lead to believe the furniture to be a Texas made Texas company. However, every piece of furniture has a \"made in Vietnam\" sticker, instructions, and tags... very disappointing. I accepted the furniture because I couldn't afford to wait any longer...", "rating": 2}, {"title": "Purchased livingroom set", "text": "Purchased livingroom set. After paperwork was finished was informed it was not in stock. Could come back in 3 days to get chair and loveseat. Couch would be delivered on following Monday. Monday came and went with no couch and no phone call. When I called to inquire about delivery they said the couch will not be available until 3rd week of August (4 weeks ) so we are having to use lake chairs in our living room. Went to look for another set that I like but did not find anything within my price range. So stuck in a crappy deal and no couch for a month. But still paying for it...", "rating": 2}, {"title": "We never received the funds promised to…", "text": "We never received the funds promised to us after we mailed the document back", "rating": 2}, {"title": "ruined our floors:(", "text": "Delivered on time and sooner than expected!  However, our nice bamboo floors were horribly scratched in the process.  It was in the middle of the room and cannot be replaced without redoing the entire 1/2 of the floor.  Our nice bed turned into a couple thousand dollar job.", "rating": 2}, {"title": "Aviator Sofa", "text": "In less than a month, the sofa needed repair. We paid our $69 for delivery when repair completed. Now here it is 3 weeks later and the sofa arm has come loose again. So I'll need to pay another $69 if I choose to have my sofa delivered upon repair.  What a money grabber!", "rating": 2}, {"title": "recieved the wrong bed after clearly…", "text": "recieved the wrong bed after clearly asking for the right one, and the second time around the gentlemen fell while carrying my bed, thankful that everything is ok, i feel like they should take there time a little more to make sure things are getting done the right way.", "rating": 2}, {"title": "My bedroom came without screws to…", "text": "My bedroom came without screws to attach the front board and the rear board it also came without screws to assemble the wood sticks across the bed.This apart other items missing I bought this product about three weeks ago and we still can’t use it.", "rating": 2}, {"title": "There is always something wrong with…", "text": "There is always something wrong with the furniture when it arrives.  I would prefer that when I voice that to the delivery people that they get someone to call me instead I have to initiate a call to customer care still to get it taken care of.", "rating": 2}, {"title": "Sales man was worried more about a sale…", "text": "Sales man was worried more about a sale and not about me getting the bed i wanted. Tried to tell me the bed was a king size when it was a queen. Promised me the bed would be available the same day when it wasn't just to get the sale.", "rating": 2}, {"title": "Horrible", "text": "Horrible installation that I had to finish myself on the bed frame and they left half way through unpacking the couch and love seat. They also installed the box springs and mattress upside down. I love the products but your installers are lazy and stupid!", "rating": 2}, {"title": "The salesman made a request to increase…", "text": "The salesman made a request to increase my credit without talking to me. Went to pick up merchandise, called talked to the GM and was told to go to the back of store. Waited for 25 minutes for someone to come to door, had to call to get someone to come to door. then was skipped.  Once the person got they're merchadise, i waited some more and one of the loaders came to tell me that my merchadise was there but didnt hv the screws. Wasnt very empressed with the level of customer service. I was was acutally very upset the way things went down. GM did try to accommodate me by having my merchadise delivered on sunday whaic almost didnt happen bc of call ins.", "rating": 2}, {"title": "Your tv ad is misleading", "text": "Your tv ad is misleading.  I thought I was getting a chair made in Texas.    The chair was made in China!  I would not have ordered/purchased it had I known this before I picked it up.", "rating": 2}, {"title": "The sales person was nice i just felt…", "text": "The sales person was nice i just felt pressured into buying my furniture and im not 100% happy with it...she did not explain pricing well or the monthly payments until the end...so I spent alot on furniture I feel is not worth it", "rating": 2}, {"title": "Defected Night Stand", "text": "Hello, it took three night stands for us to get one without defects. Our prayers is that Home Zone will make the next customer problem a priority to be corrected in a timely manner.Thanks for asking for our review.  Have a good day.", "rating": 2}, {"title": "No explanation/No return call", "text": "My leather sofa not yet a year old began to peel off at the seams on each of the three seat cushions. I filed a case with hz and my ticket number is 5012. I have waited for replacement cushion covers for 10 weeks. Whenever I call to inquire I am told another four weeks, another six weeks with no explanation as to why. I have never been able to speak to Mark, my initial contact, nor will he return my calls. I wonder if it has occurred to them to locate me three entirely new cushions somewhere as replacements if they can’t manufacture three new covers? Very disappointed in the handling of this. I would like a phone call. No more messaging back and forth. Rhonda Trest254-715-2735", "rating": 2}, {"title": "I bought a dining set for the kitchen…", "text": "I bought a dining set for the kitchen area. Paid over $900 for the set. Wasn’t 6-7 months later, one of the legs of the chair snapped off, not broke, snapped off. 7-8 months later , a second chair’s leg snapped off. Not a happy camper.", "rating": 2}, {"title": "Service is bad", "text": "I love home zone, and I had nothing but good things to say about the Denton location until my last purchase a few weeks ago.  Donn the sales lady that helped me was so rude! She even grabbed my cell phone from my hands because I wasn't getting the conformation text message quick enough for her. She took my phone and i had a few text messages on the screen in Spanish and she said oh well I dont speak Spanish. I took my phone back  and ask her not to do that please. Iwas so mad by this time now. I believe she realized I felt very uncomfortable and she changed her attitude and said she was sorry, but she had no excuse to treat me like that.", "rating": 2}, {"title": "I bought a Hamilton table", "text": "I bought a Hamilton table, it was delivered last week Wednesday, After the delivery people left , I noticed a lot of nicks and holes on the table. I emailed the CS Dept and was told that it was the nature of the wood. I sent them photos and they tried to send me a photo of the table in the store. I seen the table when I was in the store and took a photo myself and it did not have all the nicks and holes I do. There are a couple of things I can see as natural wood, but not all. I have 41 irregularities compare to their 2or 3. I even had a CS agent agree that some were natural and some were holes. I bought a couchbset from their. I see why they have final sales.", "rating": 2}, {"title": "horrible", "text": "My mattress didn’t inflate properly and we didn’t have anywhere to sleep for 2 weeks We had to sleep on our couch until another mattress was delivered.We paid 500 dollars just to have to wait to actually sleep on a mattress.", "rating": 2}, {"title": "Love the dining set and delivery…", "text": "Love the dining set and delivery service but within the first week the bench to the set broke right from under a guest while sitting on it. I’ve put in a claim and depending on how it is handled I will update the review.", "rating": 2}, {"title": "Didn’t buy anything", "text": "Didn’t buy anything. We found the same couch set for about a thousand dollars cheaper at another store. The staff member, Marley, was helpful when we were in the store", "rating": 2}, {"title": "They repaired my sofa & it came back…", "text": "They repaired my sofa & it came back with smudges it never had ! 🙁 I’ve only had the sofa for about 9 months so I have tried to kept them well kept . So I was super disappointing they way they came back now the side it was repair looks worn out & has smudges on it & my sofa is a light tan color ! So it looks dirty I paid the 100 delivery fee so I wouldn’t have any issues messing anything up or getting dirty so not sure what happened . I got a called when they got delivered & explained my situation was told I was going to get a call back & no one has called me . Also the side that didn’t need any repair now sounds like the wood isn’t properly secured .", "rating": 2}, {"title": "Refusing furniture at delivery is not…", "text": "Refusing furniture at delivery is not as pleasant as what they describe in the store. Credit did not post back to my account until you have to go afer them multiple times with multiple people and multiple trip to the store.", "rating": 2}, {"title": "It was just the service and aggrevating…", "text": "It was just the service and aggrevating as we paid $100 for delivery for a new mattress and it was defective so had to take pictures and get approval for another one in which we could not sleep in our bed for few days and next day did get approval to have replace defective mattress but it would be another 6 days before they could deliver or we could bring defective mattress in and pick up new one. We felt we had no choice as we wanted to sleep on our bed so husband had to take off work and load mattress and pick up new one. I recommend 100% the Breeopedic mattress they sell. They are Great!!! Just was frustrating we had to pick up since it was their defective mattress .", "rating": 2}, {"title": "The salesperson was trying to deal with…", "text": "The salesperson was trying to deal with and another couple. Even though they say they are not on commission she acted like it. Things were not explained as thoroughly as they should have been because she was in a rusht", "rating": 2}, {"title": "I was told by my sales person that I…", "text": "I was told by my sales person that I would receive free delivery because I’m a veteran. I looked at my ticket and was charged for the delivery. She told me to just mail the ticket in with the rebate form. What she didn’t tell me was I needed to purchase a minimum of 999.00 to get the free delivery. I would have just picked it up myself if I knew they were going to charge me. Guess I’m just another number to the sales team in Angelo. Lie to you or there just to inexperienced to know. She was flying threw the transaction so fast it’s a wonder she even got my order right. Not sure I’ll go back unless they make this right. All in all the couch is great just wish the San Angelo sales team was.", "rating": 2}, {"title": "I don't want to give bad reviews but I…", "text": "I don't want to give bad reviews but I have not had my issues resolved  after spending over $6,000+ cash with homezone and I'm not a happy customer and if it can't be resolved  I would like a refund.", "rating": 2}, {"title": "Please be clear when you are denied…", "text": "Please be clear when you are denied credit from Synchrony Bank and you rent to own with Acima credit. They take out your payments weekly---not monthly and you are in big trouble with you finances.", "rating": 2}, {"title": "Deliveryman didnt do anything", "text": "We got furniture deliverd today charged me 100 thay didnt even check if the mechanism work now we have a love seat that doesn't work and we have to wait for a technician to come out", "rating": 2}, {"title": "I filled out a claim a few days ago…", "text": "I filled out a claim a few days ago because 2 pieces were slightly damaged and I haven't heard back.", "rating": 2}, {"title": "Terrible", "text": "Experience with the sales lady that helped us choose what we wanted was great! Delivery guys were great. But the wrong pieces were ordered and when the delivery guys called customer service for us, I spoke with the lady and she was very rude. Felt like she was telling me it was my fault and I needed to drive all the way back to the store from Duncan to fix it myself. Ended up calling the store and the guy I spoke with told me he was putting an order in for the correct pieces. Then, delivery guys got here a week later and looked at the couch then checked the pieces in the truck and said the wrong pieces were ordered AGAIN. Said they were going to call the store to have the order placed correctly and haven’t heard from anyone since. This was over a week ago. I will never be going back.", "rating": 2}, {"title": "No Follow Through", "text": "Home Zone had the product that we were looking for. The associate that sold us our couch, was very knowledgeable, professional, and friendly. When we received our order, it was the wrong item (it was a loveseat instead of a couch.). The men that delivered our the loveseat were not wrong... I failed to check the receipt for a stock number, and our salesperson had entered the wrong item.We had to wait another week until we could have a new item brought to us, and the old wrong item taken away. If I was the CEO of this company, I would’ve hot shot the correct item the customer immediately. Almost no response from the management that I called, just “sorry will get to it when I can have it delivered.”I am still waiting for the corrected receipt for the item we purchased.", "rating": 2}, {"title": "great furniture customer service sucks", "text": "Great pieces of furniture but the table I ordered came broken and once I emailed the company as I was told to do by customer service over the phone I never received a call back or a email.", "rating": 2}, {"title": "Damage furniture and incorrect brackets…", "text": "Damage furniture and incorrect brackets to install the mirror.  Another technician came late with the correct brackets after two weeks, minus screws required, to install the mirror.", "rating": 2}, {"title": "The furniture is nice but my delivery…", "text": "The furniture is nice but my delivery experience and horrible. Horrible customer service on their part. Sad I spent so much money on a company that offers such poor quality delivery.", "rating": 2}, {"title": "Horrible policy", "text": "My day one salesman was amazing, he wrote the PO, day 2, he took payment, great! The rest was downhill. The person I called because I was left a message of delivery date( 5/27) between 11-3. I called back because I requested AM. I was on call after noon. She was rude! Telling me I was #5 and I didn’t get to pick my time. I called Abilene store and the manager (?) Daniel wasn’t helpful. The Regional manager wasn’t either! I almost cancelled my order! And would have but truck was loaded! Your delivery men were fantastic. But I won’t ever use you again. I paid for a service and to be told I can’t pick my time of delivery, that it’s assigned to me isn’t working for me! I paid extra for delivery and put together. Again, I won’t even consider using your business or recommending. My money, I get to pick date/time!", "rating": 2}, {"title": "Very poor service", "text": "Very poor service everybody just standing around and have absolutely no desire to help and when they do help it takes two or three of them to figure anything out", "rating": 2}, {"title": "What should’ve been an exciting…", "text": "What should’ve been an exciting experience was just a big let down... We patiently awaited  for our big new sectional to come in only to receive it damaged and missing pieces... When it arrived I knew there was something not quite right. I even told the delivery guys that we think we got the wrong couch & want to make sure it was correct peace.... they assured me it was Correct! After further unwrapping, It was obvious that we did indeed received the wrong couch So I immediately called the delivery guys to tell them but, they didn’t /wouldn't come back to pick up the wrong couch even though they were not even out of our subdivision yet... Which I found very upsetting because it was raining and now I had to deal with this big couch that I didn’t even order and I had to make room in our garage to store it until they come back to pick it up....  Very frustrating Experience!", "rating": 2}, {"title": "the lady kept walking off   trying to…", "text": "the lady kept walking off   trying to get all the custmers  that came in the store  we waited a long time  .  need to have more one on one time with there custmers", "rating": 2}, {"title": "Poor service", "text": "Poor service, I had to complain to get anything fixed. It was a chore to get anyone at the store to take me seriously. It did get fixed but not without a fight.", "rating": 2}, {"title": "I just feel like the product I was sold was inferior", "text": "I just feel like the product I was sold was inferior. The material on the arm of the chair split after only 18 mths.The staff tried to work with me but the repair would cost me half of what I paid for the chair", "rating": 2}, {"title": "Chair was broken so we’ll see how it…", "text": "Chair was broken when I received it, so we’ll see how it gets handled by customer services. If it goes well, will be happy to revise rating. Up to them now.", "rating": 2}, {"title": "We bought a new mattress and it had to…", "text": "We bought a new mattress and it had to be replaced because it would not do right so they brought another one and now we have to call them again and fix it.", "rating": 2}, {"title": "I was concerned about how slow the…", "text": "I was concerned about how slow the response was to an error made by your delivery staff and customer service was about as low as I have experienced.", "rating": 2}, {"title": "Delivery was on time and they were…", "text": "Delivery was on time and they were friendly but they did mess up a small spot on my couch and were gone before I really had a chance to look it over", "rating": 2}, {"title": "Trust Pilot (Compliment to Ms. Alyssa)", "text": "Ms. Alyssa helped me back in March of this year and Im really late sending this to/for her. I rec'd my Cedar Grove Chest as a Drop off DAMAGED and I was very outraged about it. Whomever Dropped it off DAMAGED, should have had the care enough to knock on my door and let me know it was damaged and that they were going to take it back and another one delivered. Didn't happen. I called in and was told the next delivery date would be the next Saturday, a week away, \"Oh NO..I can NOT wait that long\".  I spoke with someone else and it happened to be Ms. Alyssa and she calmed me down and got my Chest delivered that Wednesday, 3 March, well before 10 a.m. I was so HAPPY... Ya'll better keep her around, if she's not gone already, very polite young lady. Please let her know I wrote in finally.  She's probably upset for me taking so long... She is Customer Servicer for Real...Please let her know I said so.. Sincerely Mrs. Washington @Waxahachie TX", "rating": 2}, {"title": "Service is good", "text": "Service is good. The sectional is power and wont recline anymore and is less than a month old 2000 on a sectional I expect it to work for a while", "rating": 2}, {"title": "Home zone lost one of their good customer", "text": "I spend 3,290.80 on a bed and a mattress at home zone a month ago. I was supposed to be delivered two weeks after the purchase because we wanted to do that on our day off. It took a month and a half for them to deliver the bed and the mattress. In the mid time I already pay the bill for something I did not receive yet. Nobody called to say sorry your purchase will be late. Everytime we called they gave us a different date. Today they brought the bed in \"half\" because it is missing some parts. And the mattress that the employee advertised to be a good one with an adjustable metal base that he did not mention is not comfortable. I have to wait for another week or two to return that metal base that is not comfortable. The manager I talked to today said he is not sure if that metal base can be returned. Like seriously for someone who spent that much money to be talk to without a sorry is a shame. I am never going to that place again!! Bad customer service!! I am very pissed off", "rating": 2}, {"title": "Delivery/customer service", "text": "I just received My furniture delivery via Doorstep drop off the sofa was fine the loveseat Was wrapped in plastic with holes and completely assembled.I called customer service with my concerns with loveseat packaging, and was advised that was normal. And to reach out to the store where I purchased I called the store and was advised to contact customer service. I am extremely unhappy that I received merchandise out of the packaging and requested a new loveseat to be sent out in a box so I could store it properly and be assured that it’s new unused contaminated furniture. If this can’t be done I will be returning the furniture and shopping elsewhere. I’m Waiting on a return phone call the manager wouldn’t even get on the phone to speak with me just told the associate To tell me to contact customer service again. This is the Arlington Texas location......UPDATE.....The general manager Micah has assisted me with my issues,and it has been resolved. Thanks Micah!", "rating": 2}, {"title": "Additional charges for their product replacement", "text": "Couch had a problem and even thou they fixed it I had to pay additional money to have them pick it up and drop it back off. So wrong.", "rating": 2}, {"title": "Bought over a 1,000 mattress", "text": "Bought over a 1,000 mattress! Had it one week and it came apart at the handles while moving it! They said there was nothing they could do!", "rating": 2}, {"title": "My mattress was a week late", "text": "My mattress was a week late, because they loaded on their truck/attempted to deliver a king mattress (which I didn’t order... I ordered a queen) and my queen adjustable base. As a result I slept on my couch for a week. I have a herniated disk in my back, so that was not ok (My hurt back was the whole reason I got a new mattress to begin with). There was little to no communication regarding the initial delivery of my mattress/and redelivery of my mattress. All communication about the delivery were initiated by me, the customer, after the mattress wasn’t delivered. It should have been the other way around. They even tried to schedule a delivery for a day and time without my approval. I received an email about it, not even a phone call. And I had to call them back about canceling the appointment I didn’t make, and arrange a new time. The only reason I’m giving any stars is that the mattress is amazing, and when the mattress was finally delivered, the delivery men were friendly and AWESOME 👏!", "rating": 2}, {"title": "I purchased 3 bar stools which were…", "text": "I purchased 3 bar stools which were delivered on time, the only problem was that one of the stools was damaged and have to be returned.", "rating": 2}, {"title": "Worst experience", "text": "First they gave me the wrong couches, then when the new couches came in they didnt hook up the love seat right, (it wouldnt recline) had to wait a week for someone to come and look at it to fix it. He was in and out less then 5 minutes, (he said they hooked up the cables wrong) i was waiting for a refund check and when it finally came in they called me to pick it up and i was at work so i asked if my wife would be able to pick it up for me and they said yes no problem. My wife shows up to pick it up and they start giving her a hard time saying she couldnt pick it up whenever the person on the phone said she would be able to. They said i would have to be there or she would need my ID, they did not say that over the phone. They need better communication because i had to stop what i was doing at work just to send my wife a picture of my id. They are nice to people before you buy from them but once you purchase something their whole attitude changes. I will never buy anything from them again. They lost my business", "rating": 2}, {"title": "Nice Sectional; Dishonest Salesman", "text": "Antonio was very friendly during the process of buying a new sectional. The product that was delivered is everything we were hoping for. The reason our experience was so bad is because we were not thoroughly informed about the financing option we selected, which turned out to be a lease-to-own plan. We purchased the sectional when it was on sale for over $600 off. He assured us that if we paid off the purchase within 90 days, we wouldn’t have any additional fees. LIES! The fees associated with the 90 day lease to own option put the total amount spent on the sofa higher than the price of the sofa before it was on sale!! AND I had to call to set up the 90 day option. The 12 month, 26 payment option I was originally given had the total amount spent price over $5000!! The sale price was $1800! He was very deceiving when it came to what we would be spending and pushed us to sign the “lease.” I saw signs saying their salesman do not get commission, so I was very disappointed that I felt played and taken advantage of.", "rating": 2}, {"title": "Delivery crew and post-purchase customer service are subpar", "text": "First of all, everything (selection, showroom staff, etc.) was five-star until the delivery.The delivery:It was obvious the delivery people were having a hard time assembling the base of my dining room table. They worked on it for awhile and still couldn’t get the bolts to go in or get the base to fit snugly against the table. I guess they gave up because they flipped the table upright, told me to enjoy my furniture and left. As they were leaving, one of the guys pulled out a Sharpie and proceeded to mark on one of the dining room chairs. Upon inspection, it was to cover up a cosmetic defect. He said nothing! They knowingly assembled my table incorrectly, and in doing so damaged it (stripped bolts, missing hardware) and tried to cover up damaged merchandise. I called to let Home Zone know and I was told a technician could come to inspect in two weeks. I am now forced to use a wobbly table until the technician comes to inspect/reassemble/repair it or recommend replacement. Unsatisfactory!", "rating": 2}, {"title": "Double disaster!", "text": "Last year my daughter had a wonderful experience shopping for a new bedroom set at the Home Zone in Weatherford, so when I needed a new dresser, she suggested buying from HZF online.  I ordered a Jareth Dresser, SKU DRJCJAR.  At the time, I thought that the online measurements seemed odd in comparison to the picture, especially claiming a height of 60 in. with a width of 42 in.  But that error--which still exists on the website--was nothing compared to the disaster that was delivered!Indeed, 60 in. is the width, and the dresser was shipped standing on its side!Two of the Kenlin glides failed and broke and the top warped up from the body.  I had to pay someone to fix the drawers, but cannot fix the top, leaving me to live with the clearly arched surface. In the era of covid-19, I recommend still shopping at the stores.  And if nothing else, be sure you are NOT the 13th scheduled delivery for the day!! BTW, the deliverymen were excellent, but the problems could not be seen or discovered before they left.", "rating": 2}, {"title": "Correct address was never changed in…", "text": "Correct address was never changed in computer system so half the couch was going to one address and half to the correct address", "rating": 2}, {"title": "One star because affordable, one because its cheap", "text": "This our 3rd purchase from Home Zone and it will be the last. We purchased a coffee table and two box springs. Carrying in a twin box spring my son bumped the corner of the \"wooden\" table top and it split. It was particle board only the interior of the drawers were hard wood. We purchased a living room suit and the warranty, one of the legs supports did not have the pre drilled holes. We called about warranty and they said they would cover it if we sent the entire couch back. A month in the seams on the couch cushions started to unravel. We called because ya know, warranty. They sent a guy out with a needle and brown thread to stitch them up. From the outside, he did not remove the covers and sew them. We called about that and they said he would receive better training. We didn't have a backup couch to use the three weeks it would be gone so we did not send it back. Finally we bought a bed. No issues so far (it's been a week) but, we did have to make three trips to pick it up. Each time the told us it was ready it actually wasn't.", "rating": 2}, {"title": "The terminal for phone jack on the side…", "text": "The terminal for phone jack on the side of the chair not working. But they will replace the chair in a week. Long wait.", "rating": 2}, {"title": "My furniture came broken and I realized…", "text": "My furniture came broken and I realized it after they left. I contacted dispatch but no one ever returned my phone call.", "rating": 2}, {"title": "The footer on the bed was broken when…", "text": "The footer on the bed was broken when delivered, over a week ago, and we are still waiting for them to fix it.", "rating": 2}, {"title": "The younge lady that helped me was…", "text": "The younge lady that helped me was great. The manager called my daughter spoiled because of the furniture I was buying. Spoke to General manager he was very nice, couldn't believe the manager would say such a thing. Offered me 100.00 off said that's all he could do. I should of never bought from them! My furniture gets delivered and something has been wrong with the furniture, I send it back for a replacement and the replacement has something wrong with it. I give up.I am not satisfied I feel It would be quality furniture since I am paying alittle over 3,000$  but nope the furniture looks like its just been refurbished.. its not painted right. I am tired of sending furniture back and receiving it in worst condition then I sent back. Let alone The dresser Icame with a messed up drawer and scratches on it. I just tired of dealing with it. I should of done research on the Internet Instead of going to all the different store in town to buy. Yes the will keep replacing the furniture but its just tiring dealing with it. They come in your house to deliver and don't wear mask. And even tell you where you should of bought from.", "rating": 2}, {"title": "Information and Delivery Problems", "text": "Bought 4 pieces of furniture (cash) in September from Home Zone, Abilene Texas.  Two pieces were received the following week as were promised.  Was told by the Abilene store manager that the third piece of furniture would be delivered to the store, inspected then delivered to my home by the end of September. The store manager explained that the fourth piece of furniture was back ordered and will not be received at the Abilene Home Zone until December, we agreed to wait for 4th piece.  It is now October, Home Zone has my cash payment for furniture, the piece of furniture promised at the end of September is still not delivered and I received a text and email that said I may have to wait until January for last piece of furniture and am unsure if that message also includes the receipt of the 3rd piece of furniture.  This is without doubt the worst buying experience I have ever had.  I am not sure if it is the fault of Home Zone or the Abilene store manager in an attempt to make sales and not providing enough information to the buyer for the buyer to make the best decision for them. At this time I do not know if or when I will received the remainder of my furniture. I am very disappointed.", "rating": 2}, {"title": "We paid $99 for a moving fee when my…", "text": "We paid $99 for a moving fee when my boyfriend helped unload and bring the couches upstairs to our apartment", "rating": 2}, {"title": "Unhappy with a mattress purchase no…", "text": "Unhappy with a mattress purchase no options given to better the unhappiness.  Headboard and footboard amazing.", "rating": 2}, {"title": "Return to sender", "text": "1 item was preassembled and 1 item was in a box (why?).  The assembled item was scratched in 2 places.", "rating": 2}, {"title": "099453373", "text": "May I leave a review?  The last on was taken down. I am waiting on 2 claims.Disappointed 😞", "rating": 2}, {"title": "The delivery people did not finish…", "text": "The delivery people did not finish assembling the items properly and had to be called back to the house", "rating": 2}, {"title": "Quantity not Quality get Warranty", "text": "We've spent so much money in the past but this last time was the worst it started with a few thousand dollar order on a sectional that literally lasted about 6 months before falling apart. They said they didn't want to fix the problems that we could just pick another sectional  and pointed us to one they said was better quality but we had to pay a few hundred dollars more to get it delivered. We've now had this balboa sectional about 5 months and now we're having to put blankets under the seat cushions for extra support cause the support structure in the couch is faulty and must be cheaply made even though the sectional is priced pushing a couple thousand with the added pieces we purchased. We did purchase the platinum protection plan which covers everything but that means no furniture for months. What a pain this has been. We literally would have continued to buy all our furniture forever through HZ. It seems like something happened with the quality a few years back and they've never cared to recover. Now we have brand new furniture that we have to stuff to make comfortable does that make since? Just be careful and get the warranty cause you'll need it cause there's no quality just looks pretty.", "rating": 2}, {"title": "I initially ordered my chair online", "text": "I initially ordered my chair online. I called the next week as I had gotten no email updates on when the chair would be coming in. When I called I told the gentleman I had placed an order online for a chair and he interrupted me and said the shipments come in on the weekends. I said ok, well can I just wanted to make sure my order was received and it’s on file, the gentleman said yeah shipments come in on the weekends. I then told him my name and asked him to look up my order and he said yeah we got it, that was it. The next Saturday I called and said I had ordered a chair and was checking on it. A lady told me they had a shipment come in but offered no other assistance. I said ok, well can you check and see if my item came in, then she asked my phone number and looked it up and I was told it came in. I was told I could pick it up Sunday 12-5. I had knee surgery so I called Sunday and asked if my mother could pick it up and they told me yes. My mother picked up the chair and it was loaded for her. She then went to Walmart to pick up my groceries and when she opened the door for the lady to put in groceries she saw the chair was broken. She then called me and I called and spoke with James, informed him of everything above and he stated she could come back and he would build a new one for her.", "rating": 2}, {"title": "Salesperson didn't listen wrote up…", "text": "Salesperson didn't listen wrote up wrong bed. Two hours later and double the price....", "rating": 2}, {"title": "Broken piece on dresser found after…", "text": "Broken piece on dresser found after they left. Movers rush for me to sign paper and left", "rating": 2}, {"title": "Quality of furniture not great only had…", "text": "Quality of furniture not great only had furniture two day n dust cover have to be fixs", "rating": 2}, {"title": "I have not been contacted on my…", "text": "I have not been contacted on my replacement chairs, and it’s been several months.", "rating": 2}, {"title": "Poor Quality-Incomplete Manufacturing-Get Warranty", "text": "On delivery day, Saturday, we were supposed to receive two of the same item (recliner sofas) but only received one and it was not in the original packaging, appeared to be used, and had a tear on the back of the arm. Customer service was pleasant and agreed to replace the one used sofa and bring the second sofa on Monday. Unfortunately a day of work had to be missed in order to home there to receive the sofas. The biggest problem now is that one of the sofa's back frame/cushion is leaning and pops when it reclines. Unfortunately,  I will have to use the warranty within a week of having the sofas. Also, neither sofas had all of the wires hooked up. The unhooked wires were different for each sofa so we knew that the manufacturing was incomplete and steps were missed. We had to turn them over and hook the various fuses.  The only saving grace is that the HZ customer service was easy to work with for the delivery/exchange. Hopefully, the service will be the same or better when I file a claim using my warranty for the broken recliner.Also, the first set of delivery guys were horrible and did not care. They kept dropping the sofa while trying to force it through the door and cut the box open with a knife.The second set of delivery guys were professional and took care to deliver both sofas. This was our first time using Home Zone. I am not sure if I will be a return customer.  It depends on if the warranty is all it's touted to be. We'll see; fingers crossed.", "rating": 2}, {"title": "Are sales guy was so pleasant to work…", "text": "Are sales guy was so pleasant to work with & everyone was so nice!", "rating": 2}, {"title": "Did not like the service and they lied…", "text": "Did not like the service and they lied to me well not shop there again", "rating": 2}, {"title": "Delivery", "text": "Delivery was a disaster", "rating": 2}, {"title": "The salesman didn't know his furniture", "text": "The salesman didn't know his furniture. Don't like my bed!!", "rating": 2}, {"title": "Was treated good when buying but not…", "text": "Was treated good when buying but not when picking my furniture.", "rating": 2}, {"title": "Not happy", "text": "Well, where do I start? OK, I originally ordered a different sofa and then after paying for it I received a call stating that it would be another two weeks before I could get that sofa because they didn’t have the chase  on the side that I wanted. I was fine with that, and then I went into the store to look for a kitchen table a week later and just happen to go to the desk and ask them how much longer it would be on my sofa. I was then informed that it wouldn’t be available until the middle of December. Wow never received a call about that one. So I canceled that order and proceeded with shopping for a Nother sofa in your wonderful store. OK I found one just a little less. Then when it was delivered the delivery men damaged it. So now I’m having to wait till this Saturday when I had plans. And now they’re going to swap it out. Well that’s very nice of them but this sure has been a big inconvenience. Also when they brought the pillows in they were not in protective plastic. The delivery trucks are full of dust and of course there were several pillows that were just covered in dirt/dust. Now, I’m not an expert but I do have some common sense. If you are running a business you would think you would deliver your product a little better. I was told that I could have my delivery money back. Of course when I went up there again come back in a couple days and we can process that for you. At this point I don’t even want to mess with it anymore. Poor business, you need to realize there are other furniture outlets in San Angelo and if you don’t do your business better you’re going out of business.", "rating": 2}, {"title": "The couch I bought has a crack on the…", "text": "The couch I bought has a crack on the front inside panel .", "rating": 2}, {"title": "Amazing service", "text": "Amazing service ", "rating": 2}, {"title": "Still don't have all my stuff", "text": "Still don't have all my stuff. And Three week later.", "rating": 2}, {"title": "Not timely", "text": "Don’t deliver when promised and don’t put together well.", "rating": 2}, {"title": "The delivery was not handled well at…", "text": "The delivery was not handled well at all by management.", "rating": 2}, {"title": "Bought 1800 couch and it has no…", "text": "Bought 1800 couch and it has no firmness. Poor quilty.", "rating": 2}, {"title": "One of the drawers doesn’t close all…", "text": "One of the drawers doesn’t close all the way ...", "rating": 2}, {"title": "The table is messed up parts missing…", "text": "The table is messed up parts missing and broken", "rating": 2}, {"title": "Poor Communication", "text": "Well first of all when I spoke with Erika Rojo who sold me the chair I asked her \"Now is everything going to be ok considering you all are delivering on the July the 4th?\" She said \"Yes everything should be ok.\" I could have chose another date, however my father needed this chair as soon as possible due to his current diagnosis. I was first told that the window would be between 8am until 5pm which I thought was strange. I decided to call a few days ahead of time and then I was told between 4:30pm and 8:00pm which is still late for a holiday but ok. Well at 3:10 I receive a text saying \"We're around the corner from your resident.\" Well from there I called the store and told them about the time that was told to me and the sales person said they would call the driver's and then call me back. I did receive a call back with no clarity regarding the correct time. She said \"There close by.\" What does that mean if the 4:30pm time is not being honored. Well the driver's pulled up right at 3:50pm and called me a few times wanting to know where I was, I told them I'm on my way (NOT wanting them to leave with the chair) they waited and I pulled up at 4:00 because at this point I just want to get the chair and be done with it. I would suggest in the future that if your going to have your drivers work on a holiday and if other customers have canceled their delivers then the drives still need to honor the time stated or contact the customer letting them know if it's possible to come a little early than scheduled. You all's communication needs to be addressed to insure that each and every customer has been satisfied from start to finish. Please do better and with all of the statements on the paperwork you all should have a line where it say's what time to expect the delivery but I know from now on don't schedule on a Holiday! Very Poor Communication", "rating": 2}, {"title": "service was excellent and very…", "text": "service was excellent and very professional", "rating": 2}, {"title": "salesman wrote up the wrong bedroom set.", "text": "Date of experience: March 08, 2021", "rating": 2}, {"title": "Did not set up my payments correctly....", "text": "Date of experience: April 17, 2020", "rating": 2}, {"title": "Had a few issues wich were inconvenient", "text": "Date of experience: October 09, 2020", "rating": 2}, {"title": "Boom rush you at the door", "text": "Boom rush you at the door; to pushful", "rating": 2}, {"title": "Screws and instructions were missing", "text": "Date of experience: April 24, 2020", "rating": 2}, {"title": "Lucky to Get Two Stars", "text": "I have made a few furniture purchases from Home Zone and the only issue I have had before in the past is with their delivery service. I purchased an bed that was exactly the way it was on the floor. I asked the sales rep multiples if everything would come as shown on the floor because I was having to swap out the base shown on the show room floor because they no longer carried it. (no idea why it was on the sales floor as a display of it was actually for sale). I was reassured that it would come how it looks, but with a different base that functioned the exact same way as the floor model. We made the purchase and paid to have it delivered. We live out of town so the delivery fee was understandable and came with full set up of the bed set. The 4 hour delivery time is never fun waiting around but they were 30 minutes late. I called to check to see if they were coming or needed to reschedule and they said they’d be at the house in 10 minutes. They were. But rushed setting the bed set up and didn’t put it together fully. One of the delivery guys handed me the adjusters for the bed legs and told me to ask a “male friend” to help me put them on because they were behind schedule. They didn't deliver The rails that run along the bottom of the bed and it look liked a hospital bed was in my room. After calling the store, being shuffled to customer service, given the number to the delivery service and sent back to call the store I found out the sales rep was wrong and the floor demo was not how it comes. I was told I could t return the merchandise but could exchange it if I wanted. I returned the entire set up purchased a completely different  bedroom set and upgraded to the  mattress I didn’t want to originally purchase because of the price and got it all for the same price as what I paid for the hospital looking bed. The delivery service delivered, broke down the first bed set and set up the new one and took the returned set back to the store without charging me a return, pick up fee or new delivery fee. As I said at the beginning I’ve had a good Expy with the furniture. It’s the customer service and lack of knowledge that would deter my from shopping here in the future.", "rating": 2}, {"title": "Disastrous & ridiculous delivery process!", "text": "Not one single person that is part of the delivery process has done their job correctly! I needed to reschedule delivery because it was raining and I live on a dirt road. Didn’t want big ruts in my road or for them to get stuck. I was told by Marina my delivery was canceled and someone would call the next morning to reschedule. Why couldn’t I reschedule immediately? Then they showed up in the rain saying they didn’t get the message that delivery was canceled so no communication between employees. They left big ruts in my road and got stuck, leaving Huge ruts! When they unloaded my couch they didn’t watch where they were going & knocked over a chair, stumbled over my coffee table dropping the couch which broke a lamp & scratched my table. They didn’t say anything & I was so shocked that I didn’t think to look for damages until they had left. Then they got stuck which infuriated me so I called management. Spoke with Alyssa. She apologized but then popped off advising me to just sit back on my new couch and watch them get unstuck. I think this was unprofessional and made me feel she wasn’t taking me seriously. In the meantime I discovered the broken lamp & scratched table and called back. Left a message with Jessica. I was told management was unavailable but they’d call me back. I waited for hours but no return call until I sent an email complaining of this ridiculous delivery. She finally called back at almost 8:00 pm apologizing again stating she didn’t get the message to call so more lack of communication between employees. When I asked the delivery guy about my broken lamp- they were still here stuck on my property- he said he didn’t notice damage but I told him I find that hard to believe since he picked it up & put it back on the table. It’s clearly broken & you’d have to be blind not to notice. He said’ok’ & shut the truck door in my face! When Alyssa called at 7:55 pm she did offer to waive the delivery fee but I have to go to the store to get it. Why? Everything is automated so why should I have to drive almost 20 miles? This whole process has been ridiculous & I am Very Unhappy!!! I will certainly NOT recommend this store!!", "rating": 2}, {"title": "I talked with Andy a week prior to…", "text": "I talked with Andy a week prior to attempting to purchase a dinning set. I was given a specific price and an additional delivery and set up fee. I went into the store and was given a different price that was more. After having to pull up phone records because I was told by a female manager that the price couldn't be changed she later gave me the price quoted which was also on a sales paper that was delivered by mail originally. I decided to make the purchase and was given a delivery date. The gentlemen delivered my dinning set, already assembled pretty much and rushed out in a hurry. As I begin to look and observe my set to make sure everything was as described, I noticed  that one of my chairs was leaning. I begin to flip each chair over to screw in all of the pegs to the chairs that was not in tact nor screwed in. (Part of assembly that I was charged for). I immediately rushed to stop the delivery men to inform them of missing item. I had already flipped all chairs to screw in all other pegs. He returned with a peg that DID NOT go to the chair, that DID NOT fit at all, but was forced and made my chair uneven because it was longer and wider than the missing part. I reported the issue and days later still have not been able to allow my family to sit at the table in that chair to prevent further damage or breakage. I'm not satisfied with the wait that its taken for something that should've been a small fix. I also was told that the delivery and setup was needed due to  the type of table I purchased to ensure proper assembly after I denied multiple times. It was just to add additional unnecessary fees for commission because I could have easily had it assembled and even assembled myself after observing the pieces, to still have to wait for the completion of my order to be fixed properly. My frustration is the fact that the gentlemen knew that he brought in a piece that did not go to my table and just stuck it in my chair without giving me the option to wait until he returned with the right part or giving him permission to put the oversized part in that possible stripped the original screw pattern of the smaller piece, and the rush job and not making sure that the job was completed correctly prior to rushing out to the next customer. I did talk with a manager that is reportedly working on the issue, but have not had an update.", "rating": 2}, {"title": "From great to awful", "text": "Our experience started out absolutely wonderful! Our salesman was very friendly and not at all pushy. The manager stopped by during our purchase process and said hi. Great customer service from both. Our salesman offered my 5 year old daughter ice cream, and she was very happy! However the rest was a disaster! The furniture was delivered to us only two days after purchasing and we were so excited! When the delivery guys arrived, one was very polite and friendly while the other was very rude. They began setting everything up and that is when my heart began to sank. EVERY piece of furniture we received except the 2 bed storage drawers had damage and/or defects! They took back the headboard, footboard, and dresser mirror because of damage seen immediately. They left very quickly and as we continues to look at the furniture, we saw all the defects and damage on both nightstands, on the dresser, and the bed slats were even broken! We immediately went to the store and explained the situation to one of the managers. We explained the poor quality and finish on the furniture. We showed them pictures and emailed them to him as he requested. He called the warehouse and the lady told him she would contact me the following morning to setup a new delivery date to replace everything. This was a Wednesday, and she said she could guarantee we’d have all new furniture by Saturday at the latest! Thursday nothing. Friday by 1pm, nothing! We called and said to just cancel our order and that we wanted a full refund. We asked for them to come pick up the remaining furniture. They scheduled for the following Tuesday. Tuesday came and yet again they messed up.. they were bringing the replacements for the mirror, headboard, and footboard! We declined them and called to speak to a manager yet again. He apologized and rescheduled once again, this time for Friday. Friday came and they FINALLY picked up the remaining furniture from our home, and by the next morning we received an email stating we were refunded for our purchase. What a truly awful experience we had! The quality is horrendous for the price. We went to Haverty’s and had an AMAZING experience from beginning to end! Received everything correctly and damage free. Quality of furniture didn’t even compare to the HomeZone quality. And we only paid $300 more for the new set, same amount of pieces!!! I don’t recommend HomeZone to anyone.", "rating": 2}, {"title": "Bad customer service", "text": "Date of experience: September 16, 2020", "rating": 2}, {"title": "Delivery experience leaves us wondering...", "text": "This was our first visit to Home Zone in Burleson.  In the past, we purchased furniture from Rooms to Go and Ashley, but we wanted to check this place out.Pro - furniture looks nice.  We liked the look of almost everything in the store, making it difficult to choose.  They have a variety of styles, and not all \"feel\" the same.  Some are more firm; some more soft.  Sales person was incredible.  Very patient and answered a lot of questions.Cons - Delivery options: free delivery for porch drop off or $150 for them to deliver and assemble.  This is a bit much, to me.  I believe our delivery fees have been anywhere from free to $99.  Delivery Date 1:  We chose the free delivery; didn't feel like we needed help putting a recliner together.  When the piece arrived, it was dropped off and the drivers left.  The very first part of the packaging we removed revealed a screw sticking out of the recliner!  We immediately called customer support to have it addressed.Customer Support: Stated that they couldn't schedule a replacement until the next day, because our order was in \"delivery\" status and wouldn't change until the next day.  On the next day, I called and they scheduled a new delivery for the next Saturday.Delivery Date 2:  Our time frame for receiving the chair was 9:30 to 1:30.  At 1:20, we still had heard nothing, so I called customer support.  They said they had to cancel the delivery due to inclimate weather.  First, I'm all for the safety of the drivers, and the weather WAS getting bad.  However, the company should have called us and told us rather than waiting for me to call them at the END of our delivery window.  The customer support person simply could not understand this absolute failure in CUSTOMER SERVICE, and simply apologized that the delivery was delayed.  About 20 minutes later, we received a call to notify us our order would be cancelled due to weather.  They don't even communicate with each other!  I expressed my frustration, and told them that we were seriously considering cancelling the order all together and finding a recliner somewhere else.  They called back about 2 hours later and said that the roads had cleared and they would deliver the chair.  I insisted they deliver and assemble to inspect the chair for issues and they did.In summary, our confidence in the quality of this chair is low.  It is inexcusablefor a company to allow a piece of furniture to leave the factory much less enter a home with a screw sticking out of the side of the furniture.  Whatever the assembly process is that allowed this to happen in the first place concerns us.  We agree that we won't purchase furniture at Home Zone again; at least not until we see this piece can stand the test of time.", "rating": 2}, {"title": "Misinformation", "text": "Date of experience: July 13, 2023", "rating": 2}, {"title": "So many issues with my purchase and delivery.", "text": "So many issues with time, equipment and service. Home Zone started out bad when I was called 5 minutes after I left the store after purchasing my bedroom set. I was told the adjustable part one my bed would fix my choice of bed that I purchased, but aI got a call informing me that I was told the wrong information and yes the was resolved. Delivery was another problem with resulted in the manager getting involved to ensure a smoorh process until all was settled with my delivery. I am just disappointed with it being my first time at Home Zone.", "rating": 2}, {"title": "Disappointed", "text": "I'm happy with the furniture. I am very unhappy that just days after I purchased almost $3000 worth of furniture, I learned that there was a sale for veteran's day giving free delivery to veterans. I've been in the US Army for 14 years now and I was very disappointed the store here in San Angelo couldn't adjust my order and offer me the refund for the delivery charge.", "rating": 2}, {"title": "From fantastic sales personnel to…", "text": "From fantastic sales personnel to delivery and setup. My wife and I had a great experience with HomeZone. We purchased every single piece of our furniture from Home zone. Our living room both our kids bedrooms and master. Great furniture ..good all the way around thank you home zone", "rating": 2}, {"title": "Not satisfied with my second purchase", "text": "Not satisfied with my second purchase 1. The associate asked me to use a different credit card than the first one I already had in record because apparently they didn’t accepted , but I called to verify and there’s was no problem. 2. I never got a call or text confirming my furniture was ready to pick up instead I had to call customer service and verify.", "rating": 2}, {"title": "None of items I had purchased were in…", "text": "None of items I had purchased were in stock.  Waited three weeks for delivery and was notified that all my orders were either damaged or broke upon delivery to your store.   This is very frustrating and a let down by your company.", "rating": 2}, {"title": "We got the Bedford bedroom set and it…", "text": "We got the Bedford bedroom set and it came up with a lot of finishing defects for which I had to call the service department and they fixed it with a spray paint which was not even the original color. The king bed is surprisingly long which leaves a gap of 5” after the mattress and for which I have already received an unsatisfactory explanation. There is no return policy even if things are delivered with defects .", "rating": 2}, {"title": "After spending over $4,000 when I…", "text": "After spending over $4,000 when I received my delivery it was missing two power cords for the sofa recliners. When my wife went to the point of purchase (Cooper St. In Arlington, Texas) the manager was somewhat dismissive and told her she would need to the call customer service number on our receipt. The problem was that there was no customer service number on the receipt. In addition, the love seat recliner was not assembled correctly. I'm not a happy customer and would have to second guess whether I would return to this store.", "rating": 2}, {"title": "Wrong information given three times", "text": "Wrong information given three times, and false advertising. No one knew what what going on.", "rating": 2}, {"title": "Went from pick it up today", "text": "Went from pick it up today, to tomorrow, to 2 months from now. This was after I paid.", "rating": 2}, {"title": "I HAD ORDERED A REPLACEMENT CHAIR TO…", "text": "I HAD ORDERED A REPLACEMENT CHAIR TO COVER THE ONE CHAIR THAT WAS BROKEN WHEN I PURCHASED IT.  NO ONE CALLED ME FROM THE STORE TO LET ME KNOW THAT THE CHAIR HAD BEEN IN.  POOR CUSTOMER SERVICE AND THE THE GENTLEMAN THAT HANDLED THE SITUATION WOULD NOT GIVE ME ANY INFORMATION ON HOW LONG THEY HAD THE CHAIR.  ALSO STILL WAITING ON A REPAIRMAN FROM A LIVING ROOM SET THAT I HAD PURCHASED AND NEVER USED THE WARRANTY  THEY TOLD ME I WOULD RECEIVE A CREDIT FOR NOT USING IT AND TO DATE NO ONE HAS CALLED ME TO LET ME KNOW THAT THEY LOCATED A FURNITURE REPAIRMAN TO ASSIST ME OR HOW MUCH CREDIT I WOULD RECEIVE. STILL POOR SERVICE.  I GUESS I HAVE TO BUG THEM TO GET ANY HELP.", "rating": 2}, {"title": "Terrible delivery", "text": "Terrible delivery! Delivered wrong pieces, only half of pieces. In store service was great, after that not a fan", "rating": 2}, {"title": "Furniture received damaged", "text": "Furniture received damaged. Pending replacement on dining room table. Effective today 10/04/2019 pending response for repairs or replacement 6 drawer set.  Received with Broken trim on the bottom corner of set.  Not happy with purchase.", "rating": 2}, {"title": "Buyers Beware!", "text": "I purchased a table a chair set on September 2, 2019.  On September 14, 2019 Home Zone delivered a damaged and poorly crafted table. Three deliveries later and I have yet to receive a new and undamaged table. Now I'm faced with a 4th delivery. At thus point, i just want a full refund! The customer service is fair but the company is selling damaged and inferior furniture!", "rating": 2}, {"title": "Manager is not very good at handling…", "text": "Manager is not very good at handling customer issues and unpleasant.", "rating": 2}, {"title": "Update 06 October", "text": "On day of purchase we were told we had option of furniture being delivered on Wednesday for $99 or we could pick up on Saturday. We chose to pick up but no one contacted us on Saturday so we called to see if furniture was ready. They said no and now informed us for the first time it takes 7-10 business days for furniture to arrive at store. Since I had to have medical procedure we decided to pay the $99 for delivery. They said the earliest would be Sep. 25 but we will be out of town that day so now we have to wait until Oct. 1 (total of 17 days since purchase). :(UPDATE: Home Zone called me to set up delivery and informed me that the furniture was at the store even though when my wife came in to set up delivery she was told it was not. We had no choice but to have delivered on 01 October, however the manager took $50 off delivery charge and we are very happy with our dining room set, delivery and assembly. Although initial experience was bumpy we would shop there again and recommend Home Zone to others.", "rating": 2}, {"title": "I went to 2 different locations very…", "text": "I went to 2 different locations very excited to order a new livingroom set. The first location in Rishardson was VERY helpful and informative. The second location in Mesquite was no so helpful. I had to look for someone to help me and then when I decided on a furniture set I really loved and paid in full for, they decided to tell me that I couldn't get it until October. I am very disappointed and regret ever going to the Mesquite location. They asked me to sign paperwork saying I received information on warranty plan (when nobody told me about them) and I felt so rushed. I am really contemplating getting my $1,200 I spent in the store.", "rating": 2}, {"title": "I was very displeased with the delivery services I received.", "text": "I was very displeased with the third party delivery services that Home Zone Furniture used for my furniture delivery. After giving directions to the driver and other person, they stated they couldn't find my address after I texted the information to them. After several times of trying to get them to our address, the driver hung up on me and told that my furniture would have to be taken back to the warehouse and another date would need to be rescheduled.  I was at that point going to cancel my furniture order if it was returned.   I then spoke to Nathan regarding a better address to help them find my address and was until after an hour or so my furniture was delivered.  I paid a delivery charge which I feel was too much after all the efforts of trying to get them to my address.", "rating": 2}, {"title": "Was so excited to get my new couches", "text": "Was so excited to get my new couches, and one was damaged when we got there. They ordered another and won’t be here for another week. We have already went 1 week without somewhere to sit at home, and now we will be going another week. Super disappointed we weren’t offered anything for the mess up they had.", "rating": 2}, {"title": "Exclusive Invitation", "text": "I was a repeat customer who had received an email offering a discount on my next visit.  Talking about private invitation with an exclusive offer.   I went in and found some furniture that I wanted and set things up with the rep.  I completely forgot about the email until I was leaving, and walked past an employee who was trying to get the commitment from a customer that was on the fence about buying.  The rep came by the desk and asked for the coupon to give to him to get him to buy.  That’s when I remembered that I was due that same discount but it was too late because the financing had already been set up.", "rating": 2}, {"title": "Stay far away", "text": "Home zone staff was rude and inefficient.  Also did not deliver all items with purchase.", "rating": 2}, {"title": "I was not pleased with the new dresser…", "text": "I was not pleased with the new dresser I purchased. The wood for the mirror was rotten. They sent someone to replace it but they put a black piece of wood on a white dresser and I havent had no one to come out to replace it so far.", "rating": 2}, {"title": "Selected and paid for furniture that…", "text": "Selected and paid for furniture that was to be delivered by August 30,02019.  Some of the pieces were not in stock which made the delivery one month from the date of purchase.  We agreed to that.  I have since been called and informed it might take longer.  If there is no chance then Home Zone needs to be up front and say so.  First and foremost they should not have on the floor displays and tags for things they cannot get.  If I could get accurate information I could perhaps make another selection or at the very least get my money back.  No response yet from the company who promises they read all feedback.  On a positive note our salesperson Jacob has been very nice and pleasant to work with.", "rating": 2}, {"title": "I love my sectional that I purchased", "text": "I love my sectional that I purchased. It just really sucks that the delivery guys chipped off a 3 inch round whole on my shertrock corner. And scratched my front door!!!!!!!!!!! Did not realize it until after they were gone!!!!!!", "rating": 2}, {"title": "Our experience in the store was very…", "text": "Our experience in the store was very good. The delivery thereafter was the problem. The table and chairs were delivered on a Monday. The table top was damaged in two places. The driver took pictures right away to send in, and said a tech would come and fix it. But when I called HZ the lady said they should have brought it back with them. So she had them come back and pick it up. Rescheduled a new table for that Wednesday. When they came back, they only had the top, thinking the legs had been left. Left the top. Came back Thursday and assembled it finally. All that said- there is a lack of communication between HZ office and their Delivery Dept.", "rating": 2}, {"title": "Happy in store, but....", "text": "Customer service (in store) was excellent. However, after receiving my purchases - the bed frame & drawer was damaged. I contacted customer service and was told I would receive an email and hardware set to repair the bed- however, I never received the item or email.", "rating": 2}, {"title": "Poor communication by staff( was not…", "text": "Poor communication by staff( was not told that clearance stuff have to be individual pick up) , staff are playful and make mistakes with orders( was double charged for rails). There is no communication at the store and the warehouse( was told to come for my refund and when got there, was told had to wait for warehouse to communicate which woud take hours). One star is for the furniture and another one was for the guys who brought the stuff to the house. Homezone on North Richland Hills", "rating": 2}, {"title": "Make sure that your customers is more…", "text": "Make sure that your customers is more important than a sale and make sure they are satisfied at the end.", "rating": 2}, {"title": "poor quality!", "text": "Furniture showed up and looked great. The delivery crew rushed things so I couldn’t check the furniture. Upon  further inspection one of the tables where broken and incomplete. Had to tighten the legs on the sectional I bought. Long story don’t waste your time with homezone. Spend the extra money and get quality furniture.", "rating": 2}, {"title": "We are still waiting for you guys to…", "text": "We are still waiting for you guys to change our broken chair", "rating": 2}, {"title": "Initial approach was amazing along with…", "text": "Initial approach was amazing along with attention and customer service. . Actual receiving product, miscommunication on process or time frame of delivery was terrible", "rating": 2}, {"title": "When I received my table and chairs", "text": "When I received my table and chairs, The first thing I noticed was a nick in the chair. The delivery guy pulls out a marker and colors the nick. Then they bring in the chairs. The chairs were not leveled and not put together well. The table comes in and it is chipped. I informed the delivery guy to take it all back. I immediately call the store and talk with the associate that sold me the table and chairs. I was told she was with a customer and she’ll call back. No call back. Finally speak with her and explain my dissatisfaction. She explains to me about the service people coming out to repair chairs. It’s new, why should I set up an appointment for new furniture. I attempt to set up the appointment. I inform them of my schedule. They  continue to try to give me an appointment between 1-3 in the afternoon. Finally Martha in service accommodated me by having service repair after 5. Thank you Martha. I assure you, this would be a 1star if not for her. I will not shop or recommend home zone", "rating": 2}, {"title": "So very frustrated when my couch showed…not happy", "text": "So very frustrated when my couch showed I could get it in 2-3 days online, and it going to be over a month!!!!", "rating": 2}, {"title": "Location in Denton was terrible.", "text": "Date of experience: May 03, 2019", "rating": 2}, {"title": "I should have never listened to the…", "text": "I should have never listened to the salesman, and i should have read the fine print very closely. I feel i was intentionally misinformed on the financing process with one company while not being told about other options in order to push a certain contract. I accept my share of the blame, because i should have not been so trusting which is why ill pay my furniture off in 90 days and never shop at your company again, rather than just put the purchased items on the curb and tell you to come get them.", "rating": 2}, {"title": "The merchandise I purchase had some…", "text": "The merchandise I purchase had some irregularities. It has been a week and they have not corrected the problem. I'm still waiting on a phone call to discuss what they are going to do about the situation.", "rating": 2}, {"title": "Lack of communication from the store is…", "text": "Lack of communication from the store is completely unacceptable. Initially the sales woman who sold us the set was awesome, and told us they had until 8pm to deliver furniture. We opted for delivery since we had no way of transporting it ourselves, and we thought we were already spending a good amount of money, an extra $100 for delivery and set up sounded like it would be less of a hassle for us, since I'm pregnant and wouldn't be able to help my husband set it up. I missed half a day of work to wait on the delivery people, bc I was told they would not contact me when they were on the way, they would just show up any time during the window of delivery. When they didn't show up during those hours, I called the store, they specifically told me they were running behind due to another delivery, but that they would still be delivering the furniture. At 7:55, when they still had not shown up, I called again making sure they were still coming, since it was getting closer to 8pm, after waiting since 1:30pm. The salesman placed me on hold to call the delivery people, he came back on the line to tell me the truck broke down however they were on the way. Also when I called the store the only option where a live person would answer was the sales floor. The other options went to voicemail, both times I called. At 8:11pm the delivery driver calls me to make sure I will be home for the delivery, mind you I have been waiting since 1:30pm. The men that delivered the furniture were very nice and went right to work setting up our bedroom set. There were some scuffs on all the 3 pieces of furniture, but they guys tried to help with touch up marker, and we agreed that we could live with 2 of the pieces with scuffs. However the scuff on the dresser was too deep to cover up with the touch up marker. So they said they would make note of it and to call the store in the morning. They left, and we moved the chest in the bedroom, and noticed it was quite wobbly. So when I called the next morning, I told the sales woman who answered what exactly was wrong. She gave me a managers email to send pictures of the damage. I did so immediately after that call. The response email said someone would contact me shortly. That was April 6th, today is April 13th. I still have not heard from them and have not used the dresser or chest, bc I was under the impression that it would be a quick and easy fix. I do love the bedroom set, aside from the issues. I just would like to use it. And it was the most inexpensive of the other furniture stores in town. *Update, they did contact me the day after I sent this review. And my shipment will not be here for another week. I'm happy this is getting taken care of and that I was contacted back. I hope I can just get my dresser and chest and finally start using it.", "rating": 2}, {"title": "I purchased a power reclining sofa from…", "text": "I purchased a power reclining sofa from HomeZone last week. The sales associates where nice, but my problem was once it was delivered the sofa. I told delivery guy that it did not look flush. He said he would put in a technician to call me. Well since then my sofa has unhooked (separated) 3 times and still NO call from technician. I been calling, I get voice mail to still no response. My sister referred HZ to me. 1st and last time buying for me.", "rating": 2}, {"title": "Personal in the store was awesome but…", "text": "Personal in the store was awesome but delivery was terrible they rude and don't care about staff.", "rating": 2}, {"title": "Service and Delivery", "text": "Service and DeliveryI buy over $5000 of furniture, THEN they tell me they don't deliver!! I offered to pay for delivery if would go the extra 23 miles, but they just said nope.  Won't be buying the rest of the furniture needed to fill my new house at Home Zone!!!  Lost a huge account.", "rating": 2}, {"title": "Great sales lady", "text": "Great sales lady.  Loved the dining room set.  Came in when they told me.  We brought it home and the railings fell off that hold the leaf.  Called them and they said they would order me another one, bring it to my house and set it up.  I was very pleased.  It came in and they said they never told me that they would bring it to me.  I talked to 3 different people and then I contacted corporate office.  Then they finally did what they said they would do.", "rating": 2}, {"title": "Cooper Navy 6 piece", "text": "I bought the Cooper Sectional 6 Piece with ottoman which cost over $2,000.  During the delivery, the chaise was torn in the bottom. I called and they rescheduled for someone to come fix it 2 weeks later.  Finally, when they came to fix it, it was just a black mesh that did not look like the original.  It is missing the zipper and quite frankly, it looks like something I could have done myself.  I sent an email with pictures showing what the chaise looked like before and after to two individuals (Thailia and Isabel) and have not gotten a response yet.  I wish I could post photos of the chaise so that you could see it.", "rating": 2}, {"title": "nice furniture, horrible delivery process", "text": "Although I liked the furniture, the delivery process was the worse experience I’ve ever had. The delivery guys were awesome, but the way this company handles the delivery is ridiculous. On top of that, if you don’t like the delivery window they give you, you have to pay a fee and go up to the store to pay and reschedule your delivery time. Had we known that, we would’ve went elsewhere.", "rating": 2}, {"title": "The people were great. Furniture, not so much.", "text": "The people were exceptionally nice and professional. Good experience stops there. Purchased a TV center (chest of drawers) and a pair of night stands. The chest seems to be of expected quality but the night stands that arrived are garbage. Poorly constructed, warped drawers, touch switches only work 50% of the time, strings that can't be removed, half of a staple that cut me open, and black \"stuff\" that stained the new carpet. Low-grade garbage from Vietnam. (I thought this was a family company who made this furniture in their own factory? At least, that was the story.) Paid $400 each and they aren't worth $40. So, a star for the people and a star for the chest. $800 wasted. UPDATE: Why did he say he hopes I enjoy my furniture when I just said I was NOT enjoying my furniture? Because it was an automatic robot reply maybe? BTW, nobody ever called. Another auto-reply in 3... 2... 1...", "rating": 2}, {"title": "To many complications with my…", "text": "To many complications with my furniture. Headboard didn’t work first, they fixed it but now I discovered the leg on my dresser is broken in half", "rating": 2}, {"title": "I waited 45 min just to place my order…", "text": "I waited 45 min just to place my order to buy $2k worth of furniture.   In addition I can’t reach anyone to confirm the deliver date tomorrow.   No one picks up the phone in the store.", "rating": 2}, {"title": "The manager was very rude", "text": "The manager was very rude. The prices y'all have on broken furniture is ridiculous. There was a piece of furniture that said as is because of scratches but it had a huge crack on the corner and y'all wanted $400 for It but there was a new one that had no damage and it was the same price kinda ripping people off.", "rating": 2}, {"title": "Garbage bed", "text": "Honestly I don’t know these are still in business. I ordered a bed for $250, had to come pick it up and load it myself.  Then the bed was absolute trash and I had to return it. Then I ordered one online from an online retailer that was less expensive and actually fit together.  They also charged me a 10% restocking fee for what was a shockingly terrible product.", "rating": 2}, {"title": "Ordered 2 Dining chairs from Sarah collection", "text": "I purchased 2 additional chairs from the Sara collection and one of the chair was not welded properly. Poor workmanship!  We purchased the dining table and 4 chairs months earlier and they were delivered to our home. After several weeks two of the chairs began to become lopsided and a friendly guy came out to fix them ...we needed an additional 2 chairs, ordered thru the internet and picked them up at Denton store unassembled! The manager said that since we purchased them on the internet that they didn’t assemble them. I’m very very upset that the quality of these chairs are poor!", "rating": 2}, {"title": "The return policy is terrible it’s costly to customer", "text": "The sales person was very nice and understanding. However, the company policy is very missed up. The daybed was delivered and setup partially because the wrong piece came with the bed and the bed was not tightened. Another person came out with the correct piece. All the time neither put in the correct amount of screws. The bed was still shaky. At this time I no longer wanted the daybed. It cost me a delivery fee from the first delivery and would have costed another delivery fee for them to come and get the daybed. I initially paid $539.09. When I returned the daybed I was given a credit of $345.53. It costed me $193.56 when l returned the daybed within the 7 days. I will never shop at Home Zone for any other furniture. I advise if you can go somewhere else.The daybed was never correctly put together. How many chances was I supposed to give them to do it right. As I said I am done with them.", "rating": 2}, {"title": "Very disappointed in customer service…", "text": "Very disappointed in customer service after the sale.  We bought our set on Saturday and took what was in stock.  We were told our couch would be in Tuesday.... nope.... then told it would for sure be in Friday.... nope.... now they say well hopefully Tuesday.  VERY disappointed!  My husband took off to go pick up the couch.   Sales person acted irritated.", "rating": 2}, {"title": "Warranty Claim Submitted but Ignored", "text": "I bought a recliner sofa, a regular recliner, and an oversized recliner.  I was really happy with it.  I was told there was warranty on the furniture.  The recliners are now very hard to close.  So I decided to file with the warranty.  I followed the instructions and was told I would get a response with 48 hours.  I have not seen a response.  All the information was submitted with the three required pictures for each piece.  That was weeks ago!  Now I just received an email saying the email was not received due to the size of the email.  I gave now submitted each picture one at a time.  So now I will see if I have a better outcome.", "rating": 2}, {"title": "The customer service is horrible", "text": "The customer service is horrible. I stood at the counter for 15 minutes before someone even looked up at me. The table I order had internal parts broken that I did not realize until I put it together at home. The manager was “too busy” to talk to me so I felt with the poor kid that answered my call. The least they could have done was to offer to pick up the broken table and deliver the new one. Also one of the chairs that came with the table had a split in it and had to be replaced. I could go on.", "rating": 2}, {"title": "Extremely Disappointed", "text": "The whole transaction with personnel was somber and lackluster. There were no smiles, there was no energy, there was no appreciation or any kind of positive interaction as I could only buy two of the three chairs I wanted. I picked them out of the clearance center, which was pretty dark in comparison to the well lit selling floor. The two chairs were loaded into my truck as I was asked to sign that there was no damage to the chairs. As I began unloading them at home, there was damage to one of the two alright, but not from loading them, which is the statement I thought I signed. It was clearly pre-existing, I suppose, maybe, from being a floor model. I was very disappointed and I cannot do anything about it since I signed the form. I am unhappy with the chair, my experience, and Home Zone. The man I dealt with presented himself as the manager; what a lousy manager. I want nothing more to do with Home Zone after I can finally buy the final chair I wanted, if it is still there when I can afford to go get it.", "rating": 2}, {"title": "Dining Table", "text": "When the dining table was delivered , three of the chairs were wobbling and there was big chip on the edge of the dining table . I am very disappointed. It looks like there was no quality check done before leaving the warehouse.someone is coming on feb 7 to look at it . Hopefully it will get fixed", "rating": 2}, {"title": "I was very disappointed by the delivery team", "text": "I was very disappointed by the set up crew who left the bed with missing screws and the table set to a way that it cannot expand as demonstrated at the store. Very poor customer service experience in general", "rating": 2}, {"title": "Got my pillows straight off the truck…", "text": "Got my pillows straight off the truck they had some dust or dirt inside of them when you plop on them . The couch is comfy but a lot of the threads inside were lose and coming undone. Not really worth it tbh", "rating": 2}, {"title": "Gee everthing Iwas interested in was not …", "text": "Gee everthing I was interested in was not for saleI was going to buy my salon  waiting area and lighting but cute ones were not for sale sale your item for sale were outshined by decor and furniture and lighting not offered by home zone for sale so I bought  an clearance bar stool only because I needed one in that color range and it was able to fit in my car other wise I have no good rating the service was nice but that's all! Y'ouguys are on the wrong zone definitely Dropping the ball in that Zone !", "rating": 2}, {"title": "So buying process was great yet they…", "text": "So buying process was great yet they say make sure the furniture is all good prior to letting the delivery men leave and if not have them take the piece or pieces back. NO that is not how it works at all. The delivery guys who by the way are paid by the delivery not customer satisfaction want to get in and get out as quickly as possible so taking the piece with them isn’t easy. I bought a sectional with power and it was so crooked and didn’t fit right. They attempted over and over yet were in such a hurry they didn’t ever do it right and wouldn’t take the piece in question. So a repair ticket was formed and they left. They were nice enough yet smelled like a cigarette factory so our redone room smelled like that for hours after they left.  Well my husband came home and said it’s just not hooked in correctly and fixed it. Repair ticket was canceled. Well then we have a lot of family from out of town a couple days later and we went in there to use it for the first time-guess what the armless recliner had only one button to work it. The other had fallen off. So called and set a repair ticket because even though it probably can’t be fixed without ripping the material and sewing they had to set up a repair.  Didn’t care what i had to say.  Well it was for 6pm-8:30pm. Does no one care about family time anymore!  Work day ends at some point. Again we have family here and have had plans during that timeframe for weeks. So I called to change-well evidently they have only one person doing the repairs and he won’t change. They were to call me back to get a new time but No one called back. I again called this AM and got a lady that helped me get the piece returned and replaced with a new one (Pearl). Well guess what can’t get it here and their 4 hr time frames are more like 6 hr time frames if it’s like the first delivery. So far this experience hasn’t been customer friendly what so ever. We even said we’d come get it-nope not an option. So I worked hard to get our new gameroom set up and ready for family and guess what they will be gone by the time it HOPEFULLY gets done. Such a bummer and Home Zone employees (delivery nor customer service nor repair department) care a bit. I’m so disappointed. They opened a store next to my work so I thought it would be quick and easy but nope. So we’ll see if we get it and how long that takes and if it actually works. But yes they have charged our card!  Disappointed Customer Dawn", "rating": 2}, {"title": "store Wonderful delivery awful. Love my furniture", "text": "Store is great service was wonderful then the delivery people had extra pieces (2)and the table was wobbly they won’t install the pieces and left without finishing the job. Never called to say they were coming and left without checking why they had extra stuff. Also lost the screws then sat around waiting on their phones while one guy looked for them. However the store sent an employee over to reinstall the pieces this was a 5 hr ordeal all together. I would give the store 5 stars and delivery department 0.", "rating": 2}, {"title": "Delivey is bad", "text": "Delivey is bad, they will call me for puck up at store and never received the call, I had to go the next day to the store and wait a long time.", "rating": 2}, {"title": "Disappointed", "text": "I received the Crosby Stills couch and loveseat on September 25, after moving into a new place, finding out my ikea sectional wouldn’t fit, and that the west elm sofa (I originally wanted) would take 10 weeks to arrive. The salespeople at Home Zone we’re lovely: polite, friendly, not overly intrusive. The men who delivered the sofa set, however, dropped them off quickly and left. I should’ve wondered why they rushed. Only then did I notice how dinged up the legs were, how much of the finish was chipped off of them, and how far the cushions all stuck out beyond the depth of the seat base. I wanted to return them almost immediately, but especially after sitting on them for an hour. Much to my dismay, the website basically says that I CANNOT. It is now October 8, the sofas are not even a month old, and already the fabric is getting loose, and they are no more comfortable than when I received them. I am incredibly disappointed and sorely wish I had just gone to ikea.Edit- I do appreciate Home Zone reaching out to rectify this issue, shortly after I posted my review and then emailed photos of the sofas’ several defects. (See response below.) However, the resolution was simply an offer of exchanging the sofas for store credit (minus the $200 worth of tax and delivery fees we paid and we would have to pay an additional delivery fee if we chose other couches), and we no longer trust the quality of items available there. The only full resolution would be an offer to return the sofas and receive a refund. We will simply have to suck it up for the next year, and then upgrade to an Ikea model. Lesson learned.", "rating": 2}, {"title": "Receiving the merchandise on delivery…", "text": "Receiving the merchandise on delivery date , merchandise has been incomplete, missing drawers for dresser , missing sofas back , and chairs for table missing 2 , having to wait 7-10 days to get what you have purshased , on the missing pieces of furniture, something or someone is not doing their job either submitting the order correctly , either at the store or at the warehouse , if you are needing your furniture for the holidays or for your family you may have to wait as we did and are still having to wait Alicia Zapata", "rating": 2}, {"title": "The.works are not that nice .", "text": "Date of experience: October 07, 2018", "rating": 2}, {"title": "After spending 2000.000 for a sectional…", "text": "After spending 2000.000 for a sectional about a month ago, and I'm still having issues....when the furniture arrived, it was connected together except for chase....it had wrong connection parts on it, so had to wait almost 2 weeks for them to come and fix it that issue, but within that time someone sat on chase and the cushion never came back up...apparently there was no support on whole right side of seat, so \"I\" had to take the chase back up to the store myself....i had asked to exchange a recliner for the chase, but it's been on backorder since the 2nd week after I bought it, when I initially asked, until an unspecified date...was just told sometime at the end of October, which is a whole other month away....not a good start at all.", "rating": 2}, {"title": "The people who delivered the sectional…", "text": "The people who delivered the sectional furniture were rude. The first thing he said when he walked into the house was that the furniture would not fit, but he would try anyway. They brought the pieces in and put them together and asked if everything was alright. I told them that the pieces were not correct. The corner piece was higher than the rest of the couch. I was told the reason for the difference was that it was partly on the rug. I said that the rug would not make that much difference and the piece connected to it had too much space. I was then told that he had more than 4 years experience in delivering and setting up furniture and it was put together correctly. I insisted it was wrong and they needed to fix it. They also insisted it was correct and walked out of the house. My daughter and I ended up fixing the problem, the one section was not connected to the left & right pieces. In fixing this we noticed that the cords to operate the recliner and console were not even plugged in. I received an email stating the furniture was delivered and noticed that they forged my name on the delivery.", "rating": 2}, {"title": "Bedroom Suit disaster", "text": "We ordered a bedroom suit, went in early in the week. We asked several times if the furniture would be available on Friday as we were renting a trailer and were planning on purging our house of several items while at the same time picking up the bedroom suit. The only thing that the location had was the nightstand when we went in to pick up the order. None of the people we dealt with when we ordered the product were available including the manager. Seriously?  We accepted the floor model due to only having the trailer for a day. The big dresser had to be shipped because the floor model had water damage from the AC vent. When we got the bed home and started putting it together, bolts and nuts were missing. Complete nightmare. Then we had to wait for a worker to run back and forth trying to find the right bolts to put the bed together. This completely thru our day off and we did not get to use the rented trailer to haul off our old bedroom suit. When we opened the mattresses, one of the bottom box spring mattresses was not stapled correctly on the bottom, (poor workmanship)  so the cloth is hanging under the bed. Bad experience all the way around from start to finish. I doubt we will buy anything else from Homezone.", "rating": 2}, {"title": "Very disappointed in fact that I was…", "text": "Very disappointed in fact that I was able to purchase show room model couch but would not sell me the show model loveseat & recliner at the same time which resulted in me having to make 2 trips to get furniture! The manager also was not friendly when we called to check if furniture was in, we were hoping to get it picked up before rain hit so now it’ll be another 2-3 days before we can get it! She was more concerned about her tent sale than her customers I hope that tent sale makes it with the 3 inches of rain we’ve received today!!", "rating": 2}, {"title": "Ordering my new mattress was a good…", "text": "Ordering my new mattress was a good experience, however, picking it up was a nightmare. There was a couple that was picking up an entire house full of furniture. I just had one mattress to pick up. After waiting for a while, I walked into the warehouse to look for an employee to help me. The girl told me to wait by my truck and the one guy loading items will be with me when he’s finished with the people with a house hold of furniture. Poor customer service!", "rating": 2}, {"title": "Your salesman don't know anything at…", "text": "Your salesman don't know anything at all. They don't know what they're talking about when it comes to payments. I feel like I've been taken advantage of. It wasn't explained when my payments were due and how much my payments were. If I would have known that the cost was over $2,500 for only $1,200 worth of furniture then I would not have signed a contract and I would not have purchased anything from y'all at all. Now I am in a really tight spot because your employees aren't knowledgeable about the cost or arraignment of the products that they sell. The employees should definitely know and understand the terms of the sales that they make. Then I would not be in this position. I feel like y'all were not responsible enough or knowledgeable enough on the sales end of things. I would not be doing business with your company if I knew all the details that I now know. I really hope y'all take this complaint very seriously and do something about the way your business is conducted. If it continues like it is, I'm afraid y'all will lose alot of customers and not stay in business very much longer. It is not ran professionally nor does the staff know what they should have been trained on. Treating customers like this only gets you a bad reputation and forces good clients to find gainful stability in stores that train their employees to explain how financing works. Customers need to know all of the details and all of the terms before they can make an educated decision to sign the contract or to walk away and go to another store.", "rating": 2}, {"title": "Technician never showed up to install…", "text": "Technician never showed up to install missing female plate, to connect our sectional.  No call. No show.   Unacceptable", "rating": 2}, {"title": "Fabric on furniture is nice", "text": "Fabric on furniture is nice, but there is a board across the lumbar part of recliner that is starting to come through fabric and hurting. The couch is very hard and uncomfortable to lay on.", "rating": 2}, {"title": "Worst experience", "text": "Worst experience. Asked for  a phone number to be changed for delivery. Number was never changed and caused a huge mishap in communication and furniture was not going to be delivered because of it. Will not buy from her for a long time. Or ever.", "rating": 2}, {"title": "Defective furniture", "text": "We ordered some bedroom furniture a month ago and two out of the three pieces had something wrong with it. They sent out a technician who could not fix the problem and they did replace that piece.  The replacement piece had the same issue, just with a different drawer. On the second piece, there was a large chunk missing from the wood. They scheduled a time to replace but then a couple of weeks later told us the piece was back ordered and couldn’t be delivered for two months. They have come to my house three times to either deliver something or try to fix something, and each time requires me to free up a four hour window of time to wait for them.The people we have dealt with are very nice and are trying to be helpful. But, we are still waiting for a resolution.", "rating": 2}, {"title": "The staff there are very one-sided in…", "text": "The staff there are very one-sided in their thinking. The woman working there acted so surprised that I came in and paid for the furniture I wanted, without using their financing options. She tried to request 2 forms of ID from me. I had to set her straight at that moment. I didn't meet someone else's ignorance deter me from getting the furniture I wanted, but the ignorance from her was so distasteful.", "rating": 2}, {"title": "My experience was terrible due to delay…", "text": "My experience was terrible due to delay schedules pick up because the store was states that they only receive delivery once a week so my merchandise will be delayed for another week. They didn’t also realize that weekend is also my birthday sham sham", "rating": 2}, {"title": "Very unhappy customer", "text": "Store experience was great. Everyone at the Arlington location was helpful. The sale of the furniture was easy and did not feel pressured. However once the purchase was done and it was time to deliver is the reason for the 2 star rating. It took THREE different deliveries to finally get it right. The furniture was purchased on July 30th and it took until August 14th to get final delivery. For that reason I will not be purchasing anymore of my home shopping needs with Home Zone.", "rating": 2}, {"title": "I would like someone to call me", "text": "I would like someone to call me. When the guys put my table together I asked for them to take the leaf out, which they did. When putting it back together the table chipped, and they took pictures of it, and was told HomeZone would call me and I never heard anyone. Please call at 254-717-6929", "rating": 2}, {"title": "We had decided to do the 90 days same…", "text": "We had decided to do the 90 days same as cash. The salesperson showed me how much it would be weekly, bi-weekly or monthly. She said for me to call progressive leasing when we received our merchandise. I tried calling them and they were closed. When I did reach them they said the store had to send them something and we would get an email. I did finally get my email and my payments were already set up. The whole process was VERY confusing. We will be making 3 payments to pay off this furniture within 90 days", "rating": 2}, {"title": "NeverAgain", "text": "The store associate never told me that I would pay more for doing an 18month contract with smart leasing, one. Two, he store associate told me that the bed I bought would not need a box spring and it does. 3, the quality of the furniture that I have for 4 months is horrible! I will buy from here again! Wish I could get a full refund!", "rating": 2}, {"title": "We had our furniture repaired and had…", "text": "We had our furniture repaired and had the 5 year warranty plan. I had to pay still for the repairs to be made. We our furniture came back the repairs that were made were unsatisfactory. Also there are no pickup or delivery for the to be repaired or delivered after the repairs. Not very good customer service considering the warranty and sill had to pay.", "rating": 2}, {"title": "Loved the furniture BAD Delivery Service", "text": "Loved the furniture. Erica, store manager was absolutely Awesome! Delivery and delivery department was on the other hand a Nightmare. Driver was rude on the phone and customer service delivery department was worse! Pearl, I think is ladies name, was BAD! Instead of trying to help resolve our damage issues was on the defense and picked any little thing to try and blame us for the situation, has absolutely NO customer service at all. Erica, thank yoi for saving the situation and going above and beyond to help us solve our issues. Ty!", "rating": 2}, {"title": "I only got a set of screws for 2 chairs…", "text": "I only got a set of screws for 2 chairs and i bought 6 chairs", "rating": 2}, {"title": "Buyer Beware!", "text": "My husband and I purchased the Greystone bedroom set for our teenage daughter on July 6th, 2018. We were drawn to the quality and the features of the furniture. Each drawer is dovetail construction front and back, the drawers are cedar lined, there are a couple of hidden drawers that are felt lined, there are power outlets and USB ports inside the top drawer of the night stand, and there is a night light under the night stand which is activated by touching a little metal sensor on the side of the night stand. We were very excited to purchase this set.  There are no high pressure salesman at this store.  We were told right away that they are not paid commission.  We paid for our furniture ( $2,000.00) and set our delivery date. We were told to make sure to examine each piece of furniture once it was delivered and make sure the delivery men notated any damages.  This would ensure that we would have no problems getting the furniture replaced if need be.  Well, here is where I give this company two stars. The set was delivered on July 12,2018.  I looked over the furniture and realized that 3 drawers on the chest didn’t close properly, and there were chips in the finish of the night stand and dresser.  I had the delivery man make note of this and he also took pictures.  He asked if I would like them to remove the furniture or to keep the furniture and do a swap. I chose to keep the items until they could be swapped for undamaged pieces, as my daughter had no furniture in her room, and needed a place for her clothing.   Apparently this is where I went wrong!  He mentioned that I would receive a call from the company to schedule a swap by the following day.  I did receive the phone call the next day.  The lady I spoke with asked me to send her photographs of the damage... I watched the delivery driver take these photos, why didn’t she have them???  I went ahead and took my own photos and emailed them to her.  She returned my call after she looked at my pictures and told me “ Per upper management they want to send a technician out to try and repair the furniture instead of replacing it”  I told her there was no way I was keeping damaged furniture. She said”  I understand  your frustration, but the chips are small, and the drawers can be adjusted”   REALLY!?  I didn’t pay $2k dollars for chipped furniture and warped drawers! I didn’t purchase the floor model set on scratch and dent discount!   I realized that I should have REFUSED the delivery instead of doing a swap. We went back and forth in a few phone calls and they still wouldn’t set up a swap until a technician came to at least try to repair the items.  I was told that if the technician cannot repair the items to my satisfaction, they would move forward with a swap.  I made clear that if it wasn’t to my satisfaction which I already know it won’t be, because there is no way he can repair the chips and make it blend in, or do I believe he can adjust the tracks of the drawers because I can see the drawer fronts are warped. That I will not keep damaged furniture!  She set up an appointment for the following Tuesday or so she said. When I received the email for the appointment, it was for the following week! (July 24th 2018) I am yet to have the repair technician out as I still have 4 more days until the appointment.  I can say that I am very unhappy with Home Zone’s customer service.  There shouldn’t have been any issues getting this bedroom set replaced. The hassle should have been with the third party delivery service that would have caused the damage during transport and set up. This is not my fault, and I shouldn’t have to settle for repairs of damage I did NOT cause.  I have bought furniture at other stores and never have I had an experience like this. I will not be purchasing any other furniture from this company.", "rating": 2}, {"title": "My mother always said if you don't have…", "text": "My mother always said if you don't have anything nice to say, say nothing at all! The sales personal were very nice, but besides that no comment. While I was waiting at the desk a young Lady from the Army was having as much problems as I was. also what I got was not what I thought I was suppose to be getting!", "rating": 2}, {"title": "Nobody seems to care after selling…", "text": "Nobody seems to care after selling their products. I bought the dinning set, couch and the love seat. My dining table was missing parts and I called the store about it and gave them all my information. They said they gonna give me a call the next day. But, nobody called me the next day. So I called them again the next day if there’s any news. Then they took my info again and said the same thing again. The next day nobody called. I had to call the store for a week. They took my info every time I called. Finally they got my missing parts but nobody seems to cares. They didn’t call me or anything. I just wanted to know what’s going on. Only when I called them they said I can come pick it up.I didn’t even complain or anything every time I called them. I just very humbly asked what’s up. It was a horrible experience.", "rating": 2}, {"title": "Not that good experience", "text": "Not that good experience. Good prices. First delivery, my living room couch was dirty and ripped off, tv stand was scrached, bed frame was missing screws, box spring was the wrong size, delivery guys where rude and did not care if the furniture was bad or not,  They said \" I am just here to help my parter, I don't care if something goes wrong\". Second delivery guys were nice. Basically I had to send back the sofa, tv stand and had to install the screws my self.", "rating": 2}, {"title": "The furniture I purchased was beautiful…", "text": "The furniture I purchased was beautiful and well made the delivery is what I had issues with. The first delivery crew brought the wrong slats and legs for the bed we bought. We we're suppose to recieved a pbone call about delivering and setting up the bed for the following day but never did. Luckily we were home wheb the second crew showed up. The second crew didbnot speak English and couldn't communicate well with us.", "rating": 2}, {"title": "My sofa remains unfixed", "text": "My sofa remains unfixed. I have gone to the store twice and gave them pictures but I have not received a response.", "rating": 2}, {"title": "I would of bought  a 3 or 4 piece…", "text": "I would of bought  a 3 or 4 piece bundle if I was offered a good discount.But all in all the people where very friendly.", "rating": 2}, {"title": "I love furniture", "text": "I love furniture, was placed on hold for over 30 minutes. SERVICE HERE WAS Very POOR. Will be using Baileys Furniture from here on out. Very", "rating": 2}, {"title": "First Installers were pathetic did not…", "text": "First Installers were pathetic did not put the bed together correctly.  Didn't inform the \"engineer\" like they were suppose to so it took almost a week to get the correct parts and the guys who could actually install the storage part so the drawers closed and the bed didn't sag.  Not sure I will use this company again.", "rating": 2}, {"title": "On delivery The leg on the dresser…", "text": "On delivery The leg on the dresser Drawers was broken. Several of the tracks on the Chester Drawers were off due to stripped screw holes and tracks were completely pulled out/off and Small screws were pulled from drawers on several drawers.....The Truck drivers remarked \"Factory defects\" and Did attempted to repair but still had a Badly damaged leg and poorly fitting drawers, dents, scratches on several pieces. Hopefully someone will contact me soon about the Damaged products to get the issues fixed.", "rating": 2}, {"title": "Everything was good in the store but…", "text": "Everything was good in the store but communication after was horrible and I still do not have my full order almost  a month later", "rating": 2}, {"title": "I ordered over $3000 in furniture from…", "text": "I ordered over $3000 in furniture from here. Furniture is great, delivery is great, however I was disappointed that I was never even offered free delivery and I asked to throw in an extra $100 end table and they said no. I guess they don’t believe in helping us help them.", "rating": 2}, {"title": "Purchased a table it was perfect!!!!", "text": "Purchased a table it was perfect!!!!But I also got a bed I never took the bed from the store well we decided we wanted something different and requested a refund .Was told we had to wait on a refund check yet I paid cash.  Refund process is. BS NO ONE SHOULD HAVE TO WAIT 2 WEEKS ON A REFUND!!", "rating": 2}, {"title": "Disappointing", "text": "My experience was great from the time I walked in the door until it was time to purchase and schedule my delivery. Michael was very helpful and knowledgeable about the bedroom furniture we were interested in. He customized our order to exactly what we wanted. The scheduling and delivery part of the transaction was the beginning of our frustration. There were parts of our order that were out of stock and it has now taken weeks to get them in. Our requested delivery date of almost a week out was not granted and now we are forced to wait more than 10 days for our purchase. The logistical side of orders needs to be fixed or we will not be back as customers.", "rating": 2}, {"title": "Good pricing, false advertising", "text": "The prices are great, but don’t trust what anything says online! I ordered a bed after seeing it in the store. Online, it said it came in a Merlot finish. And when i saw the black in store, I made sure to tell them that I wanted the merlot, and not black. Turns out, it only comes in black but is described and pictures incorrectly online. Thankfully the manager was willing to work with me on getting me a different bed for the same price, but don’t expect to get the proper color furniture that is described.", "rating": 2}, {"title": "We brought our brand new furniture home…", "text": "We brought our brand new furniture home and not THREE DAYS later, our AL recliner BROKE. Completely unsatisfied with the quality of this furniture. Upon further inspection the piece that broke was made of some cheap compressed wood crap that couldn't withstand any weight at all so we're pretty upset about that.", "rating": 2}, {"title": "After viewing the website for the…", "text": "After viewing the website for the Abilene store we traveled 65 miles hauling a trailer to go buy a couch that the website said was in stock. Upon arrival to the store the couch, was in fact, not in stock. Nor were 3 others that the website said was. We were told that I’m stock meant in the warehouse and would be available for pick up or delivery in 2-3 days but not to where we live because they only deliver to our town twice a month. They were not accommodating at offering any other solution except for buying a couch that was in the store for a higher price than what we wanted to spend. Very, very poor customer service and running of a business and website!", "rating": 2}, {"title": "Need improvement! - Purchased 3 pieces of furniture with a…", "text": "Purchased 3 pieces of furniture with a clear understanding that all 3 pieces would be delivered by a specific date. When that date had passed My wife called to check the status. She was told that one piece was on back order and didn't know when it was to be shipped.... BUT the other two \"MIGHT\" be available for delivery. We purchased the delivery option $90 -  which has the option to refuse the furniture if you choose, for what ever reason. \"Well if we only have 2 pieces of the set, how will we know if they all work in our home?\" we asked the manager. His response was \"sorry... the refusal only works on the first delivery\" so this excludes the 3rd piece which might not work in our small room we bought it for. The manager offered no options delivery dates while on the phone with my wife.....We still don't have any delivery dates as of today AND already have been sent a bill -  FOR FURNITURE WE DON'T HAVE POSSESSION OF!!!  Ridiculous!!!!! Disappointed to say the least in the policies of Home Zone Waco. We liked the furniture and the person who sold it to us was pleasant. However.... the after purchase experience has been frustrating.", "rating": 2}, {"title": "I'm not sure if my first review was…", "text": "I'm not sure if my first review was sent. Customer Service was inefficient for me due to mix up on my Nightstand did not get it and was not told now I have to wait til Friday to get it delivered unexceptionable. Won't come your way again.", "rating": 2}, {"title": "My experience", "text": "Ordered love seat and it didn't arrive on the date I was told. Picked it up when it arrived, took it home and there was bracket missing when I tried to put it together. Had to drive 1 hour on way in my truck to return the whole back of the love seat because they could not just give me the bracket I was missing. Not a pleasant experience at all.", "rating": 2}, {"title": "Bought a family room set and dining…", "text": "Bought a family room set and dining table a chairs. All was great experience until the coffee table was broke. I sent it back. They delivered another one the next week I think it was the same table. Broke. Then promised to get it over the weekend and when I called they said they are too busy on the weekends and it would be Monday. To busy for me a paying customer?  then on Monday they said it would be on Wed. After I had to call again and take 3 days off of work for delivery The assistant manager tried to step in. He gave me a credit which I asked for and had someone deliver it last night. After 9 pm. In a box for me to put together.   On the bottom of the table there is a nitch out of it.   I don’t even have the energy to try to get a new table", "rating": 2}, {"title": "I am very sad to report my…", "text": "I am very sad to report my disappointment after the purchase of my new furniture. Before leaving the Arlington Home Zone store, I specifically requested that my furniture be wrapped in order to avoid damage. When truck pulled up I went to inspect it only to discover the furniture & the plugs were in the outlets just hanging out. I also discovered my sofa was torn underneath. If that was not enough, I called delivery and back to store to complain & that  I refusing the sofa delivery. I did this the anticipation of receiving a call from delivery to reschedule delivery of a replacement sofa. This did not happen. After 3 or 4 days I went back to the Arlington store and cancelled the sofa... I AM HEARTBROKEN & VERY DISAPPOINTED", "rating": 2}, {"title": "I ordered online the picture showed…", "text": "I ordered online the picture showed four pillows they only delivered three pillowsDisappointed...", "rating": 2}, {"title": "Used Couch", "text": "We purchased a couch and love seat at the Sheveport location on 3/31/18. We were told we would have to wait for them to order our furniture. No problem. They were to deliver about a week later. Delivery came and we realized we were charged for two sets of end tables but only needed one. No problem but we would have to return to the store for the credit. We return to the store and I am walking around looking at things and I notice the spot where the couch was that we sat on in the store was gone. I went to the manager and asked him if we got the floor model delivered to our home He seemed very nervous and said well that happens sometimes. I nicely stated that was not acceptable and to find out why this happened. We left after the credit was complete. Why did we wait for a used couch?? HE called a few minutes later and admitted that yes we did receive the floor model. I asked him why. He said the new couch was \"damaged\" in delivery and the floor model was in better shape. TO sum it up I got a new couch and they came and got the floor model. This should have never happened. We would have waited for a new couch to be ordered to replace the \"damaged\" one. This is disturbing to us because we have shopped there for years. What else did we get the floor model of?? Love the furniture and sad to see this location close. We will have to drive now to the closest location. Sincerely, Delene and Ken Sadler", "rating": 2}, {"title": "Sales guy Tony was great", "text": "Sales guy Tony was great. Was not able to plug chair in and really check it out bc it was in a tent. Got home wires were disconnected had to tear the bottom of the chair apart to re connect. Chair seems like frame is bent like it was dropped.", "rating": 2}, {"title": "Sitting straight Up!", "text": "We bought a living room set in 2010 the entire shopping experience was wonderful at the Texarkana,Tx store location. So,when it was time to get new living room furniture we made a conscious decision to return to Home Zone,unfortunately the Texarkana store had closed. So,we decided to go to the Shreveport store to purchase furniture the buying experience was good but the delivery of the product was terrible. We ordered on March 31st and was informed that the furniture would be in on April 5th.(my wife Tonya's birthday).Tonya called on the 3rd inquiring about the delivery date,she was told it would be after 12 noon on the 5th..We started for Shreveport on the 5th about 1pm..(about an hour drive) but decided to call to confirm the furniture had made it. Of course,it had not. It wasn't on the  truck. It would be the following Thursday now the 12th. We had sold our furniture to make room for the new furniture. Hearing this I wasn't happy or pleased.. seeing my wife's displeasure I told her and the Shreveport store I would drive to Dallas to the warehouse,a 3 hr drive one-way with a long trailer in tow!.. I made the drive and made a quick turnaround(6.5hrs)..only to return home to unload the heavy sofas and assembly them.On Tuesday night the 9th I pushed the recline button and it never stopped reclining; the button was stuck..it finally popped out on its own accord I was able to bring the recliner sofa back into the sitting position. The button is still sticking and we are waiting on a resolution...from Home Zone. In addition,the cupholder on the other sofa comes out..all other are tight and secured...", "rating": 2}, {"title": "Prices good....delivery not so much", "text": "Prices are decent.  Part of my purchase I had to buy the floor model and pick up myself.  They would not deliver from the store or have their Dallas delivery folks pick up and deliver along with my other items.  Delivery of in-warehouse furniture was okay.  Movers were very nice and honest. They showed me damage that occurred to my door/frame.  I called in the damage to the store.  A guy named Tom told me he wasn't going to send people from Dallas to fix the damage and didn't know companies in Abilene so for me to just find a company and homezone would pay for it.  I told him I am new here and don't know anything about the town so he told me to use Angie's list.  I feel as they just threw the problem on me to correct.  Worth looking at for prices just be aware of potential delivery problems.Update:  Below response from Randy has really got the ball rolling.  I am very appreciative on the help with finding a contractor in a city I am new in.  If all continues to ho well I should have everything fixed.", "rating": 2}, {"title": "Not too satisfied", "text": "The furniture I picked it beautiful; however it took over a month just for the products to get into the store. As far as dispatch for delivery they are very rude. They don’t try to work with your schedule to deliver your furniture. Representatives will hang up on you. In addition; for delivery they literally provide you with a 4 hour window which they can’t even tell you until the Day before delivery. I can only say which is a first, that the sales representative are the most helpful and provide you with a great shopping experience.", "rating": 2}, {"title": "No satisfactory replacement", "text": "It’s my second time did I bought furniture and they are damaged and they take too much time to replace it!! I’m so upset about it!!", "rating": 2}, {"title": "Less than impressed", "text": "The quality of furniture is great. The customer service is sub par. They told me my order would be ready next day and it wasn’t. I only got 2 pieces. Then they said here was a fire in the warehouse and that was the reason I didn’t get the other half. This was a lie and I was informed later. There was no fire, the employee covered because my furniture was out of stock. Then they said the ottoman would be here on 2 different dates, and it wasn’t. He said they would deliver free of charge when it came in. They did not. I had to drive 3 separate times to get the furniture and it was very inconvenient. I’m not impressed in the least by this transaction.", "rating": 2}, {"title": "When I went to the store and look at…", "text": "When I went to the store and look at the furniture the finishing was great when they bought it home it wasn't the same finishing", "rating": 2}, {"title": "Sales people are great", "text": "Sales people are great! But pickup of my purchase was horrendous! Was advised pickup was scheduled for the following Friday, showed up on Friday and was advised the delivery truck never arrived, and to come back on Saturday. On Saturday was advised the delivery truck still had not delivered the items and they would call once thee items were received. Items were finally ready for pick up on Tuesday. And each and every time you try to pickup you have to walk through the store locate a sales associate to print an order walk back to the pickup bay wait 30 minuets to get your items. Then they loaded the items without unpacking them to ensure quality as I was told would happen.... I give up! Why don’t your guys in the shipping bay have access to look up orders?!? Just plan silly and frustrating!", "rating": 2}, {"title": "Never answered my questions regarding…", "text": "Never answered my questions regarding savings if I bought more furniture during checkout. The guy who was helping me said he'd run the numbers but it seemed he was in a hurry to get home and I got tired of asking so I just paid for my items instead of adding more like I wanted. Delivery was great, those guys were early and were done setting everything up in less than 20 min. Great service!", "rating": 2}, {"title": "delivery of mattress not being…", "text": "delivery of mattress not being delivered and the 2 sales people not being very forth coming and dodging phone calls has made me not want to purchase anything else from Home Zone.  as of today still no mattress and they asked could we pick it up from store.", "rating": 2}, {"title": "Sadden", "text": "It is with great disappointment that I write this. My wife and I were extremely excited to receive our couches yesterday only to have to refuse the furniture and cancel our transactions because the delievery team was not able to bring them in our home. We do not have a truck, which is why I didn’t mind paying for the delivery fee.  I refuse to sign the waiver that would hold me accountable to any damages that can occur by forcing the couch in and I refuse to “down grade” to something we don’t want! I will be up there Saturday to cancel all transactions.", "rating": 2}, {"title": "The initial shopping experience was…", "text": "The initial shopping experience was good.  We had problems when it came time to pick up the furniture.  First they could not find it, then we were told we did not bring your furniture our truck was to full.   It did take over an hour for them to locate it.  We were then told we can pick it up tbe next day, assured it would be there.  I called late in the day to check and was told the truck would be late.  I was told eavj time it would be there.   I had to call to check on it.  I did not even get offered free delivery til I asked, then declined it.  I did not trust themat this point.  Customer service needs improvement.  I did email the company when they asked for my comments and have had no reply.", "rating": 2}, {"title": "The return policy sucks", "text": "The return policy sucks - \"once sold, the deal is done despite how bad the furniture is.\"Why should I recommend this store to anyone if once you buy something that turns out not as good, you are stuck with it? Furniture is not an everyday purchase. I have bought couches before and I have been allowed to exchange.", "rating": 2}, {"title": "Disappointed with warranty experience", "text": "I purchased my living room furniture a short while back, I also purchased the extended warranty. I was told if I needed any repairs they would send someone to my house to repair or replace if necessary. I recently had to file a claim under the warranty and it was approved quickly. However I was then informed I have to bring my love seat into the store for repairs and once it was fixed I would have to come back and pick it up. Thie is a huge inconvenience and hardship. I would have to hire someone to take the couch in and then pick it up a few weeks later. I was very disappointed especially since when I made the purchase, I was told the repairman would come to my house.", "rating": 2}, {"title": "Some furniture (sofas and love seats) …", "text": "Some furniture (sofas and love seats) are over priced.  A love seat should not cost the same price as a full size sofa.  That's ridiculous and like paying the same money for a large drink but I'm getting a medium drink at the price for a large drink.  You're charging me the same price for a 16 oz steak, but I'm getting a 10 oz steak.  My wife and I both opened two separate accounts within a week.  They would not give us a bundle deal and discount the furniture for being a repeat customer.  NO LOVE.  They also did not give us free delivery on our second purchase of furniture..  They are leeches and blood suckers.", "rating": 2}, {"title": "Told me my furniture was in...", "text": "Also my nightstand was not level.  Someone is coming out to do the repair. Why not replace it?  I still don’t know when my chest coming... sometime after the New Year.", "rating": 2}, {"title": "m sad on this Christmas season I …", "text": "m sad on this Christmas season I purchase lots of stuff. but i didn't get anything free even a lamp .", "rating": 2}, {"title": "The delivery guys were in a big hurry …", "text": "The delivery guys were in a big hurry and seemed agitated when trying to setup the couch/sectional... not sure if homezone do not schedule enough time or they did not want to deal with the adjustment to make it look perfect... also the furniture is not stable... reclusive net toppled over when someone sat on the hand Rest.", "rating": 2}, {"title": "Not okay..", "text": "I was approved credit and was told could choose a package from different styles. The sales lady’s that helped me were extremely nice. However the styles of furniture I chose were either discontinued or not available for months. So forced to choose something I wasn’t 100% on wanting but we needed furniture ASAP. We were told everything would be in on a certain day except my table and chairs. It would be a later date and I was okay with that. The day before my furniture was scheduled to arrive I called the stores asked what was the process of pick up. She saidnteuck will arrive 1st thing we unload and check for everything, then the manager will come and confirm it’s all there, and then we will call and let you know it is ready for you to pick up. Will be around noon-1 o’clock.Next day received the call your furniture is in and ready for pick up. She said it is all accounted for except the kitchen table will be in later like we discussed. Okay and my husband went to pick up about 4:30. He called me and told me the mattress we order with our package was not available and ready for pickup. That we would have to choose a “downgraded” mattress or we can order it again and it will be in, in a week. I was highly upset because we were assured the process of the truck and pickup.. and also told all of our items were accounted for that afternoon and ready for pickup. My husband talked to the manager there and was told we can choose a “downgraded” mattress but it will change the amount of our contract and I must be there to sign A new one. So I rushed across town to go sign. My husband was already there over and hour when I arrived and we ended having to wait another 45 min all to get told that the amount of the mattress didn’t matter. We prefer the 19 piece for $1999 so the mattress that comes with the Deal was priced down already to fit in that deal so the price for the mattress we are downgrading to didn’t matter. They wanted to give us the downgraded mattress and throw in 2 $100 pillows for our trouble. We tried to suggest free delivery for my table we are still waiting for or a ottoman or dresser and they wouldn’t. Only the pillows! They then told me that i didn’t need to be there at all since we are not signing a new contract. So basically i got off work early and rushed across town for nothing. I was upset and didn’t want to deal with it. So I left and let my husband decide and we received the downgraded mattress and pillows. They told us that in the system they still had the mattress as being there and no one ever looked to actually see if it was. So they never ordered one for us because they “Assummed” it was in store. When the lady called and told us ALL of our items were accounted for and ready for pickup, they weren’t and they lied. I just hope they get better organized on their computer systems and customer service.", "rating": 2}, {"title": "Delivery took 3 attempts. Furniture damaged.", "text": "The furniture was priced well and the quality is nice. Our salesman was very helpful but the overall process and experience has been terrible. We were supposed to get a couch, chair, table and dresser delivered soon after buying. The day they delivered the items the dresser was broken in multiple places, the table as well. The only thing that was fine was the couch and chair. We had to wait close to another week to get the delivery done again for the damaged items. They delivered and once again there was a problem. The person putting together the table called and let me know it was missing parts and he couldn’t put it together. That’s 2 times ive had to leave work to be here and still no complete delivery. They sent another person out the 3rd time close to 7-8pm. Finally that person puts the table together and leaves. Then i inspect it and notice the table is chipped on the corner and one of the rods underneath is bent. So we’re back to where we started the first time. Not very happy with this experience AT ALL. Especially after spending over $2,000 on “new” furniture.", "rating": 2}, {"title": "Bad Customer service", "text": "The Furniture here is priced decent but the policies are ridiculous so bad that I will never even consider buying from Home Zone again. After you pay for the furniture they have you sign a 3 page document with a million disclaimers and spelling out how they will not except any returns even if the furniture is faulty or damaged when you open it. You have to unbox and inspect everything in their back parking lot when you pick it up because if you don’t and you open it at home and something is wrong they will not try to make it right. Then you have to try to repack it all up again for transport. So since everyone has to do this it takes an hour of time to just pickup anything you buy. In this day and age of easy no hassle returns everywhere it makes no sense to shop at this store and deal with being treated like the enemy.", "rating": 2}, {"title": "Very poor customer service all the way around", "text": "I was told that when my furniture was received in the store that I would be called and advised so that I could call to set up for the delivery company to pick it up.  I never received that call, I even gave you and extra day just in case there was a problem and still no call.  I called your store (Lawton, OK) on the 3rd business day to inquire and was told that yes it fact it had been received on the date I was advised that it would be in; I asked if someone was to have called me to let me know that and the woman confirmed that my salesperson was to have called and informed me.  I advised her that I had received no such call.Then to make matters worse the moving company that you use takes 2 full days to return my 2 calls making it another week before my furniture ever gets to my house.All in all a very poor experience all the way around.  I just hope that the furniture is better than the experience.....", "rating": 2}, {"title": "Still waiting!!!!!", "text": "Bought Couch an love seat on October 23 , loveseat was supposed to be in warehouse an couch would be in the by Friday which would have been the the 3rd of November, here it is the 9th an still haven’t received either one nor have I received a call saying they on way or anything. Not pleased at all in this process.", "rating": 2}, {"title": "Our shopping experience was not good", "text": "Our shopping experience was good,in that salesperson was very polite. What we realized that we were over charge for a lovesofe we bought, we tried twice to get this corrected but management response was price for lovesofe and sofe where switched??? Wasn't right! Will not be shopping or referring your business to anyone", "rating": 2}, {"title": "Unhappy customer", "text": "I purchased a dining set from the Abilene store on 9/10 and it was not in stock.  I went to pick it up on 9/18, two days before I was to move to south Texas.  When we opened the box containing the table top, it was cracked.  The young man working in the warehouse was very sympathetic, but the same could not be said for his manager.  He said they would order another top, but it would not be in before I moved.  It finally came in and my sister went to pick it up 10/10.  Same problem.  Another cracked top.  Again the manager seemed unconcerned.  They have supposedly ordered two more in hopes that one will arrive w/o a crack.  Meanwhile, more than a month after spending almost $900 I still have 6 chairs but no table.  Not impressed.", "rating": 2}, {"title": "Failure to update online items", "text": "Ordered a sofa and loveseat set online only to be emailed after completing my purchase that their website was not updated and the set I had purchased was not available. The only thing they would offer me was 2 sofas.... realistically that would not work in my living room space. Really wished they would of at least offered another set to compensate for the inconvenience and seeing as it was an error on their part.I work in retail so had they even offered a discount on another set I would of likely chosen another of their sets instead I had to cancel the transaction and buy my set elsewhere.", "rating": 2}, {"title": "My experience- The Good and Bad", "text": "In store experience was very good. Great selection, fair prices, non commission sales people that actually help or give you space when asked.  Financing process was easy. We bought a chest, dresser, 2 night stands and an audio video cabinet/stand. Spent about 2kHere’s where is took a wrong turn. The furniture shows up with the audio video stand being the wrong color, white instead of dark wood, the chest drawers don’t fit flush and has white stuff (glue maybe) dripping down part of it, and one night stand has damaged wood on the front of the drawer. 2 out of 5 pieces are acceptable.  The delivery person asks if it’s ok to leave the chest and nightstand here and it will be swapped with new ones. Considering we didn’t have anything there to use for our stuff, it sounded fine. I wanted the audio video stand taken back but apparently that was misunderstood. I couldn’t wire up my components so it does me no good.  They leave when I apparently wasn’t paying enough attention, my fault. I call the store and speak with a manager. I let him know that I wanted the stand picked up and since it’s a large inconvenience, I will just put my old stand back, rewire my stuff and return, not exchange, the stand I had purchased from them. The manager told me that may not be possible because I had signed for the stuff I received. He told me I should have refused all the damaged/wrong items and technically “I own them now”. I almost flipped my lid. I explained that the delivery guy offered for the 2 bedroom pieces to stay and should have taken the stand. He said they shouldn’t have done that and “it’s not his call” on what happens next as he would have to call the delivery people.  I explained that I didn’t want the stand there in the first place, the paper I received clearly states it the wrong color but he still said the same thing. Fine, make your calls. The delivery people call me and say they want to bring me new drawers for the night stand and chest. I explain that’s fine for night stand but won’t work for the chest plus it says on my paper it will be “reordered”.  They ask for me to send them pictures. I do and they agree to swap the chest. I ask about the stand and they say “that was the stores mistake” and I have to deal with them. Did I buy my furniture from one store or two??  Really guys? Pointing fingers back at one another while the customer (me) is in the middle thinking I’m SOL. The manager at the store calls me back and says he got the regional manager to approve the return. Clap clap. So at the end of the day it got worked out. I now have the replacement furniture and it’s fine. I shouldnt have had any anxiety but had plenty. TL/DR - In store experience great. Delivery experience poor (I didn’t even get the point where we had to tell them certain feet/glides where missing on 3 pieces(wobbly furniture), also shipping straps for wires not removed, and trash was left behind etc). Handeling of customer service poor but with favorable outcome. Important learning / buyer beware - I guess you shouldn’t sign for anything unless the whole order is perfect or “you (may) own it”.", "rating": 2}, {"title": "Still waiting for undamaged dresser since Sept 12th", "text": "Purchase dresser on September 12th,2017. There was 1 in stock but inspected it was damaged in 5 places(2 of the 5 was bad). They ordered one and it came in on September 16th. Warehouse personal only cut the front of box down where we could only check front. wasn't able to check inside drawers, back or the inside of door.  When removed from box at home found the inside of door was cracked from bottom half way up on hinge side.  September 17th went into store to see if we needed to return whole dresser or if the door could be replaced. Spoke with Eric Jackson, he went to back of sales floor and spoke with Randy Reams. He came back up front and told me to email the pictures to Manager02@homezonefurniture, so he could see them. He would forward them to service dept. to see what they could do.  Mr. Reams was to lazy to walk up front look at pictures and speak to me.Mr. Jackson said be 24 to 48 hours to get answer from Service Dept. I received a auto message saying the pictures were forwarded. Samantha called and said they were ordering door and we needed to bring in door with hinges attached to exchange. On September 23rd door came in and I picked up. It didn't fit because hinges were placed to high on door to match holes in dresser. I called and spoke with Joseph stating I wanted refund or store credit towards another Dresser. He stated he had to call and see if they could do that. He called back saying couldn't do full refund since dresser left building, could give me a portion towards another dresser. I had to wait for them to order 3rd dresser before I could get my money or exchange. So as of today Sept 29th still waiting on a dresser that isn't damaged. This was a birthday gift for my granddaughter, she picked it out and was very excited but now she is very disappointed.", "rating": 2}, {"title": "The reception was excellent however....", "text": "The reception was excellent.  No pressure.  However the delivery as been postponed three different times.....And when they say they will return calls with new information regarding delivery, they do not.  It leaves the customer with questions and of course they (customers) are unable to plan their schedules as well.  Very nice and courteous sales staff, however do not follow up with delivery dates and do not keep the customer informed as well.......", "rating": 2}, {"title": "First the delivery address was wrong …", "text": "First the delivery address was wrong after we gave them the correct address.  After the setup we discovered the leaves didn't line up correctly .The delivery service made a Note of this to give back to store.  We had to call several times asking for manager and he was never there. Also two  of the chairs were wobbly.  Finally they sent a tech out to fix the chairs but he knew nothing about the leaves which has been the issue all along.  He took pictures and said they would take care of it.  Still have heard nothing from Home Zone.  This all started Sept 7th the delivery date .", "rating": 2}, {"title": "We purchased a sectional on 9-9-17 with …", "text": "We purchased a sectional on 9-9-17 with the understanding it was instock at the ware house and it would be ready to be picked up 9-12-17.  I did not get a call from anyone on the 12th.  I called on the 13th they said it came in but it had a big ripe so it would not be in until 9-19-17, I called it didn't come in this time it would not be until in until  the 21st or the 22nd.  The warehouse man called and said it came in on the 22nd.  We went to pick it up on the 24th BUT GUESS WHAT it was the wrong color.  We checked the invoice and it did have the correct color and the correct configuration.  Some how when they went to reorder from the 1st screw-up they listed the wrong color.  All through this ordeal the store manager never called us I had to do all of the communication.  We had some friends who let us use their tailor to pick up the sectional and our kids came down from Dallas to help us.   Our sales person check inventory at the warehouse and it stated they had 15 in stock and it will be here on the 26th.  Chances are this ordeal will not be over.  The store manager does not believe in good customer service if he can't make this right.  Stay tune for the next episode.", "rating": 2}, {"title": "I came in several times", "text": "I came in several times, and finally made a decision on living room furniture. Staff was friendly. I told staff what I wanted and she drew up the paperwork, rushed through it. When having me sign it. When I got out of the Store and looked, I was billed wrong. I went back in, told the manager, who had helped me. She stated she corrected it, but said she would email me the invoice since she was headed out to lunch. When I finally received it the next day, it was still incorrect. I went back in and they refunded me some of the money and redone the paperwork again, emailing me the invoice and stating they would throw in cleaner for the furniture when it was delivered. They delivered the furniture but didn't deliver any cleaner. It was a very tiring process and at this point I haven't even called to tell them I didn't get the cleaner they threw in to say sorry for over charging me over $1400 dollars.... then messing it up again.", "rating": 2}, {"title": "I recently purchased a new bed frame …", "text": "I recently purchased a new bed frame and side tables.  The guys who came and put it together did a horrible job, within a week I've had two stabilizers just fall off and hit the floor, just to find out that they were secured properly.  I call the store where I purchased them from and have yet to get a call back.", "rating": 2}, {"title": "Was told I would receive a call that …", "text": "Was told I would receive a call that Wednesday after my purchase. Didn’t receive one at all had to call myself and when I called I was on hold for 15 mints. Called back had me on hold for another 10 mints. Your lady seemed like she was trying to rush me off the phone.", "rating": 2}, {"title": "No return policy", "text": "James was extremely friendly and very helpful however they have a no return policy that I was not aware of.  The chair I purchased was too difficult for me to get in and out of, unable to use very well.", "rating": 2}, {"title": "I ordered a table with 6 chairs", "text": "I ordered a table with 6 chairs. The chairs came in a few days later after but not the table top. They said the table top would be in the week after. It didn't show up. So I called this week (8-30-17) and the table top still had not been delivered. I got 6 chairs with no table top. I had to wait three weeks when I was told it would be in with the chairs. Most likely won't be buying from here again.", "rating": 2}, {"title": "Wanted to up grade", "text": "I'm would preferred store credit my furniture didn't last that long I wanted to upgrade and buy new furniture now I have to get my old furniture fixed that I really don't want because how long it lasted", "rating": 2}, {"title": "Our sales rep was great", "text": "Our sales rep was great, but the product we were told was made here in the usa, which it is not. Either made in China or Vietnam, comes in boxes that you have to put together.  We had a uhaul,  but was told they don't sell floor displays. Had to wait three days fora coffee table and end tables, when they had at least 4 sets on the floor. Not good customer service. Had to go back and pick up at store. Prices reflect what you pay for. It may look good ,but not worth the price on some products.", "rating": 2}, {"title": "got approved", "text": "got approved, but no one called me to let me know if and when I could get it delivered", "rating": 2}, {"title": "Very disappointed with service I …", "text": "Very disappointed with service I received. We purchased an entire bedroom set and received a TV console were the drawers would not close. I have not been able to get the item repaired or replaced as of today. And I am told to call various people. I called the same day the item was delivered and feel it should have been resolved in the same week.", "rating": 2}, {"title": "MATTRESS", "text": "MATTRESSThe mattress we purchased doesn't have the comfort of the mattress we tried in the store.  The store mattress had more firmness to it, the one we brought home is very soft, and was noticeable the first night.  Now, we are attempting to exchange it for the original firm mattress we should have purchased.  An $800 cash investment down the drain.", "rating": 2}, {"title": "A Salesman On Top Of His Game", "text": "Walking into Home Zone was 1 of the best experiences that I have ever had while looking for furniture.  Floyd & the gentleman with him made my friend & I feel special from the time we walked in the door. They gave us compliments on our smiling faces so early in the morning & the rest was me coming back 2 make my purchase.  Mr. Floyd was so knowledgeable on everything I was looking for. He is everything a salesman should B.", "rating": 2}, {"title": "Dana and Rene both did a great job", "text": "Dana and Rene both did a great job. Mathew does not have a clue what the term \"customer service\" means. The delivery notification system is a complete joke. The four chairs that were delivered \"ALL\" needed adjustments. Thanks to Rene we now have one chair that is an 9 out of ten, two that are rate at a 6 and one that I rate as a 3.As it stands, we do not have a single clue when or how and if this issue is going to be resolved satisfactorily.", "rating": 2}, {"title": "Disappointed", "text": "When we first got there, we where not greeted. We were in the building for over an hour. Employees looked at us and continued to pass us by because we where in gym clothes. We continued to wait until we confronted the store manager. We bought over $6,000.00 dollars worth of furniture. Some of that was finance through your partner or preferred lender. Now, while doing this our information was inputted incorrectly and we where not able to get into our account to make payments.  What is aggrevating is your manager created the problem and yet we had to enjoy the frustrations of fixing the problem.", "rating": 2}, {"title": "Over a month!", "text": "The shopping experience I received was amazing fast and easy. BUT... I was lead to believe my furniture will be delivered in 2 weeks, now at week 3, I have been told it will be over a month before my furniture is received to the store then an extra week or so until it is delivered to my home.UPDATE: my furniture will be delivered i  3 days, the MANAGER failed to contact me, thanks to Mr. Charles for calling me and setting a delivery date for me.", "rating": 2}, {"title": "The salesman was excellent and buying …", "text": "The salesman was excellent and buying process was smooth. A week after receiving my sofa it got stuck in the recline position and a new one was delivered today. The new sofa is unacceptable. It has a cheaper grain of leather and does not match my recliner like the broken couch did. I am hopeful that this will be reconciled this week with the delivery of ANOTHER couch. I just want the couch I paid for. Not happy or satisfied as of today.", "rating": 2}, {"title": "Accepted reclining sofa & after …", "text": "Accepted reclining sofa & after delivery people left, found recliner on right side not operating properly. Called Home Zone & they stated a new sofa would be delivered the following week. Received call the following week & lady stated it would be still another week before sofa would be replaced. The following week we called & was told it would be a month before sofa was replaced. It was on backorder. The recliner on the left is now not operating at all. It appears the motor is out. Made the first of 3 payments & have a new sofa that we can sit on but recliners are not useable.", "rating": 2}, {"title": "Furniture quality is good for the …", "text": "Furniture quality is good for the price. My biggest complaint is that I've been waiting over a month for a mirror to come in that goes with the dresser we bought. I was told it would be in within 10 days...", "rating": 2}, {"title": "This gonna be my 1st & last that's all …", "text": "This gonna be my 1st & last that's all I can say", "rating": 2}, {"title": "I purchased my bedroom set less than 30 …", "text": "I purchased my bedroom set less than 30 days ago and it has already chipped and broke in regards to the frame. It was delivered on 06-02-2017 and on 06-20-2017, I was moving it to a different area and the wood split when I picked it up, very upset and the claims department told me it was wear and tear and I am responsible for that and that could repair it , if I purchase the extended warrant. Not very happy.", "rating": 2}, {"title": "Purchased a chair and ottoman over a …", "text": "Purchased a chair and ottoman over a month ago.  Chair was supposed to be new.  We received an automated call telling us chair had arrived.  We went to the store to pick up and discovered automated service made a mistake.  They gave us the floor model chair but with an extended warranty.  We are still waiting for the ottoman, despite being told it should arrive soon.  We wanted to give this smaller company our business especially after Nebraska Furniture Mart is putting the squeeze on all the home store in the DFW area.  But after this experience with Home Zone, this will be our last shopping experience with them !!", "rating": 2}, {"title": "Damaged", "text": "Our sons bed arrived damaged and my husband had to take off work early for this delivery Very disappointed Not happy right now", "rating": 2}, {"title": "Horrible experience", "text": "Horrible experience, if it wasn't for my wife I would have canceled. Lied to me told me fake monthly quotes and to then had me come back the next day because of computer errors just to give me an even bigger quote. Very unfortunate to feel like I was done wrong.", "rating": 2}, {"title": "I was sadly disappointed in the service …", "text": "I was sadly disappointed in the service that I received from Home Zone. I normally in the past have purchased furniture from Ashley Furniture Stores. I thought I would try and save myself some money this time around, if I had not have paid cash for the furniture, I would have cancelled my order completely. Just getting confirmation on the delivery was a headache. I tried to call the warehouse to see what other times were available, there was no negotiating the delivery unless I wanted to pay a $25 fee to reschedule. So, okay, I took off of work the entire day waiting on this delivery. When the furniture did show up, it wasn't wrapped or anything, the furniture was dirty. In all my years, have never encountered brand new furniture that was not properly wrapped for shipping!! UNBELIEVABLE!! WHO DOES THAT????  In other words, you get what you pay for folks...bottom line..... saving a few bucks isn't always worth it. Oh and on top of that..the furniture has a defect so now I have to deal with fighting to get that fixed.Stacie Scheck", "rating": 2}, {"title": "Not the greatest experience and need follow up.", "text": "The couch we wanted to purchase was out of stock and we're told it would arrive in 3 weeks.  It did arrive earlier which was nice.  Got it home and assembled the backs on.  The backs have fabric that come down and velcro at the bottom to create a closed back.  However, one of the sides is about an inch short of reaching the velcro, so it is just hanging there.  I still have not received a call back and still haven't heard if my cleaning kit has come in.  Yes that was out of stock also.  The couch is very comfy, but wish I had gone with the electric since the manual recline is somewhat hard to close.  Associates were very nice and eager to help sell me a new couch and love seat.  Though now I feel they could care less now that they completed the purchase.*Update -  Got a call and played phone tag with the person that replied.  Thought we were about to have a final solution with a promise to personally deliver a replacement part.  It's been 2 months since that phone call and I'm still waiting for a call.  Can't even send my promised cleaning kit in the mail.  This company is getting bad reviews for these same type reasons everywhere.  I just want the defective couch repaired or replaced immediately.", "rating": 2}, {"title": "TALL TALES", "text": "We where in the store on Saturday picked out what we wanted, payed in full. The salesman said I order would be in on the Thursday truck cause that's the only day they get shipment. Order did not come some we had to get the display. They should offered us half of our money back for the  inconvenience. Will no shop there again.", "rating": 2}, {"title": "The furniture is raggedy.", "text": "Date of experience: April 28, 2017", "rating": 2}, {"title": "FURNITURE IS VERY EXPENSIVE BUT YET …", "text": "FURNITURE IS VERY EXPENSIVE BUT YET DON'T LOOK VERY EXPENSIVE.. ALSO MAJORITY OF EVERYTHING WAS OUT OF STOCK EVEN THE DARN LAMPS...", "rating": 2}, {"title": "I'm rating the experience POOR because …", "text": "I'm rating the experience POOR because the salesperson sold us 2 sofas and a mattress set. Upon delivery we received 2 sofas but was told we only paid for the mattress not the base. We never would have purchased a mattress only. Again the salesperson sold us a mattress set. The delivery guys stayed at our home for close to two hours while we went back and forth on the phone with various store salespeople stating the exact same thing until a manager finally took the call and stated since his employee made a mistake he would honor it. He brought the mattress base out himself. This was the right thing to do otherwise the mattress was going to be returned for a full refund. This was NOT a finance purchase, we paid cash for this. Long story short, don't try to Sell us to make a Sale... One bad salesperson... But never again.", "rating": 2}, {"title": "Great prices!", "text": "The young girl that waited on me was so unprofessional and didn't act like she liked her job. I was extremely happy with the purchase though.", "rating": 2}, {"title": "Very upset", "text": "All of my furnature did not get delivered.  A manager was going to call me back.  Never recived a call.  I called them back and the manager has left for the day.  I will not take off from work another day to wait on a delivery!", "rating": 2}, {"title": "They are a very good store", "text": "They were very helpful", "rating": 2}, {"title": "Customer service of delivery center", "text": "My furniture was delivered on time and was just as expected. A button from the couch poppped off within an hour of being delivered. It took 3 days to get a manager from the delivery center to get back to me. When one did speak with me, he was short with me and didn't reassure me at all- as compared to store managers Sergio and Larry from the Cedar Hill store. I still haven't gotten a firm answer as to when or who will contact me with regards to the repair. The furniture appearance, delivery crew, & store associates were wonderful. The quality is still up for question.", "rating": 2}, {"title": "Now your business", "text": "O.k. I like your store set up. The prices were better than some other stores I had been to. I arrived at your store about week after it opened. (Waited until payday so I could pay cash.) The sales lady was not pushy and let me look around on my own. So that was great. By the time I had it down to 2 sets she was asking if she could help. That was also great I didnt have to look for her. She helped me narrow do to the one set. She went off to the computer and came back we dont have the living room set you want in stock with in 200 miles. O.k. thats fine can I order it and just have it delivered when they are back in stock. She got another guy they talked for a min then came back and he said they dont know when they will have any more in stock it may be the end of april or the begining of may he does not know. I said that is fine i will pay in full now. He said he could not. So I said well I liked the other set also. He said they were out of that one also. So I left went to another store bought almost the same exact set for a little more. And it wont be in stock until the end of may. That is fine with me I will not be home much until the summer anyway so I can wait. You lost a cash paying customer. Not only was I buying a living room set. I was also wanting a bedroom set for me son, and a set for me. So that was a major commision loss. And the two people that helped me never offered me any water. Another guy assitsing another customer asked would I like a bottle of water after he heard me cough.", "rating": 2}, {"title": "Sneaky", "text": "They add extra things so be sure to double check what you sign and what you're paying for", "rating": 2}, {"title": "Service was good furniture was not", "text": "The sales staff was friendly and helpful but the double recliner I bought is so uncomfortable that I can't stand to sit in it for very long at all.", "rating": 2}, {"title": "Hmmm", "text": "The in-store service was friendly and helpful, but, the delivery process was not good. They were unable to make even a 4-hour delivery gap and then they were missing pieces of my furniture set, so I then had to make myself available for the next day without knowing if they would even show up or anywhere near the time they stated.", "rating": 2}, {"title": "Horrible experience", "text": "Great price and great furniture but we paid extra to have it set up and delivered and when it came in from their warehouse they acted like we had no agreement and we had to pay more for the company to deliver it after paying extra for it already", "rating": 2}, {"title": "Every couch I wanted was out of stock!", "text": "You have a beautiful selection of furniture but nothing in stock. I don't understand why you can't  keep more furniture readily available. I understand things my sell out but when I went to purchase a sofa every sofa I was interested in was out of stock. very frustrating!", "rating": 2}, {"title": "Customer Service", "text": "Just wanted to let anyone know who is looking for furniture what my experience has been with Homewise Zone. Sales experience was great customer service after the sale sucks. Our love seat recliner did not work. It took at least four phone calls to their warehouse before I could speak to anyone about the problem. Pick up date was provided, call received to confirm delivery and to state that we would receive a call the night before to confirm four hour delivery window. No call was received, I took off work left two messages with warehouse day of delivery never received call. Called store where purchase was made and was told my delivery time was between 6 and 10 pm. Who delivers furniture at 10 pm. Insane and unacceptable.", "rating": 2}, {"title": "Not Too Bad", "text": "We went to home zone to get a table set we were greeted immediately. The service was excellent until time to check out. We were there for nearly 3 hours and there was couple there that arrived after us and they had an issue and everyone that was helping me just stopped doing so. We finally got our order put in and left. A week later when our furniture is suppose to be in I called homezone on Tuesday to check I was told it wasn't in but another truck was coming the next day and to try back then. I received a called Wednesday telling me the that a table they do not sell anymore was ordered instead of the one I chose. So now I have to wait another week for a kitchen set that I really need. I wouldn't have mind the wait if I was kept engaged and reassured that things were happening, but instead it feels like I lost 2 hours so they could talk to friends that came in or help others.", "rating": 2}, {"title": "Poor quality and really bad service/responce", "text": "I've purchased from Home Zone before a few years back and had some trouble but decided to try them again...it hasn't changed much. The quality is still pretty poor and the service is worse. Yes they're very nice at the store when you're looking but as soon as you give them you money, forget getting a hold of them. I tried for almost a week before I could get someone to call me back and even then, I had to be the one to call...even after multiple calls to try and get a hold of them to replaced my \"damaged\" headboard. We'll see how it goes.", "rating": 2}, {"title": "Disappointed", "text": "Came in on Wednesday with husband looking for reclining section. Spoke with manager advised to speak with one of the reps. Was interested in layaway for about 2 month. The y do layaway. Advised we would come back Friday to start it. Came in to speak with the rep she was busy but got to me. She mentioned financing and how I can get my furniture now and can pay it off. I told her I didn't like the financing part. But it same as 90 day cash and we will be paying off in 2 months anyway. Sounded great. I got set up to apply to progressive but got denied because they can't verify my bank account. I use a credit union. I ended up doing the layaway and was advised I can still do 90 days. Took me about a week to deal with Progressive but they finally verified my bank account. I was excited so I called the store to let them know and they should have received a message. The rep wasn't available so another person answered and helped. He stated I only got approved for $750. I'm clueless and wasn't even informed that they approve for a certain amount at all. He said they can increase the amount but only by 10%. What?? The furniture balance was $1500. Anyway long story short I didn't get furniture because we was not fully informed of the process. We are thinking about pulling out layaway and going somewhere else. We could have just bought each piece. Smh disappointed", "rating": 2}, {"title": "Bait and switch", "text": "I visited a Home Zone and was quoted a price for a mattress. When I returned and was ready to purchase, the salesman mentioned the same exact price.  As I am reviewing my receipt after my $2700 purchase, I notice that the mattress was priced higher. When asking the salesman about it he said there was nothing he could do, it was a system glitch. But, on my receipt it clearly listed the retail price and then the price that it was sold to me for was HIGHER! He clearly should have fixed the price but he seemed very uninterested after he made the sale. I will let everyone around know about their pricing tactics.", "rating": 2}, {"title": "Lost my furniture", "text": "I had decided to purchase the extended warranty on my furniture and I was glad I did because after 2 years of owning it my love seat started peeling apart. I was given an approval code to bring it in for repairs which I did on 12/6/16. It's now 2/7/17 and my love seat has been lost. Home Zone is supposed to be delivering a new one on 2/7/17 to replace what they lost and they told me I would receive a call on 2/6/17 to be given a timeframe for the delivery. It's 5:28am and I have no heard from Home Zone and I have to go to work. I have no idea if my replacement love seat will be delivered to day or what time. Me and my husband have purchased many items from Home Zone and before this we were looking to get new furniture for our 2nd living room but now we are having 2nd thoughts. I'm disappointed and frustrated with the company.", "rating": 2}, {"title": "Pick-up was a hassle", "text": "When we went to pick up the sofa that we ordered, the associate at the loading dock informed us that we did not have the appropriate paper work to pick up our item.  I explained to him that we were only given a sales receipt and he then told us we had to go to the store (which was a good distance away) and get the neccessary document. He then rudely moved to the next person. When we arrived in the store, the associate that provided the pick-up document stated that we did not have to walk all the way there to get it, that he could've just called them from the loading area. Of course this upset me since we were just pushed aside so that the loading dock assiciate could just get to the next person as soon as possible. When we arrived back around to the loading dock, we had to wait an additional 30-40 minutes for the other customers to get all of their things and leave.  We were in a bit of a time crunch to return our rental truck and this cost us alot of time. I think this situation can be avoided if Home Zone provides a bit more customer service training.", "rating": 2}, {"title": "Meh 👎", "text": "The staff was great and showed us hospitality but the furniture is overpriced and of poor quality.", "rating": 2}, {"title": "Frustrating", "text": "When I went into the store in Greenwood Rd. in Shreveport, LA. the man that helped me was very nice and helpful and I have nothing negative to say about him. When our furniture arrived we were to pick it up ourselves. My husband and his dad went to pick it up Sunday (it was supposed to be there Thursday) and there were problems. When they got there the only thing they got was the bed and chest. The dresser and mirror hadn't arrived at all. One of the nightstands was broken and they put the other one on the floor as a display!!! Why would they do that?! We're missing over half of our furniture and it's very difficult getting dressed out of boxes.", "rating": 2}, {"title": "Creaky ottoman", "text": "I got a cute ottoman on Black Friday sale. It does look alright, but it creaks and sounds like it's going to bust apart anytime you bump it or put your feet on it.  I've purchased cheap furniture before and never felt like I had to tell my children not to sit on it because I am worried it will break.", "rating": 2}, {"title": "Wasted 2 hours of my time", "text": "I have living room furniture from here. Came back to get a bed and was told by one employee that my monthly payments wouldn't change by adding the bed, it would only further extend my lease. Spent a long time searching for my perfect bed, went thru all the paperwork and set up the delivery date, only to be told my $45 monthly payments would go up by $200. Awesome. Left empty handed and extremely disappointed. The employees need to all get on the same page!", "rating": 2}, {"title": "Delivery???", "text": "Can't believe I paid for local delivery. Store never contacted to let us know merchandise was in. Got a call with 11AM-3PM delivery window, felt like I was dealing with a cable company. First and last trip to Home Zone Furniture", "rating": 2}, {"title": "Great deal, poor service", "text": "The deal was awesome! Customer service on the other hand left a lot to the imagination.", "rating": 2}, {"title": "Customer service", "text": "Paid extra for chairs and went to pick them up they had given them to someone else. Then one of the chairs had a rip and called to talk to the manager. She wasn't in and was told she would call back which she didn't. Finally got a hold of her and did get another chair but they weren't apologetic at all. Will never use Home Zone again!", "rating": 2}, {"title": "Won't be buying from them again", "text": "Very poor customer service from the manager running the floor to the sales associate, who was sweet but didn't seem to know much at all. When shopping on a black Friday weekend, I would think you would have your more experienced employees on the floor. The manager didn't seem to care at all and was very lackadaisical.  While the prices are good, the quality seems cheap. Won't be going back.", "rating": 2}, {"title": "impossible assembly", "text": "we bought a kitchen table and 4 chairs they come unassembled.we had to drill new holes to assemble because the holes were drilled in the wrong places, now my brand new chairs have drill holes that dont line up anywhere, very disappointed", "rating": 2}, {"title": "🤦🏽‍♀️", "text": "It was ok. They damaged my stuff had to wait for them to deliver a new one", "rating": 2}, {"title": "poor customer service", "text": "I ordered a bed online.  I was not called when it arrived.  After I called and was told it was in the store, I went to pick it up at 7:45pm (the flyer states the store closes at 8:00pm).  There were no customers in the store, and there were 3 employees standing at the desk.  I was told the warehouse people who load the furniture got off at 7:30pm, and they would not get my bed.  I came back the next day at 7:15pm, and it was the same.  No customers in the store.  3 employees standing around the desk.  This time they said the warehouse people got off at 7:00pm.  I refused this excuse based on what I was told the day before, and the male employee finally agreed to load my bed.", "rating": 2}, {"title": "You just can't buy something off the floor", "text": "Everything you see in the store has to be ordered. Decorations and pictures are not for sale. The company has made it such a hassle just to get a product, it's not worth it. You can't go in there and buy anything off the floor, cash or credit. I found q carpet that I liked and found it cheaper on line. I asked them if they would price match. They said yes, but...... They wanted to charge me an extra $ 99.00 for a delivery fee, for something I was going to pick up myself. So I'd say NO they do not price match. They whole experience was just a hassle .", "rating": 2}, {"title": "Confused", "text": "Shortage of salespeople.  Sales person kept multiple tasking while waiting on me.   It  took 2 hours to purchase a mattress set.  The finance person did not know their job or financial  service that Aaron  provide.  I wanted to use Progressive financial but was convience to use Aaron rental.  Bad choice, I am stick and  again will I listen  to a Aaron a rep.I have cancelled the back ordered coffee table and a month later I receive a call this week to come and pick it up.  .  Sign confused.", "rating": 2}, {"title": "Do not deliver locally", "text": "Should provide customers the satisfaction and show them your appreciation by delivering locally", "rating": 2}, {"title": "Not being being notified", "text": "I placed an order for a living room set and a dining room set. Paid a down payment.. was told it'd be here on Tuesday. Here is it Thursday and they said it won't be at their store until next Friday! I was never called or anything to let me know! I actually called the store and that's when they decided to inform me. I moved into my new home on Tuesday with the hope that I'd have my new furniture! That was the whole reason I chose Tuesday to move in.  Well now I'm in a house with zero furniture and no one can help. I'm frustrated and furious!!", "rating": 2}, {"title": "Poor Service", "text": "After my experience with Home Zone in Round Rock,  my furniture buying will be done somewhere else. I order furniture never received a call advising furniture in store. Worst customer service ever encountered from staff to assistant manager.", "rating": 2}, {"title": "Dresser was damaged on corner when packaged.", "text": "Was VERY disappointed when we opened the dresser once Home. We had looked ALL over the dresser at the store with the sales person to make sure everything was good and it was. He said he would have it boxed back up and it would be ready when we returned. We came back and picked it up, got home with other and opened it up to find DAMAGE on the Corner of the dresser that was NOT there when we looked at it. The guy loading it just picked it up without a dolly or anything so I just imagine that he must have just Rolled it over to box it up. I did not expect to have that problem after we had taken the time to check EVERY side and corner before we purchased the dresser.", "rating": 2}, {"title": "Not pleased", "text": "I purchased a $465 loveseat and the delivery was going to be $100. Keith told me that he could get me a $69 delivery instead of the $100 delivery charge because the sofa did not need any assembly, similar to a mattress delivery. But then he reversed that and I had to pay $100. He said his Mgr wouldn't approve it. What I'm surprised by is that an outfit like Nebraska Furniture only charged $50 to deliver a sofa I bought,  but Home Zone charged $100 and that the attitude of the manager was so cavalier . He was willing to lose the sale  over $50, or even the $31 difference between the $100 and the $69.  I will not be recommending Home Zone and I won't be shopping at Home Zone again.", "rating": 2}, {"title": "No response or communication", "text": "I placed my order, did not receive a confirmation email and did not receive notification as to when my order will be ready for pick up.", "rating": 2}, {"title": "damaged", "text": "was not informed we had to put everything together including the legs on couch and love seat, both items damaged waiting on a new set.", "rating": 2}, {"title": "UNACCEPTABLE RESPONSE", "text": "We purchased a power chair for our mother.  Paid in cash and arranged for another family member to pick it up and deliver to her in the nursing home.  We live out of town.  The relative went to the store, the manager could not locate the ticket for the chair, made no effort to call me (she had my number) to determine which chair it was.  Relative had to make an additional trip to store after I called.  Customer service is critical to return business.  We'll take ours elsewhere.", "rating": 2}, {"title": "staff is to unknowable about financing", "text": "The location has undergone a major hiring of new employees who have yet to be fully train leading to a disappointing experience.", "rating": 2}, {"title": "Bad experience", "text": "The sales people were very young and were not knowledgeable of their product and not eager to make a sale. We offered to purchase a floor model because there were two of the same brand in the showroom. We were denied by the manager. Rather than work with us, they let us walk out of the door losing the sale. We took our business elsewhere. I would not recommend this store to my friends.", "rating": 2}, {"title": "Damaged at delivery with no resolution a week later", "text": "I complained about damage to my bed at delivery and still have not been contacted regarding replacement peices or solution. Also I was Extremely disappointed to see my bed was not delivered boxed up which is why the damage occurred to the wooden legs.", "rating": 2}, {"title": "Furniture Buying Made Not So Easy, Except.........", "text": "My wife and I had awesome shopping experience at Home Zone Furniture in Mesquite, TX.  Bryana, our sales associate, gave us considerable help when requested, and the space to shop alone, when needed.  The quality of our furniture is top notch, was delivered on time and with no complications.  Kudos to Bryana and to Home Zone Furniture.  We'll definitely send more business their way.So, after our furniture was delivered, we decided we'd like to purchase another recliner to finish off our living room(we mentioned this to Bryana during our purchase).  We called the Mesquite store in an attempt to order one for pickup, seems easy enough.  However, the store is not allowed to accept orders over the telephone, and require you to place the order in person.  Now, mind you, we just purchased a full living room set earlier in the week and had it delivered.  We requested a manager be notified of our request, but we were still unable to place the order.  So, we are off to make an unnecessary trip to the Mesquite to buy additional furniture in person.   I had to drop my review from 5 stars to only 2, since the Mesquite store was unwilling to help us with buying additional furniture from their store.  Go figure 😔😔Thank you Home Zone Furniture for replying and informing me that I am able to place an order online using my credit card.  I attempted to do just that yesterday, before returning to the store.  While attempting to complete the online order, we found that the recliner could not be shipped to the Mesquite store, and the nearest one available for shipment to is in Euless, TX, which is quite a distance from our home in Forney.  We went back to the Mesquite store and placed our order, still unhappy with the process.  Upon arrival, a sales associate & manager explained their rationale for not allowing orders over the phone and that is was to prevent fraud.  I tried to explain that having the recliner shipped to the store and allowing us to pay for it upon pickup, should not cause any issues regarding fraud.  Our original sales associate, Bryana, although on duty, did not involve herself in our discussion or show any concern over our complaint.  We plan on picking up our new recliner on Tuesday, and will put this purchase and dissatisfaction with HomeZone behind us.  Unfortunately, when friends and family seek referrals for home furniture purchase, we will not be able to, in good conscious, recommend they shop at the Home Zone Furniture in Mesquite.", "rating": 2}, {"title": "Good customer service but lacking in furniture quality", "text": "Out of the four thing my mom and have bought at homezone the only thing that has not broke is the metal bed frame. The only reason we even bought the metal frame is that six hundred dollars bed frame she bought broke in less than a day.", "rating": 2}, {"title": "Don't buy from homezone", "text": "If you buy 1500 dollars of furniture you should not have it come in boxes and have to put it together ,My sales agent Elliott in lawton when I asked said it would come all done homezone is a scam. The slots on my daughter's bed where off,  I had to saw for 2 hrs to fix it and the bed frame cost 211 dollars, the dinning room  set where on sale was 269 dollars for table and chairs came in a box you have to but together after 3 weeks I'm not even going to try.ohhh and the owner claims to cut out the the middle man out .  There furniture was  but my furniture was from Vietnam ,maylaysla, and this and thailand . There warehouse bs . They will probably never post this.", "rating": 2}, {"title": "overall good experience", "text": "I've had a overall good experience with homes on just a couple things I don't like sell person  Emilio was great he took the time to help me pick up my furniture I when I came back in the next day to purchase my furniture Milio was off and I explain to the salesperson that  I want to Amelio to get the commission but he took the commission for his self like he made the sale like he did all the work and a snack cakes love thing is the delivery guys were very unprofessional  how do you come to someone's house delivering furniture which your pants hanging off your butt I want my wife asked him to put his furniture a certain way one guy got an attitude of this not going to fit that way and put it away he wanted to put it so I had to physically move the furniture to where my wife wanted it because they refused", "rating": 2}, {"title": "Good Price, Poor Customer Service", "text": "I purchased my first couch this past weekend and I was fine with the price for what I bought. In total, I spent about $1300. I decided this over a two-time experience in the store. However, when I went to purchase the couch, and inquired about the manufacturing of the couch, the service member was wrong and did not know a lot of the answers or he spoke incorrectly about them and was later corrected by another service member. Upon inquiring about the delivery contract, the sales manager was somewhat hostile when certain lines were questioned. I would ONLY recommend this place to someone if they were looking for inexpensive furniture and WOULD NOT recommend it if they wanted good service.", "rating": 2}, {"title": "Great Staff...poor experience.", "text": "Damaged furniture that should have been caught before I drove an hour to pick it up. The box was clearly damaged and the furniture inside should have been checked before hand. When I took my king bed home, there were parts missing and I was unable to sleep on it. Parts were reordered and when I drove and hour back to pick them up, the parts I needed were not in the box. Nobody took the time to look and actually see if the missing parts were in the new box. VERY FRUSTRATING!!! Staff was very nice and apologetic, but a very bad experience overall.", "rating": 2}, {"title": "skills", "text": "some need to work on customer service skills", "rating": 2}, {"title": "Honesty would have been nice Simon", "text": "In the beginning, the experience was pleasant.  Simon was interactive, social, and attentive.  But as it came to the wire,  we were going to have to pull out of the deal,  but Simon  said \"I can get the payments to 62, will that work\".  We responded,  \"a month\".  Which was replied with \"yes\"...  As salesman, myself,  disclosure is necessity to maintain loyal customers. Our payment are actually 120+ a month which we did not agree on. This is the last visit and purchased from Home Zone all due to Simon's silver to tounge.", "rating": 2}, {"title": "Management", "text": "I was informed that my furniture be ready for pick up 2 days after I purchased it. However, it was not. Long story short wnded up getting comp for the home deliveryafter I argued for 20 minutes. The home delivery was great! Had an website punch in ur phone number an it tells you the expected time they will arrive.", "rating": 2}, {"title": "Dissatisfied!!!!", "text": "First, in the store the items were advertised for $1177. When we went to pay the said they had it priced wrong and it was $1700. Even though we were irritated we went ahead with our purchase with additional items and only received pillows for the mispricing confusion. We ended up spending approximately $4300 that day. The day of delivery, Saturday, we get a call that the dresser and mirror were damaged and would be reordered and brought to us on Thursday. We were glad they checked it so we let that roll off our shoulders too. The 2 gentlemen arrived in a very timely manner and worked VERY hard to get our stuff put together. The delivery guys realized the WRONG foot board was sent when they were trying to set the room up. So, needless to say, We are without a bed for 4 days. We had already given our bed away the morning of our furniture delivery. We have always had an excellent experience in the past with Home Zone. This time we are having second thoughts about using them for our furniture. I am VERY disappointed!", "rating": 2}, {"title": "Mattresses not deliver", "text": "I ordered a Bed Set with Mattress and box springs. On the appointed day they just deliver the Bed set without the Mattress. Up to this day I am still waiting for them to delver my Mattress and Box springs. Call was made and they told me that they would ATTEMP to deliver it on Friday or Saturday with no definite schedule.", "rating": 2}, {"title": "extremely disappointed and definitely last time doing business here", "text": "We recently purchased about 2400 dollars in furniture. When purchasing the furniture we were told some of our items would take a week longer to get than others. One week wasnt a big deal but when called to be told it would be a whole month we were upset to hear. We spent alot of money, didn't get this furniture on credit or to make payments, we paid cash. Then to be charged a delivery fee when the furniture wont even be on time? This is non sense and since I obviously can not get a refund I am being forced to live with the terrible decision to purchase\r my furniture with Home Zone. I went with you all because of your great deal, however why showcase a sale when you can not meet the product demand? At the end of all of this I am extremely upset for dishing out all this money and still winding up on a losing end of this \"deal\"", "rating": 2}, {"title": "Poor customer service", "text": "It took 4 weeks to get my complete order delivered. One the day it was supposed to be delivered I called the Waco store to get a time frame and was told that my order was delivered to the wrong location and would be in on the next weeks delivery. On that next week when it was supposed to be delivered my table and dresser were delivered but not my bed. It took 2 more weeks to get my complete bed delivered. \r I got in contact with a Sam Watson from corporate and he was so helpful and even made sure my bed rails were delivered the same day as me talking to him. No one at the Waco store was helpful at all. Unfortunately, we won't make another purchase with Home Zone. \r Our dining table that we bought was delivered with a scratch on one side and one of the leaves doesn't fit in tight and secure. Very disappointed.", "rating": 2}]