[{"title": " Personal loan", "text": "I recently asked for a personal loan to cover auto deductions until I received some insurance funds were received. Having been a very long established customer I was upset when the loan was approved for a lessor amount. The very unusual extenuating circumstances were ignored and interest was very high. So I assume being a loyal customer doesn't count any more which leads me to consider moving my accounts to another business.", "rating": 2}, {"title": "Used Vehicle Finance", "text": "I financed a used vehicle. great rates but the loan agent was very unorganized. She took 2 hours to respond to an email and every time she did it was more question with things that are needed. If she had given me a list of the required things I could have given it to her all at once instead of it dragging out for 4 days. she also wouldn't tell my interest rate even though everything was approved. she just kept saying \" as low as 5.34%\" I didn't actually find out what the rate was until my paperwork was sent to sign", "rating": 2}, {"title": "Not the best experience", "text": "Not the best experience, employees were not friendly and borderline rude in answering my questions.  If it weren’t for the good rates, I would have gone elsewhere.", "rating": 2}, {"title": "Very helpful thank you", "text": "Very helpful thank you ", "rating": 2}, {"title": "Not good it was awful expensive", "text": "Date of experience: April 06, 2024", "rating": 2}, {"title": "Decent credit union, crappy bill pay provider", "text": "I liked most things about this credit union, but they use a 3rd party bill pay system that's very shady. I accidentally double paid a bill through bill pay and didn't have the money to cover the second payment. I didn't find out about it until I got a notice that my bill pay account was suspended. I called Dugood to arrange to have money sent to the account to cover the outstanding balance, but the bill pay company sent my account to collections without even talking to me about anything. I'll be closing all my accounts with Dugood and moving my money to another credit union.", "rating": 2}, {"title": "We have tried for 3 weeks to get a hold…", "text": "We have tried for 3 weeks to get a hold of Sandy F. Our loan officer . Left messg and had bank send email. Then called for anybody to call back after being told they were all in meetings . Still waiting 4 days now. Need a better response time please. Would appreciate feedback .", "rating": 2}, {"title": "The teller asked for my “Drivers…", "text": "The teller asked for my “Drivers License”, when I answered her that I don’t have a drivers license she gave me “the face”. This is my interpretation on that reaction “who in the world will go to a bank and doesn’t have a drivers license”. Of course it is MY interpretation and could mean something else for her. I gave her another valid card instead and was able to open a savings account. I hope next time that person is more aware of the facial expressions and body language they portray . I don’t intend to name the teller cause it reflects on the company as a whole. They are the face of the company thus they have to act accordingly.", "rating": 2}, {"title": "It was a %100 share secured loan added…", "text": "It was a %100 share secured loan added onto more than 1 time.  The loan was secured by my Mom's shares.  She and my deceased Dad, Charles Carrier have been members since the 1960's.   She is elderly.   I tried to call in advance so to reduce the time for her.  I was shut down by the Jada Kelley call center.  I was not even allowed to start the loan request application.Bottom line, the Jada Kelley Dugood FCU is out of touch with the members of the credit union she dictates.It took over 45 minutes to get the loan advance.  It was share secured.  Maybe 15 minutes and done.  Not at Dugood.  I work graveyards.  Dugood's ineptness caused me needed hours of sleep.  Respectfully,Doug Carrier409.626.4322", "rating": 2}, {"title": "I received a bill from one of my credit…", "text": "I received a bill from one of my credit cards that said that I was late on a payment because the card has not been paid by Dugood. They also are charging me late fees along with interest.", "rating": 2}, {"title": "DuGood offers the best service", "text": "DuGood offers great rates and a friendly staff that go out of their way to provide excellent service.  It is why I kept my account for over 20 years", "rating": 2}, {"title": "How to claim my money", "text": "How to claim my money ", "rating": 2}, {"title": "Decided to open an account at Dugood…", "text": "Decided to open an account at Dugood after meeting 2 ladies at Wal-Mart handing out flyers advertising Dugood bank. The ladies said that dugood bank is a second chance bank and  would help people with small loans to repair credit. . So i waited at least a month, then  went in Monday Dec 3 to give dugood  a try. I brought my 3 year old with me because she had just had surgery and was still wearing  a neckbrace.  A lady walked me into her office,  she never introduced herself. Then in the middle of opening my account walks in another lady. She never introduced herself either. They both were just looking at me and my child funny.  Both were in the computer trying to figure out how to complete the questions i guess, because no one was saying anything. They were not very friendly. Finally they finished. I had a check i wanted to deposite. Low and behold they wouldn't  cash it. It would take 6 business days to appear in my account. They should have said that upfront.  I need to pay my rent by the 5th. I cant wait 6 days. Then i applied for a small loan at this \"second chance bank\" and low and behold i didn't get approved. This is not what i expected.  And the service was horrible.  Workers need to talk more and be friendly. No one in that location was nice. Its like the workers were mad at each other.  Atmosphere was cold with bad vibes.", "rating": 2}, {"title": "Lupe was dismissive and impolite.", "text": "Date of experience: July 27, 2019", "rating": 2}]