[{"title": "Need better customer service.", "text": "A lot of the clothes is size wrong so it’s hard to buy without being able to try on. None of the rainbow stores that I’ve gone to have fitting rooms so you can’t try on clothes but yet they give you a hard time when you’re trying to return closed it did not fit. Cashiers need to inform customers about their return policy and what’s returnable and what’s not so customers can make the decision whether they want to purchase the item or not. Not get a big surprise when they come back to return it if it doesn’t fit and they can’t. I’ve an issue twice already I’m done. Wasting my gas back-and-forth. I’ll be shopping elsewhere. ", "rating": 2}, {"title": "Rainbow has affordable clothing…", "text": "Rainbow has affordable clothing unfortunately after trying to exchange a pair of jeans with a receipt, I was told without the price tag on the pants they couldn’t be exchange. This is poor customer service. Especially since there isn’t a changing room available to try items on before buying. ", "rating": 2}, {"title": "I like you clothing but It appears that…", "text": "I like you clothing but It appears that you are always out of stock for the things that I go to your site for. I wear a Large and can never find the size in normal regular solid color shirts or tank tops with the shelf bra. Even hard to find when I go the Rainbow Shops store for them. Please stock more of the popular sizes as this has been happening for years across all seasons. I originally wanted long sleeve shirts but had to settle for short because it was available.", "rating": 2}, {"title": "Fabric description was incorrect.", "text": "I received my products but I am not pleased, you have got to do a better job at updating your product description. I was looking for leggings based off the fabric description I had from some I had already bought from you guys in-store, and since I haven't been able to find them whenever I go to your stores I decided to look for them in your website and out of all of your options I choose the ones matching that description, but as it turns out the leggings I received don't look or fit the same and the tag describes a different fabric as well.***Reply to Rainbow review***Luckily I was able to return them for a full refund at a store nearby, with no issues. But to answer your question, the fabric on the tag said they were 95% cotton and 5% spandex. Which I have already tried but they ripped pretty easily unlike the ones I was looking for.", "rating": 2}, {"title": "Make Sure They're Not Sending U Used Items…", "text": "I purchased a pair of used cream colored boots with permanent light pink markings on them back in February. Me knowing that Rainbow online will send you used merchandise, I should've been more vigilant but I was in the process of getting a new place and just glanced over a boot and put it back in the box. Everything was fine until March when I actually took them from the box and got into my new place and saw all of the markings on the boots. All over both boots. The heels in different spots. I was so hurt, not surprised though. I called Rainbow to let them know. They responded about their 30 day policy. I sent in an email and got the same response. I reported them to the BBB because they have a problem taking back their used defective items over 30 days old but they don't have a problem sending customers used items or with HEPA violations.", "rating": 2}, {"title": "Strength and longevity needs attention.", "text": "The delivery time and updates were awesome. The shoe sizes were accurate and the comfort level for the shoes were as expected. However, on wearing the strappy toe loop sandals for the first time, it burst. I received several compliments on each shoe including the one highlighted, but to be with a damaged new shoe on first wear makes me extremely cautious to wear the others in my order.", "rating": 2}, {"title": "I wanted to order 6 pairs of boots but…", "text": "I wanted to order 6 pairs of boots but every address I gave in Los Angeles said the order could not be sent to that address. When I reduce my order to two pairs of boots, the order was complete. Now I have to make separate orders and pay more for shipping", "rating": 2}, {"title": "My total purchase was way to high", "text": "My total purchase was way to high. And when I realized l can cancel my order it was too late. From $43 to $53It was my own mistake for not noticing sooner. There’s a Rainbow department store less than 10 min from my home. I could of just driven there", "rating": 2}, {"title": "Disappointed with customer service ", "text": "I made a large purchase and I wanted to add additional items before items were sent out to avoid shipping fee. I was told they couldn't add to my last order placed or adjusted shipping fee for me, THEY WOULDN'T NOT THAT THEY COULDN'T...", "rating": 2}, {"title": "i mad they  unfollow me on Instagram…", "text": "i mad they  unfollow me on Instagram and express shipping is too much for some cheap ass clothes so I hope my stuff comes on time because I paid $27 for one day shipping", "rating": 2}, {"title": "Charged wrong card after selecting another card, CSR was no help!!!", "text": "I selected ZIP pay for my order, added the card information and submitted. Rainbow pulled my VISA card on file and charged my regular visa card. I tried to cancel my order and called, and was told that once I hit submit button it is nothing they can do. I just placed the order a few minutes and they can't do anything???!! So disappointed because I am sure they can correct this matter since I called them immediately after the submit button and seeing that it used my VISA card. They must do better!!! The Customer service Rep. Rebecca didn't even ask for my order #. You'll definitely lose business like this, I was going to change the payment method by phone but was told it couldn't be done. Well, I'll return my order and get a refund.", "rating": 2}, {"title": "Mmeeh 🫤", "text": "Their prices are reasonable but feel like they should have more promotions/discounts where they have free shipping on certain days, lower the amount in order to get free shipping, or even sending coupons by email. Returning policy should change. My first order(about 4 months ago) I went to the store to do a return and couldn’t get my money back because I did not pay with a CC. I then had to pay for shipping to get my refund . They should do free returns and anything additional to that same order should be charged on the return.", "rating": 2}, {"title": "If I have to pay for shipping then I…", "text": "If I have to pay for shipping then I expect a timely shipping date especially since it is not the Christmas season. My shipping date keeps changing. I needed this before my trip. It should not take this long. You need to look into your shipping it makes you look unreliable. If this is happening now why would I  order for Christmas.", "rating": 2}, {"title": "Poor customer service", "text": "Customer service was bad no acknowledgment in store at all. Online price was different and wouldn't honor it. Not a good selection of items in junior sizes. Over crowded with racks not shopping friendly", "rating": 2}, {"title": "My goddaughter bought me a dress the…", "text": "My goddaughter bought me a dress the week before Mother's Day. I wasn't able to try on. It's too big. She doesn't have the receipt only a receipt on her phone. I was told that not applicable. That sucks...", "rating": 2}, {"title": "When checking out", "text": "When checking out, page kept sticking and after adding the respective billing and shipping address information, the incorrect billing address showed after order was placed, which was made through PayPal. I hope I get my order.", "rating": 2}, {"title": "15 minute cancellation window is a SCAM", "text": "I was trying to check the shipping before purchasing an item and accidentally bought it. Cancellation window is 15 minutes. I didn't even get the email until 20 minutes later to be able to cancel! What a scam.", "rating": 2}, {"title": "Difficult checkout process", "text": "I wasn’t able to create an account so I had to shop all my clothes for a second time bc I was using Klarna… once I got to the end, shop pay was giving me problems saying that the Klarna card wasn’t accepted, then I had to refresh the page , screenshot my Klarna card, then manually type it in twice for the order to go through. I was 🤏🏽 close to saying forget the whole order Fr fr.", "rating": 2}, {"title": "I ordered 3 pair of sandals", "text": "I ordered 3 pair of sandals. My email receipt showed 2 of the pair with size and color ordered which is correct the third pair I ordered which are the studded braided band slide sandals and I ordered them in white but the receipt didn’t specify a color so I’m worried I won’t get the right color", "rating": 2}, {"title": "Website is well put together and easy…", "text": "Website is well put together and easy to navigate. 10% discount code text to me would not work. Spoke to customer support who emailed a code and that did not work either. Otherwise experience was fine.", "rating": 2}, {"title": "I was disappointed making my purchase…", "text": "I was disappointed making my purchase today. I been a loyal customer for many years and when I try signing on to my account to make my purchase, I could not get in. I had to create a new account since I couldn't get into my account. After creating a new account, I still couldn't make my purchase under my account I had to make my purchase under guest status, this is ridiculous and upsetting.", "rating": 2}, {"title": "I was truly looking forward to…", "text": "I was truly looking forward to receiving my package, but my order was incorrect. The bag was marked as the size I ordered but unfortunately the item inside the bag was the wrong size according to the tag. Such an inconvenience.", "rating": 2}, {"title": "The sale price was great, return policy was not.", "text": "The sale price was great. The online ordering process was seamless and smooth. I did not like the fact that if items purchased online using PayPal were returned to the store, you can only receive store credit. Also, if items were returned via mail, there is a $7.99 fee deducted from the return. I think this needs to be changed. I give 5 stars for the price and 2 stars for the return policy that I had to search for to locate.", "rating": 2}, {"title": "I was given an option to spin a wheel…", "text": "I was given an option to spin a wheel for 10% off and was given a prompt that said you all would allow me to use 10% towards my purchase. I did not see an email from you all nor a text extending the offer to me.", "rating": 2}, {"title": "Won’t ship to my state?", "text": "For whatever reason two items in my cast had to be removed because they can’t ship to California. It didn’t explain why or an alternate option.", "rating": 2}, {"title": "So I spinned the wheel and it stopped…", "text": "So I spinned the wheel and it stopped on 10%, I did not get the 10% off my purchase. Now I will get all the text messages regarding whatever from Rainbow but no discount. Please discontinue that spin the wheel thing; if the customer will not get the 10%. I would have signed up for text messages anyways.", "rating": 2}, {"title": "Unexpected Tax Charge tacked on after shipping", "text": "Shipping cost I expect. Added taxes at end-- I did not expect. Other  online companies  do not tack on taxes at end. Taxes usually revealed before shipping!", "rating": 2}, {"title": "The missing shoes", "text": "You have some shoes in my local store (Desoto TX) and there is only two pair and 2 sizes that I can’t wear. I have talked to the store manager and she tried to assist. She was very kind, I have called customer service and was told the shoes are not on the site it can’t be ordered, I searched the site several times hoping they would become available, I’ve went to different stores in hopes to find this shoe. I like rainbow but, I’m very disappointed that I can’t find the natural plaid heel in a size 9. Style Zenon-01 SKU number 03-135-5506. This show is what drove me to the site and prompted this order. Why would you make this color and style and only have a small selection available?Thanks for listening…", "rating": 2}, {"title": "I wondered why I was charged twice for…", "text": "I wondered why I was charged twice for one item on my credit card but the rep could not give me a valid answer except to tell me to wait 4 business days and then call back.", "rating": 2}, {"title": "Correct item but wrong color and this…", "text": "Correct item but wrong color and this is the second time this happened. Back to back orders incorrect. Also, I am unable to return this items is very inconvenient.", "rating": 2}, {"title": "The website would not allow me to use…", "text": "The website would not allow me to use apple pay. I am very uncomfortable putting my card number in online. ", "rating": 2}, {"title": "Shipping cost too high and delivery takes too long.", "text": "I am not happy with having to pay $7.99 for shipping....especially when my order only contained 2 crop tops....that probably don't even weigh a pound. Then on top of that it still takes a week or more for me to get my delivery. I've ordered from other online stores and they usually offer free shipping....and a comparable delivery time even though they're shipping from a further location. Rainbow needs to do better.So I received a response back from Rainbow and there shipping cost and long delivery times. The message was that I need to spend a minimum of $75 to avoid the $7.99 shipping cost.....this is beyond ridiculous. I'll just shop at Shein which offers....more variety, about the same shipping time as Rainbow and free shipping. Thanks Rainbow....but no thanks.", "rating": 2}, {"title": "The size variety for some clothes is…", "text": "The size variety for some clothes is not as big and makes it upsetting when u add the utrm to cart but checkout the item is sold out without a back order option", "rating": 2}, {"title": "Ridiculous taxes for 2 items!!!", "text": "I didn't like the fact that they charged me so much tax for 2 pairs of sandals of $7 each and then I won't be getting my order until 10 to 14 days?  Like I said, this is the last time that I'm shopping at Rainbow!!!", "rating": 2}, {"title": "Shipping it too high and the sales…", "text": "Shipping it too high and the sales aren't as good as they use to be a yr or two ago Rainbow is starting to be expensive but yes shipping is too high", "rating": 2}, {"title": "WERE IS MY ORDER FROM 3/20/24 ", "text": "I placed my online order 3/20/24 (11 days ago)and still today (4/1/24) I have not received my order. My credit card account was charged on 3/23/24! What's going on? ", "rating": 2}, {"title": "It took me 4 tries to get this order…", "text": "It took me 4 tries to get this order placed. I was about to shop somewhere else because the amount kept changing and the payment would go through but then give me a message about the order changing. the my order was canceled. i decided to try it one more time.", "rating": 2}, {"title": "I like rainbow", "text": "I like rainbow, however every time I order from them online they send me the wrong sizes. Causing me to return 95% of the order. It's frustration.", "rating": 2}, {"title": "My order was cancelled and…", "text": "My order was cancelled and voided...called back to resubmit it....never got any mail back....no delivery yet??", "rating": 2}, {"title": "My order wasn't delivered although I…", "text": "My order wasn't delivered although I used the same address as always. Now I have to troubleshoot with FedEx.", "rating": 2}, {"title": "Only purchase shoes and jewelry due to…", "text": "Only purchase shoes and jewelry due to most of the clothes items that I have purchased from you has been damaged with the first wash are wear.", "rating": 2}, {"title": "Hi I read that purchases $35.00 or more…", "text": "Hi I read that purchases $35.00 or more were shipped for free instead am paying $47.plus 👀😯 including shipping.", "rating": 2}, {"title": "Customer Service Sucks", "text": "I placed an order and realized a few minutes later that I forgot to remove two items that I purchased via another site. I attempted about 8 times over the course of an hour to cancel the order and couldn't. I then emailed the company about an hour after I placed the order asking them to either remove the 2 items or cancel the entire order. They refused. They claimed the order was being processed and couldn't be cancelled. The email did say I could bring the items to the store, but that won't work. This is the 3rd time I ordered something from Rainbow, but the second time, I had two items that needed to be returned. I took the items to the store and was supposed to have received a store credit, but when I then went back to purchase something for my daughter, there was no money on the card. They had to uniform items and my man's money! Fool me once, shame on me, but I'd be dang if I'll let you fool me again. Although the mistake was my fault, there is no way in heck they began processing my order four minutes after I placed the order. Amazon doesn't work that fast! Shoppers beware.", "rating": 2}, {"title": "Rainbow Shops on Pyramid Village in Greensboro NC", "text": "At Rainbow Shops on Pyramid Village in Greensboro, NC. A worker name Nayear Idk if it’s the correct way to spell it. I was standing in front of the register where there’s 3 woman supposedly working but just talking, when I said to them I have a return one worker says she’ll do it rt here. The other ladies showed no interest in helping me. They left and went to the floor except Nadyear. I’m standing there in front of Nadyear and she says to me very very rudely, You’re gonna have to wait. I’m helping someone else. Mind you I’m the 1st and the only one in line at this time. I said that was rude and asked her name. Sadly the other 2 ladies didn’t look like they were there to work either. They’re trying to put all of the work on Nadyear. She seems to be bothered by it and the customers are getting the blunt of it. I don’t appreciate it at all. I spend to much money here to be handled so rudely by an employee. Also, when will the dressing rooms become available again. Employees says you just not to do so. It’ll probably cut down alot of returns.", "rating": 2}, {"title": "The active sets are too expensive the…", "text": "The active sets are too expensive the sales really weren’t sales no red bras wireless on sale", "rating": 2}, {"title": "They asked if I want it in sonnee and I…", "text": "They asked if I want it in sonnee and I payed for $8.99 for faster delivery and I still don't have my order yet and I ordered it on the 1 of December", "rating": 2}, {"title": "No Consistency in Shoe sizes", "text": "I ordered a size 10....because I'm a 9 1/2 ,I have ordered 10 before from Rainbow because the shoes would run small, well?? This 10 next to the 10's I've purchased prior are about a size too small, so these shoes would fit a person who is a size 7 or 8. And who has time to send something back? I'm MAD BUSY that's why I ordered it online, so?? I have to look for someone who would like them :(", "rating": 2}, {"title": "I wanted items shipped to a famils…", "text": "I wanted items shipped to a familys address, not a business.I was not given other options at checkout ?", "rating": 2}, {"title": "It didn’t let me use my discount or…", "text": "It didn’t let me use my discount or pick a delivery option, like how days do I have to get my clothes. I wanted to select 2 to 3 days shipping.", "rating": 2}, {"title": "I recently bought a chalkboard and it…", "text": "I recently bought a chalkboard and it arrived in a damaged condition, the board has a big crack from top to bottom I fwd an email & the response I received was in relation to a different purchase.  No one has replied to original email, poor customer service & i will not deal with this company again", "rating": 2}, {"title": "Don't order tights", "text": "I tried to order some tights, but when I checkout, amessage said some items couldn't be shipped to my address. I took the tights out and the order processed.  What's that about?", "rating": 2}, {"title": "Not quite what I expected", "text": "The bike shorts were comfortable but not made out of spandex and they were see-through. Not sure what I can wear underneath it so they wouldn’t be see-through. They were delivered quickly.", "rating": 2}, {"title": "I had to reorder several times before…", "text": "I had to reorder several times before my transaction could complete. To this moment I cannot access the tracking information. So I just know that my order has been shipped nothing else", "rating": 2}, {"title": "There were so many more items I wanted…", "text": "There were so many more items I wanted to purchase, but they don't ship to California. ", "rating": 2}, {"title": "Gift card not accepted", "text": "It took me 5 times before it accepted my gift card I received for Christmas", "rating": 2}, {"title": "You need more \"Plus Size\" Options!", "text": "You need more \"Plus Size\" Options!! We all come in different sizes 4x, 5x, 6x. You have that size listed but only one thing to  choose from. Be more diverse!", "rating": 2}, {"title": "My problem is with checking out it said…", "text": "My problem is with checking out it said Fred shipping over $35 with I had over that an when I check out it kept jumping no shipping to the amount with shipping added so when I click pay I did pay for shipping when I wasn’t supposed to I’m very disappointed.", "rating": 2}, {"title": "Difficult  when making a payment", "text": "Difficult  when making a payment  , I wanted  to pay with PayPal  or Klarna.  It went to Shop", "rating": 2}, {"title": "Free shipping to stores", "text": "All stores ship free to there store.We understand charges for a shipping to your home. And the amount DOESN'T MATTER..always free to store.", "rating": 2}, {"title": "I wish I could have had the option to…", "text": "I wish I could have had the option to pick up my item in the store. Shipping fees were expensive for 7 days service and I live next to 3 Rainbow Stores. Not pleased. Thank you  😕", "rating": 2}, {"title": "The shipping cost is way too high", "text": "The shipping cost is way too high. Especially if you need to return an item( as in this case I am returning item)", "rating": 2}, {"title": "I was promised free shipping on an…", "text": "I was promised free shipping on an order of 35.00 or more, my order is 91.01, order number is 4153255", "rating": 2}, {"title": "i haven’t got a tracking number or…", "text": "i haven’t got a tracking number or anything purchased about 2 days ago", "rating": 2}, {"title": "All was good until I added the tee for…", "text": "All was good until I added the tee for 5.98My jump suit popped off the order and never came back to check ouI still want my jumpsuit floral print", "rating": 2}, {"title": "The dress was not what I expected it to…", "text": "The dress was not what I expected it to be.  I purposely did not order a ribbed dress.  The material was also sub par.", "rating": 2}, {"title": "It's just didn't go as smooth as fast…", "text": "It's just didn't go as smooth as fast as I remember account was t remember and luckily I had shop app that went thru fine", "rating": 2}, {"title": "VERY LOW INVENTORY TO CHOOSE FROM", "text": "VERY LOW INVENTORY TO CHOOSE FROM. ALMOST OUT OF STOCK IN EVERYTHING MY SIZE AND I ORDERED ON THE VERY FIRST DAY I RECIEVED THE TEXT.", "rating": 2}, {"title": "I was offered a 20% off coupon if I…", "text": "I was offered a 20% off coupon if I signed up for emails/texts ( I think it was emails) and upon check out it wasn't honored.", "rating": 2}, {"title": "This website is never working properly", "text": "This website is never working properly. I have to struggle to search and final payment. Hate it.", "rating": 2}, {"title": "Review", "text": "Please look into offering more discounts or coupon codes for different purchases. There is not a lot of variety as far as offering appropriate clothing for women to wear at work or just even out to wear without feeling naked. Most of the clothing attire listed are mainly for teenagers or young women. Please also try to have more clothes that young boys and teenagers can wear. There just isn't a lot of variety.", "rating": 2}, {"title": "Online ordering difficulties & return time frame issues good jogger sets available tho", "text": "Online had to start over with my order multiple times. One scrolling on the site and pressing on the clothes to check the size as I was sent to the top which delayed me purchasing items before they sold out me filling up my car to make selections at the end was hard as site blocked me for adding multiple items in my cart not sure why. X6 items jogging suits are cute wish they were offered in bigger kids sizes. More options for two piece jogging suits. Colors & designs are needed lots of the same colors. Coat zippers easy to break discount should be had if can prove broken. 30 day return & store credit if tags are gone should be offered I don’t shop here over other places or spend as much anymore because returns are difficult & unreliable especially to loyal shoppers. No rewards program. When customers are spending a certain amount returns should be longer & or store credits given for items new no visible damage. Return policy is to strict & complicated (online shipping takes time too cutting into the time frame for return etc) more time is needed for return window ppl have busy lives working more hours to survive & have money to spend more time is needed as well for ppl gifting & or separated parents (example: my kids, father bought some clothes and brought it to her during her birthday but he bought it ahead of schedule by the time she got it and tried it on he did not fit he paid on his card. I tried to return it, but there was no option to use card payment history I believe he did not take a receipt, and or he missed placed it I then could not return the items that is when I stopped shopping with this store. That was a waste of $200-$300 dollars I ended up having to buy her more stuff & stuck with clothes I couldn’t use) I also bought expensive keychain & Jewelry that broke or didn’t work well smh I definitely have had quality issues but the stores are always organized but too full which is great but gets overwhelming at times but options good. Need 1x sizing I’m XL-1x active wear sets for kids & adults would be great. Overall I like the different designs on the jeans. I love when you are used to sell sets for kids that came with a jacket, a belt, jeans, and a shirt. This was a great thing for birthdays and events kinda of a one and done thing. Changing room availability is an issue to use in cities we are subjected to wrong size shopping change in isles is embarrassing because we can’t use the changing rooms this stop ppl from shopping. I appreciate the fact that the prices at a time can be affordable, especially with the economy change. I hope all this information was helpful staff as usually very friendly. Please add more items to online as MOA has more selections than city high traffic areas as I would like to purchase more items, but can’t access it that far out.", "rating": 2}, {"title": "Shipping too high for one item that…", "text": "Shipping too high for one item that can’t weight more than 2ozs! Disappointed!", "rating": 2}, {"title": "I wanted to get a discount code because…", "text": "I wanted to get a discount code because the shipping is so expensive $7.99 is way too much", "rating": 2}, {"title": "Having to register just to check out…", "text": "Having to register just to check out was annoying there just should be a continue to check out as a guest option", "rating": 2}, {"title": "So many missing items on my first…", "text": "So many missing items on my first purchase.  Highly disappointed.", "rating": 2}, {"title": "I got an XL Brooklyn jersey instead of…", "text": "I got an XL Brooklyn jersey instead of the 4X I ordered. :(", "rating": 2}, {"title": "I tried to set up an account and it…", "text": "I tried to set up an account and it doesn't even let u do it", "rating": 2}, {"title": "They didn't tell me the quality was low…", "text": "They didn't tell me the quality was low until it sold out!!!", "rating": 2}, {"title": "Shipping cost too high", "text": "Products and delivery are fine, so are prices,  BUT $8.00 FOR SHIPPING??? That's nuts.", "rating": 2}, {"title": "Annoyed", "text": "I dislike that you can't use Rainbow gift cards on the website only in the store.", "rating": 2}, {"title": "Need more clothes variety in the store", "text": "Need more clothes variety in the store I can see in other store that have more varietyThe store is Store Number 1848 E 167th StBronx, NY 10452", "rating": 2}, {"title": "The filters do not work correctly", "text": "The filters do not work correctly. For example, I put in 34C for bras- I was still presented with a bunch of bras without that size availability.", "rating": 2}, {"title": "Not what I expected", "text": "Not what I expected. I called customer service and the rep was very rude.", "rating": 2}, {"title": "My cart disappeared …", "text": "I put 2 pair if boots in my cart yesterday ...Today I went to purchase them and my cart was empty. I went online to place order and boots were sold out", "rating": 2}, {"title": "One of the tops you sent wasn't what I…", "text": "One of the tops you sent wasn't what I ordered.  I ordered 3 polo type shirts with the collar. You sent 2 of them. The other one was with the back out. Nothing I ordered. Thank you Joanne Douglas.", "rating": 2}, {"title": "Shipping time and fees are ridiculous", "text": "Shipping time and fees are ridiculous. $75 for free shipping us a rip-off", "rating": 2}, {"title": "Everything is always gone...", "text": "No point looking unless you wear a small.  Folks must live on here to get the wearable sizes.", "rating": 2}, {"title": "I put in my address the right one and…", "text": "I put in my address the right one and it came to 606 Yonkers Ave my address is 220 Yonkers Ave 16b", "rating": 2}, {"title": "None of my discount codes worked…", "text": "None of my discount codes worked anytime I order from you all.", "rating": 2}, {"title": "You can't try clothes on in the store", "text": "You can't try clothes on in the store, very inconvenient.", "rating": 2}, {"title": "stores good and everything but the…", "text": "stores good and everything but the cashier was rude and had an attitude.", "rating": 2}, {"title": "I just didn't fine my sizes on sale…", "text": "I just didn't fine my sizes on sale items. I hope that the shoes I  order will fit. Order 2 sizes larger.", "rating": 2}, {"title": "Your sizes r not true to size", "text": "Your sizes r not true to size. And processing took longer than expected.", "rating": 2}, {"title": "Charging for shipping", "text": "Said free shipping over 35.00 but charging me 7.99 for shipping", "rating": 2}, {"title": "So much money for shipping", "text": "So much money for shipping! And big company like you guys should have free shipping", "rating": 2}, {"title": "It stated it had free shiping with a…", "text": "It stated it had free shiping with a $35.00 order, but it charged me shipping.", "rating": 2}, {"title": "I ordered a jacket but was not…", "text": "I ordered a jacket but was not satisfied with the size guide. They have a section that says women tops but the information is not sufficient. Also there need to be a review section under the items personal are interested in", "rating": 2}, {"title": "Poor Quality Fabric", "text": "I ordered 53 items, so a very large order. Some of the items are ok quality but most of the fabrics are cheap and look like a kid cut them right out and it will disintegrate when I wash them. Making the most of it but very disappointed as I shopped Rainbow for many years and was shocked at how poor quality these items are.", "rating": 2}, {"title": "Shipping is high!", "text": "Shipping is high!! The shipping is almost as high as the item purchased", "rating": 2}, {"title": "Customer service does not try to work…", "text": "Customer service does not try to work with you.", "rating": 2}, {"title": "Alot Of The Items Is Online Only And…", "text": "Alot Of The Items Is Online Only And Should Be In Stores Especially Plus Size Items As A Plus Size Purchaser Its Inconvenient For Me Too Shop Online", "rating": 2}, {"title": "This new site is hard to shop.", "text": "I don't know WHAT happened to this site or when it changed but the user experience was AWFUL. It used to be perfect with a great shopping experience. The navigation has made it so much harder to find specific types of clothing you're looking for and there are no helpful filters when you do a search to specify the category/sizing/women & age group. I was shopping all last year without any issues and this experience was just disappointing.", "rating": 2}, {"title": "I have been a customer for a very long…", "text": "I have been a customer for a very long time and I never ever receive a discount 😪🥲", "rating": 2}, {"title": "Took forever to load..", "text": "Took forever to load... had to reset my password 4 times.... then my bag was empty and I had to re enter my items.", "rating": 2}, {"title": "The good thing is I like the…product", "text": "The good thing is I like the merchandise, but the zipper were damaged. If I would have return it I would have lost my shipping cost and to reorder I would had to pay another shipping cost. That will make me pay more than what the product is worth.", "rating": 2}, {"title": "Your shipping rates and no discounts sucks", "text": "Your shipping rates and discounts sucks….You have high buying just to get free shipping for your cheap low quality clothes. Your catch is this I went to two stores in my area, and couldn’t find not one of the items that I ordered…so a potential customer has to shop online and pay your high shipping or pay over a $100.00 dollars. I will not shop online anymore….and probably not my local stores….because of my immune system, plus the clothes in the stores looks dirty and low quality and not like items online.", "rating": 2}, {"title": "Please try to modify return policy for shoes I’m honestly so confused about this…", "text": "I’m honestly so confused about this policy of not being able to return a pair of shoes if you do not have the box. The manager just makes it your problem now that you have something you can not use and clearly don’t want. In my opinion that called money hungry, some type of accommodation should be made because of this mishap to satisfy the customer.", "rating": 2}, {"title": "No dressing rooms bring it home try it on too late", "text": "Rainbow clothing stores have no dressing rooms so you have to purchase the stuff go home try it on if it doesn't fit you have to make another trip back to return it but you only have 7 days to return the item you or own it that's pretty much making it a real inconvenience for people not many people can get out twice in one week to do shopping for themselves along with everything else they need to do housework food shopping children jobs but they choose not to have a dressing room cuz they want you to purchase the items and not have the time to get back there to return them more money in their pocket less money in our pocket regardless of how inexpensive their items are", "rating": 2}, {"title": "First time purchaser discount code…", "text": "First time purchaser discount code wasn’t provided to me for my purchase.", "rating": 2}, {"title": "Worst customer service ever", "text": "I used to order at least one a month from rainbow but their customer service is horrible they don’t help at all delivery is terrible I usually order for vacation or a night out i use to get delivery with 4 days now it’s a week if not more and I am located in Massachusetts where there is several rainbow stores I never get free shipping unless I spend an insane amount of money I never receive a thank you for shopping here is 20% off and I am over it", "rating": 2}, {"title": "They didn't let me use the 10% off but…", "text": "They didn't let me use the 10% off but I still order", "rating": 2}, {"title": "I made an order on May 30th I just…", "text": "I made an order on May 30th I just received it today June 11th. It was for my nieces birthday that was on June 8th. The clothes were okay. Multi-flex clip on RGB light + phone holder. The box was torn, buldging and sealing tape was covering the ripped parts. When she opened it the phone attachment was missing. I'm very disappointed. How can we fix this? Without it taking 10 days.", "rating": 2}, {"title": "I actually like Rainbow, but…..", "text": "I actually like Rainbow. I’ve been a faithful for customer for many years. The problem that I currently have is that they’re making customers pay for shipping now. They’ve gotten rid of the free standard shipping offer. Noooooo", "rating": 2}, {"title": "Had problems logging into my account", "text": "Had problems logging into my account ", "rating": 2}, {"title": "So i ordered a ton of clothes on line", "text": "So i ordered a ton of clothes on line. FedEx lost my package. I called rainbow who returned the money but told me that if a package is lost again by FedEx, it will be on me to deal with FedEx. So they hire a delivery company who lost your package, they have your money but they want you to fight with FedEx, they will not do a thing to help you. So I stopped ordering online. Very disappointed", "rating": 2}, {"title": "You charged my credit card but did not…", "text": "You charged my credit card but did not process my order. PayPal stated that the shopping cart was empty. I called customer service but they had no record of the purchase, so I had to re-order yet my credit card still has a pending charge. Also, my free shipping disappeared AND an item I had in my cart ran out of stock, most likely due to all these problems!!!!", "rating": 2}, {"title": "The app wouldn’t let me log in", "text": "The app wouldn’t let me log in! It wouldn’t let me reset my password!", "rating": 2}, {"title": "It took numerous times trying to check…", "text": "It took numerous times trying to check out for it to work. I had way more stuff originally in my cart. Everytime I tried to check out it wouldn't calculate the shipping for my address. I tried two different addresses. I was about to give up and it ended up working with just 2 items and my original address. Very disappointed.", "rating": 2}, {"title": "It kept giving me problems while trying…", "text": "It kept giving me problems while trying to pay for my items. It also kept saying enter a valid phone number even after I entered it multiple times. It took multiple tries and then I had to start the process over because it kept declining my payment and that also took several attempts before it went through.", "rating": 2}, {"title": "Considering my package was supposed to…", "text": "Considering my package was supposed to be delivered yesterday and it still has not arrived yeah not so good I want my package or I want my money back", "rating": 2}, {"title": "Refunded", "text": "One package was delivered with no issues. The second package was returned.Its been several weeks and the tracker tracked it back to their store.They refuse to refund my money.Update: Rainbow has returned my money.", "rating": 2}, {"title": "Clothes are cheaply made and sheer", "text": "Clothes are cheaply made and sheerOrdered 2 of the same item same size but different colors.. and they dont match up in size length. One is way shorter in front .Same exact shirt.   First and last time I will order from your company.", "rating": 2}, {"title": "Spin and Win (JK)", "text": "When I created my new account, I was offered a Spin and Win 10% discount that I couldn't even use. I kept getting error codes when I tried to use it. If the company doesn't want to give it away, it shouldn't be offered.", "rating": 2}, {"title": "App was frustrating", "text": "I was frustrated with the app because I wanted to remove one xl cami (last one on bottom) but could not because of the payment option at the bottom of page. It would not let me bring it up and update item. Finally I had to remove one of the size 3x black cami’s.", "rating": 2}, {"title": "Why on earth can I not use a gift card…", "text": "Why on earth can I not use a gift card to your store on your own website but then you don’t have the items on the site in the store? That’s ridiculous! You end up picking out things you like and then having to use my own money even though I have a perfectly good gift card. Not to mention your poor call center reps that are probably getting an earful day in and day out because they have to tell customers they have no way to resolve their issue and they’ve been dealing with this since JULY. Not good not good at all. You are extremely lucky I was so set on getting those sandals otherwise you would NOT have made a sale with me at all.", "rating": 2}, {"title": "I was not able to place order online", "text": "I was not able to place order online. I had to call customer service twice to get order placed.", "rating": 2}, {"title": "I could not connect to Klarna..", "text": "I could not connect to Klarna... using this app.", "rating": 2}, {"title": "I am trying to find my order", "text": "Date of experience: April 30, 2023", "rating": 2}, {"title": "I paid for 2 day expedited shipping…", "text": "I paid for 2 day expedited shipping only for it to take an entire 7 days to receive my package!", "rating": 2}, {"title": "The actual brick and morter RainBow", "text": "The actual brick and morter RainBow shop personnel were GREAT, it was the on line shopping and the klarma because I was charged double or tripple the price for the same item in the store without the tax and s&h", "rating": 2}, {"title": "Need to offer coupons", "text": "Date of experience: November 21, 2022", "rating": 2}, {"title": "Give more discount codes", "text": "Date of experience: April 24, 2024", "rating": 2}, {"title": "Never received my order", "text": "Never received my orderCan not find any communication from Rainbow Shops after they said they were looking into it and getting information from the shipping/delivery service,", "rating": 2}, {"title": "NO search bar on the website", "text": "NO search bar on the website. Had to hunt for what I wanted.", "rating": 2}, {"title": "Disappointed", "text": "As a long time customer gift certificate/vouchers would be nice", "rating": 2}, {"title": "Not please", "text": "It took me three days to sign in. I lost most of the things that had in my cart.", "rating": 2}, {"title": "Shipping wasn't free", "text": "Shipping wasn't free. N it should be. Or at least $25 n up is free shipping. Disappointing.", "rating": 2}, {"title": "I couldn’t order a sweater because the…", "text": "I couldn’t order a sweater because the site refused to let me put down a size.", "rating": 2}, {"title": "Not able to use my gift card when I…", "text": "Not able to use my gift card when I make purchases online. If it wasn't for that I would of gave 5 stars", "rating": 2}, {"title": "The shoes are huge", "text": "The shoes are huge. I could have gone a whole size smaller. Was disappointed I had to return them. Are they men's or women's sizes?thank youCathy Houseman", "rating": 2}, {"title": "I signed up for a 10% discount and it…", "text": "I signed up for a 10% discount and it didn't give it to me.  VETY disappointed", "rating": 2}, {"title": "My cart kept erasing and it would not…", "text": "My cart kept erasing itself and it would not let me use my 10% off anniversary coupon code at checkout. 😒", "rating": 2}, {"title": "The items that I selected disappeared…", "text": "The items that I selected disappeared so I didn’t get everything I wanted and I’m dissatisfied that shipping is $8.00", "rating": 2}, {"title": "Cheap", "text": "Your clothes are cheaply made. After a couple of washes no good", "rating": 2}, {"title": "Shipping sucks… paid for 2 day shipping…", "text": "Shipping sucks… paid for 2 day shipping express on Tuesday today is Friday and estimated delivery is  Sunday which is too late for my event.", "rating": 2}, {"title": "I love rainbow,  Checkout frustrating", "text": "I love rainbow, but website acting up. Doesn’t allow you to view entire cart. Had to purchase something I didn’t want because I couldn’t delete it.", "rating": 2}, {"title": "Clothes are great but you have to spend…", "text": "Clothes are great but you have to spend way too much to get free shipping that's ridiculous everyone does free shipping now", "rating": 2}, {"title": "Order delayed", "text": "Date of experience: November 18, 2022", "rating": 2}, {"title": "I had standard postage marked and it…", "text": "I had standard postage marked and it just added the express shipping by itself to my order today so I paid more than I planned to.", "rating": 2}, {"title": "I have an account", "text": "I have an account, but had trouble logging in! Kept getting error messages. I hope the order comes correct. Or I will be returning.", "rating": 2}, {"title": "Website was redirecting me for no reason", "text": "Date of experience: February 10, 2023", "rating": 2}, {"title": "One of the items did not arrive", "text": "Date of experience: January 24, 2023", "rating": 2}, {"title": "My gift card would not work.", "text": "Date of experience: December 02, 2022", "rating": 2}, {"title": "My package did not deliver", "text": "My package did not delivered", "rating": 2}, {"title": "The Rainbow App", "text": "The Rainbow app is slow. It takes forever to use the cart. It didn't use to be like that in IDK🤷", "rating": 2}, {"title": "Spinng the wheel", "text": "I spinned your wheel & got 10% off. When checking out the 10% wasn't deducted from my order.", "rating": 2}, {"title": "I didn’t get my 10% discount", "text": "Date of experience: October 05, 2023", "rating": 2}, {"title": "sizes are fitting smaller", "text": "Leggings fit were of women's when I ordered plus..Returning items ASAP", "rating": 2}, {"title": "You don’t accept your own store credit…company credit not acceptable onlibe", "text": "You don’t accept your own store credit but was told in the store it’s acceptable online. That’s fraud!!!!", "rating": 2}, {"title": "The navigation was not easy I removed…", "text": "The navigation was not easy I removed one order and it deleted the whole order and I had to start all over.", "rating": 2}, {"title": "No customer service the cashier was…", "text": "No customer service the cashier was more interested in what she was doing in the night than assisting me.", "rating": 2}, {"title": "Lets Like Y'all Forcing Us To Spend…", "text": "Lets Like Y'all Forcing Us To Spend More Then We Want. I Feel Like $60 Should Get You Free Shipping!", "rating": 2}, {"title": "The price requirement for free shipping…", "text": "The price requirement for free shipping is too high.", "rating": 2}, {"title": "Honestly im very dissatisfied …", "text": "Honestly im very dissatisfied and disappointed the dresses,skirt, and overrall/romper  I bought for my daughter looked super cute and they were having a sale so i figured why not buy them ive never bought from this site but ive been trying out new websites and being they have to wear uniforms three out of the four days at school I bought her a lot of denim dresses that she could wear instead of the uniform and idk if she's going to be able to wear them or if they'll even last because they're so POORLY made. I bought nine items and EVERY SINGLE ITEM is freying one of the belt loops is broke on two of the items one of the belt loops is missing altogether on one of the items they're all freying super bad one of the buttons is barely hanging on a few of the dresses are coming apart at the seam etc these clothes are cheaply made the only one out of all of them that seems like it might last is the skirt the fabric is a thicker denim then the dresses and it was only freying a little but all the dresses are super thin and very cheap. Im so upset about this because I wanted to love them my daughter helped pick them items out and she was super excited about getting them today! If it was one possibly two items then i would be a little more understanding but for EVERY SINGLE item to have a defect bad freying/quality its just simply unacceptable. I have pictures and videos of the items I purchased and the state in which I received them in.", "rating": 2}, {"title": "Not enough online really nice cloth for…", "text": "Not enough online really nice cloth for plus size women for sweatsuits & club dresses.", "rating": 2}, {"title": "It would not allow me to use coupon…", "text": "It would not allow me to use coupon from Rainbow to get 10% off. Would not accept code.", "rating": 2}, {"title": "Items look very small for size ordered", "text": "Date of experience: August 18, 2023", "rating": 2}, {"title": "Shipping cost as much as the item", "text": "Date of experience: December 14, 2022", "rating": 2}, {"title": "I have not received my order", "text": "I have not received my order. Said it was to be delivered 3/25/22. Where is my order.", "rating": 2}, {"title": "See above!", "text": "I didnt get the shipping discount at all and I DID BUY OVER $75 worth of stuff!", "rating": 2}, {"title": "Disappointing", "text": "The checkout and password change was terrible. They need a better system.", "rating": 2}, {"title": "Never ordering from rainbow again!!!!!!!!", "text": "My order was canceled with no given reason and customer service SUCKS!!!!!!!", "rating": 2}, {"title": "No coupons was given to me online store", "text": "Date of experience: October 05, 2022", "rating": 2}, {"title": "I didn’t get the 10% discount I was promised. I put in the code. This is my first order", "text": "I didn’t get the 10% discount and I entered the code", "rating": 2}, {"title": "Everything I needed was out of…", "text": "Everything I needed was out of stock🥲🥲🥲🥲", "rating": 2}, {"title": "I was trying to use Apple Pay and it…", "text": "I was trying to use Apple Pay and it choose the shipping method for me smh", "rating": 2}, {"title": "Pd for overnight shipping where's my…", "text": "Pd for overnight shipping where's my order..no tracking available", "rating": 2}, {"title": "Too expensive shipping and the rest you…", "text": "Too expensive shipping and the rest you charge", "rating": 2}, {"title": "Didn’t let me use the coupon", "text": "Date of experience: June 16, 2023", "rating": 2}, {"title": "I couldn’t get the promo code", "text": "Date of experience: August 09, 2023", "rating": 2}, {"title": "It's really hard to get klanar with…", "text": "It's really hard to get klanar with your payment options.", "rating": 2}, {"title": "You offer a 10% discount not allowed to…", "text": "You offer a 10% discount not allowed to use on my first order.", "rating": 2}, {"title": "Website is malfunctioning specifically…", "text": "Website is malfunctioning specifically in the cart updates.", "rating": 2}, {"title": "Unable to get full order because sold…", "text": "Unable to get full order because sold out before purchase", "rating": 2}, {"title": "Did not have Navy shoe and size 😞", "text": "Date of experience: July 24, 2022", "rating": 2}, {"title": "Spent as much on shipping as I did the…", "text": "Spent as much on shipping as I did the clothes", "rating": 2}, {"title": "DID NOT HAVE AN ITEM IN STOCK AFTER I…", "text": "DID NOT HAVE AN ITEM IN STOCK AFTER I ORDERED IT.", "rating": 2}, {"title": "More sandals in size 12 would be great.", "text": "Date of experience: May 08, 2022", "rating": 2}, {"title": "I could not enter discount coupon", "text": "Date of experience: July 10, 2022", "rating": 2}, {"title": "The return process is TOO DIFFICULT…", "text": "The return process is TOO DIFFICULT especially for online orders. They should tell people that not all Rainbow stores returns are accepted. I couldn’t return Children’s clothes at one store because they do not sell Children’s clothes. Please advise that in the return policy to let shoppers/costumers know. Then I drove another 10 minutes to return it to a mall that couldn’t do returns because the mall was going under renovation by the following week. The lady seen my distress and seen that I drove two towns over so she went ahead and returned the items. Thank goodness for her. I had 9 other items I had purchased but 3 of the items ran way too small so needed to be returned.At the second store the people were friendly at the mall (Lafayette Square) but the staff was rude in (Speedway) they also need to have signs on the door that say WE DO NOT ACCEPT CHILDREN’S RETURNS!!! Also to return by shipping is $7.95 which deducts from your refund or you can pay at FedEx upon arrival. Which that is another inconvenience because not everyone is close to a FedEx. I guess it was a better option then being compared to the gas I used driving over from Nowheresville to the city then making two additional stops. Rainbow on return policies please do better. The shipping was “incredibly fast” and there is a lot of variety on their website and in stores. If it wasn’t for the horrible return experience and unreasonable staff (Speedway) I would of rated higher. It Seems to me the company wants to keep your money and make all sales final. I question if overall it’s a demographics issue because I clearly seen who mostly shops at these stores. Which that itself seems discriminatory within itself that these companies treat you based on the overall demographics of the shoppers which is morally wrong. They didn’t do this at Target, Abercrombie or Kohls when I returned things the previous day. Worse case scenario I would of disputed the items on my American Express Card. Hint* another reason why the lady went ahead and did the return. AMEX doesn’t play around with companies/stores not honoring store return policies. Seems like Rainbow does this at a discretion. So I can no longer shop at these stores due to the hassle of returning and the un-politeness of the staff.", "rating": 2}, {"title": "Could be easier", "text": "This app is hard to navigate and search", "rating": 2}, {"title": "SHIPPING IS RIDICULOUS", "text": "Date of experience: June 24, 2023", "rating": 2}, {"title": "Do some", "text": "Do some nice glitter and dress", "rating": 2}, {"title": "Stuff was missing", "text": "Date of experience: August 16, 2022", "rating": 2}, {"title": "Shipping fee", "text": "Shipping fee is TOO high!!!!", "rating": 2}, {"title": "Damage Sandals", "text": "Date of experience: August 24, 2022", "rating": 2}, {"title": "Shipping costs too much", "text": "Date of experience: April 06, 2022", "rating": 2}, {"title": "Delivery is too long.", "text": "Date of experience: April 21, 2022", "rating": 2}, {"title": "Where are my order", "text": "Where is my order", "rating": 2}, {"title": "I love this store", "text": "Date of experience: March 21, 2022", "rating": 2}, {"title": "You should have reviews on the website.", "text": "I purchased 2 tanks based on the material I usually get 1X they are so tight. No reviews on the website and returning is not easy. I ended up just giving them away. I have to rethink every purchase now.", "rating": 2}, {"title": "Disappointed that there are no…", "text": "Disappointed that there are no notifications when something is low in stock, or sold out.", "rating": 2}, {"title": "awful shopping experience", "text": "The site is awful for redirection after selecting an item for purchase. Having to keep resetting the filters, then trying to scroll back to where you were is very frustrating. I just quit shopping.", "rating": 2}, {"title": "Shoes are exactly like picture very…", "text": "Shoes are exactly like picture very cute they seem to be comfortable so far shipping was bad took forever for it to be delivered but other than that price was good", "rating": 2}, {"title": "You sent me a text to call and I called…", "text": "You sent me a text to call and I called and the woman was very rude that was on the phone", "rating": 2}, {"title": "The web site kept crashing and or…", "text": "The web site kept crashing and or repeating itself I tried on different devices took to long to shop good thing I had insomnia", "rating": 2}, {"title": "I wasn’t able to delete an item out of…", "text": "I wasn’t able to delete an item out of my cart because the Klarna add was covering the last item in my cart causing me having to purchase it when I wanted to take it out of my cart. The black slippers were the last item in the cart and I rotated my phone went to desktop view and still was unable to press the X button because the placement off the ad was on top of it.", "rating": 2}, {"title": "Where is my order I’m going to an…", "text": "Where is my order I’m going to an important event tomorrow out of town and my order has not been delivered !", "rating": 2}, {"title": "I have been shopping it rainbow for…", "text": "I have been shopping it rainbow for some years now. It's like the material is not what it seem to be on the website. Lso you have hardly anything in stock for my size. Might as well take the picture of the item down. Most designs of the clothes don't fit average real plus size women. I try to find things to ntinue to support but I get disappointed almost every time. Plus update plus size wear give us some clothes the camflauges the mid section and still looks sexy.", "rating": 2}, {"title": "Late delivery", "text": "Kinda upset was expecting my delivery a few days ago. I hate waiting on packages scheduled for delivery but doesn’t show up until whenever it does (if) it does because it’s no longer giving me any updates just pending and my patients is thin. I expected the delivery information to be accurate. I could have went in the store and bought the s*** by now delivery is taking  toooooo long", "rating": 2}, {"title": "Tracking my delivery!", "text": "To begin with online clothing was Limited, after submitting a small order I selected my delivery options but there was no choice to leave a note or further directions on delivery! I am not receiving updates on my delivery. The last one I received was yesterday stating I would receive it that evening and it never arrived. If I do not receive my order by tomorrow I will be contacting rainbow and submitting a grievance/complaint!", "rating": 2}, {"title": "System Changed shipping address to billing address", "text": "The online system kept changing the shipping address to the billing address. After several attempts I finally got it corrected. When I received my order confirmation both the shipping and billing address was the same. I immediately notified customer service. I was told, too late already shipped. REALLY Rainbow, so I paid shipping twice 😡", "rating": 2}, {"title": "Well i just placed an order 5 minutes…", "text": "Well i just placed an order 5 minutes ago so we shall see.", "rating": 2}, {"title": "Website kept crusing", "text": "Date of experience: February 01, 2022", "rating": 2}, {"title": "I wanted to pay with rainbow estimated…", "text": "I wanted to pay with rainbow estimated payments. It was not on there webpage and it charged me the entire amount instead", "rating": 2}, {"title": "Multiple issues with last few…", "text": "Multiple issues with last few purchases. Missing items. Phone customer service representative not willing to help. Multiple reps disconnected phone call. Promo code not applied.", "rating": 2}, {"title": "Two different prices for everything.", "text": "Date of experience: January 22, 2022", "rating": 2}, {"title": "Had a very hard time Login", "text": "Had a very hard time Login.  It took too long", "rating": 2}, {"title": "Luv my purchases but delayed shipment", "text": "I love the items I purchase, it just take entirely too long before your order is filled, it take a long time before they send out the items you’ve purchased and it takes a long time before you can receive what you’ve purchased.", "rating": 2}, {"title": "Shipping to Expensive", "text": "Shipping…you never give a discount or give free shipping every once in a while like other stores. Start doing it. Free shipping on $75 orders is not a deal or perk, please", "rating": 2}, {"title": "Coolbeans", "text": "The website is awful it is really wacky rainbow really needs help in providing better service when applying for an account when exiting from your purchases really bad experience with the website", "rating": 2}, {"title": "Never received my package in the time…", "text": "Never received my package in the time frame I was given It was suppose to arrive 2 days after placing my order yet I'm still waiting for it and it's been 4 days since I placed my order. I hope it still arrives as the things I ordered were all needed for a photoshoot :( rainbow should consider reward programs for loyal customers and exclusive promo codes for those that spend a certain amount.", "rating": 2}, {"title": "I was suppose to get 18% off of my…", "text": "I was suppose to get 18% off of my order and I did not!!! My first time ever getting anything from Rainbow", "rating": 2}, {"title": "I never got the 10% off my order of $85…", "text": "I never got the 10% off my order of $85 as advertised!  When I called, I was told to wait 24-48hours and would possible receive it in my email or junk mail.  In the meantime, I missed out on 2 items that were no longer available bc of this utter delay.  Much to my chagrin, I had to select from items that had to suffice but was totally disappointed at such a seemingly delay that should’ve been given at the time of my purchase!", "rating": 2}, {"title": "My navy blue joggers came damaged there…", "text": "My navy blue joggers came damaged there was like a bleached out huge spot on a leg", "rating": 2}, {"title": "Website needs to be overhauled", "text": "Website needs to be overhauled. Looks very outdated and pages freeze and load with no visible products regularly. Cart shows as empty, then when you refresh products appear.", "rating": 2}, {"title": "Unable to get into my account after…", "text": "Unable to get into my account after registering again n again. I don't think I'll be ordering again until this situation is rectified", "rating": 2}, {"title": "My order said delivered but I have yet…", "text": "My order said delivered but I have yet to receive my order . Have contacted customer service through email several times and have yet to receive a response. This type of behavior is unacceptable. I’ve order from you guys on several occasions and never had an issue but this time I just don’t understand your customer service when it comes to issues and I’m very disappointed in you all as a company . You may have lost a loyal customer after this incident.", "rating": 2}, {"title": "Shipping is to high", "text": "Date of experience: December 15, 2021", "rating": 2}, {"title": "I don't like the new app the…", "text": "I don't like the new app the configuration of the app and the online store are not even compatible/and or connected to one another. Both the app and the online store should be on one Accord", "rating": 2}, {"title": "I can’t add the apt number", "text": "I can’t add the apt number. It asked me to input it. But I was not able to", "rating": 2}, {"title": "It wouldn't take my coupon code it gave…", "text": "It wouldn't take my coupon code it gave me for an additional 10% off for being a first time customer", "rating": 2}, {"title": "Didn’t get discount", "text": "I was supposed to get 10% off and I didn’t which sucked.", "rating": 2}, {"title": "They didn’t have a lot of sizes", "text": "They didn’t have a lot of sizes to choose from .", "rating": 2}, {"title": "Bring back $50 free shipping!!!", "text": "Bring back $50 free shipping!!! I have been a rainbow shops in-store and online shopper for 10+ years, I know its a pandemic, but you should have kept it at free shipping over $50.  Your store is gaining many new customers daily I'm sure, please make the shipping free at 50 or 25 or more, you will get more customers.", "rating": 2}, {"title": "I had purchased a pair of pajamas and …", "text": "I had purchased a pair of pajamas and  took them back to the store the next day. I was told that they could not be exchanged. I called your customer service number and spoke to a representative who called the store manager and advised her to let me exchange the PJ's.Thiswas a great inconvenience.There was No apologize or anything offered by Rainbow Customer Service Representative.", "rating": 2}, {"title": "Delivery days are not reliable", "text": "Delivery days are not reliable.  I placed my first order on November 27, 2021 and to date, (December 7, 2021) there is no expected delivery date from FedEx.   Just two days ago the tracking information showed my order an hour and a half away from my shipping address and yet it still has no delivery date.  Very disappointing.", "rating": 2}, {"title": "Rainbow accepts Zip payments.", "text": "I originally gave a better review but afterwards I received from Rainbows saying one of my items had been \"refunded.\" No explanation why. My guess is that they sold out of the color or size but there was no option to replace the item. This is very annoying. Now I have one item coming. I think. Also, not sure how this might effect the initial Zip installment.My purchase was straight forward and easy. I did it through the ZIP app which was a tiny bit confusing but I figured it out. Can't wait to get my items. My only complaint is that since you offer Zip I would love if Afterpay and Klarna were also options. They are easier to navigate.", "rating": 2}, {"title": "I Need exchange one  my  items for  a…", "text": "I Need exchange one  my  items for  a bigger size .", "rating": 2}, {"title": "First and last time!", "text": "Hard to find size and when they said it was available it was removed from the cart. Lost out big!!!!", "rating": 2}, {"title": "The jogger stretches to two size up as…", "text": "The jogger stretches to three sizes up as you wear it...thumps down!", "rating": 2}, {"title": "You should add free shipping", "text": "Date of experience: November 27, 2021", "rating": 2}, {"title": "Rainbow is a hit or miss company…", "text": "The prices for items at rainbow are great. Low and reasonable prices for all items which is a plus. However the reason I give it two stars is because the items are cheaply and unevenly made. Pants legs longer then the other, holes in shirts after one wash, tread hanging from every item, and weird sizing on clothing. Rainbow is really a hit or miss. Sometimes you’ll get something made perfectly and other times you’ll get crap.", "rating": 2}, {"title": "I shop with Rainbiw frequently...my…", "text": "I shop with Rainbiw frequently...my issue is with delivery its been 5 days and No update  on where my package is it has said the same thing for 5 days. Use a different delivery service!!!", "rating": 2}, {"title": "Shipping takes too long!", "text": "Date of experience: November 16, 2021", "rating": 2}, {"title": "It was difficult to find my size…", "text": "It was difficult to find my size online. I used the filter to find my size and it still showed all sizes which made shopping online longer and more annoying. Please fix that for me. And please stay in stock on bottoms size 13. Its funny how that size is always gone!", "rating": 2}, {"title": "I had to reopen rainbowshops on-line…", "text": "I had to reopen rainbowshops on-line account. For some reason accounts opened before August of 2021 had to go through the whole re applying... what gives??? And this was after I kept getting an \"invalid password\" message over and over again. I think a heads up message would have been nice.", "rating": 2}, {"title": "Sent the wrong size sweater", "text": "Sent the wrong size sweater for one of the items and I really wanted that sweater more than any of the other 2 sweaters I ordered. Also you said you would send me 20% coupon for the issue and I have not received the coupon yet!", "rating": 2}, {"title": "Disappointed", "text": "The item was way to small. They should notify customers that they run small not true to size.", "rating": 2}, {"title": "Do not have my teenage daughter size in…", "text": "Do not have my teenage daughter size in jeans", "rating": 2}, {"title": "Not a friendly customer representative", "text": "The Representative wasn't friendly like the  other ones I'm use to just dry speaking, but it's okay cause it won't stop me from ordering from rainbow again, cause I love rainbow, maybe she was just having a bad day.", "rating": 2}, {"title": "Shipping is crap", "text": "This shipping process if a bunch of crap.  All along my delivery date was 11/6/2021.  Today is 11/8/2021 and it says delivery date is pending.  What the heck...why is it late.", "rating": 2}, {"title": "Go deals but, no longer ships to California :-(", "text": "No longer ships to California and other places. I had to send out of town, then have them send to me. Sort of a headache... SMH...", "rating": 2}, {"title": "Ordered 7 pairs of sneakers", "text": "Ordered 7 pairs of sneakers, size 11 for me, and 1 pair of 9s for my granddaughter. None fit me, the 11s fit her. I usually wear a10 1/2-to 11. She wears 8 1/2- 9. So disappointed.", "rating": 2}, {"title": "Discounts do not work", "text": "Discount code doesn’t work thumbs down", "rating": 2}, {"title": "Put the wrong address on my order", "text": "Date of experience: November 04, 2021", "rating": 2}, {"title": "Left arm was bigger than the right…", "text": "Left arm was bigger than the right arm…under arm ripped during outing.", "rating": 2}, {"title": "Shipping way  too expensive $14.99 omg.", "text": "Date of experience: October 31, 2021", "rating": 2}, {"title": "I paid for two day shipping for an item…", "text": "I paid for two day shipping for an item I needed on Friday. Site policy states orders placed by 12PM est will arrive two days from that date. I placed my order Wednesday at 6am est (for Friday delivery). It did not ship until Thursday around 3pm est (for reference, other expedited orders I placed from other vendors that day shipped by noon the day of my order). The order arrived Saturday evening, though the company did refund my expedited shipping fee. This did not help my situation, but it was very much appreciated. I would say they are not reliable if you need expedited service, though they do have quick, good, customer service.", "rating": 2}, {"title": "The main reason is y’all do not check…", "text": "The main reason is y’all do not check y’all  sizes before y’all send the items out happen too many times get it together now", "rating": 2}, {"title": "My 1st order went smooth i havent even…", "text": "My 1st order went smooth i havent even receive my 2nd set of items as yet far less havent receive no notification on the 3rd set i order either and then to top it off i notice after these 3 orders i have to now order item $75 and over to receive free shipping when it was $50 this is ridiculous on sooo many levels", "rating": 2}, {"title": "Help your loyal customers please", "text": "Some of my items were already out of stock. Also, it would be nice for discounts to be offered for customers who spend over a certain amount. This order was over $160 and my previous orders are sometimes over $200 and it would be nice to at least get a discount. Please consider", "rating": 2}, {"title": "Still haven’t received my package…", "text": "Still haven’t received my package passed up my home went to another town and could have been dropped off but package continued across the water to Norfolk all that way was unnecessary. The package was supposed to be scheduled 2 days ago today is 10/25/2021 2 days off from when it was supposed to be delivered", "rating": 2}, {"title": "You changed your free shipping to $75", "text": "You changed your free shipping to $75.  That is way too high for me.", "rating": 2}, {"title": "There are hardly any promotions going…", "text": "There are hardly any promotions going on as far as offering a discount on your order. There isn't a lot of variety when it comes to the kind of clothes being sold. Most of the clothing isn't age appropriate for anybody over 25 to wear and the amount you have to purchase to qualify for free shipping is outrageous.", "rating": 2}, {"title": "I spent a lot of time shopping and…", "text": "I spent a lot of time shopping and adding things to my cart, but at checkout it kept saying they couldn't deliver to my address. A few days later I get an email saying I left some things in my cart, so I try again and it goes through just fine, but now most of the items were sold out.", "rating": 2}, {"title": "It took to long for the add to cart and…", "text": "It took to long for the add to cart and checkout process.  I was not charged the advertised price (not happy about that at all)", "rating": 2}, {"title": "the free shipping rate of $50 or more…", "text": "the free shipping rate of $50 or more shouldve never changed to $75.", "rating": 2}, {"title": "I didn’t get any of the buy to or more…", "text": "I didn’t get any of the buy to or more discounts on my $700+ order", "rating": 2}, {"title": "I was unable to create a new account", "text": "I was unable to create a new account.  The website gave me a very hard time so I had to checkout as a guest.  I tried several times but was unsuccessful each time.  I called in but the representative was unsuccessful in helping me well.", "rating": 2}, {"title": "Shipping & Tracking", "text": "My order shipped out the very next day, GOOD! but once it came time for delivery.. it just stopped. I was no longer able to track it 1 week later. It didn't come when it said it would. I contacted Fed Ex & Rainbow customer service support.. both was not very helpful. I placed my order on 10/10 & today is 10/19 and I still haven't received my package or tracking info besides that it's still in Houston & have been since 10/16.  NOT A GREAT EXPERIENCE!!", "rating": 2}, {"title": "I was refused a size change & cancellation request", "text": "I asked to change a size in one sandal the same day I placed the order and they refused.They were unable to cancel the order either. The preferred if I returned the entire package to reorder *pathetic*I expressed how dissatisfied I was with their customer service team and they have yet to acknowledge me so here I am informing others of the treatment I received from Rainbowshops. Please be careful and be sure to place your order correctly", "rating": 2}, {"title": "I love rainbow I like how quick you…", "text": "I love rainbow I like how quick you sends out the items I order I love the clothes and prices. I can't wait to start ordering my Fall sweathers but some of there clothes and shoes run really small I always have to go up a size but I still love Rainbow!!!!!", "rating": 2}, {"title": "I order 4 items  size 7 when the order…", "text": "I order 4 items  size 7 when the order came they put in a size small which is too small they are not good", "rating": 2}, {"title": "THIS COMPANY DOES NOT HAVE COUPONS AND…", "text": "THIS COMPANY DOES NOT HAVE COUPONS AND DISCOUNTS AS THE OTHER SITES OFFER. I KNOW YOU FEEL LIKE YOUR PRICES ARE ALREADY LOW BUT U CAN ONLY SEE THAT UNLESS U SHOP IN THE STORES AND WITH THE DRESSING ROOMS CLOSED ITS A MESS.I WISH YOU OFFERED MORE WORKING CODES FOR MORE DISCOUNTS AND OIR ALLOW THE IN STORE COUPONS TP WORK ONLINE AS WELL", "rating": 2}, {"title": "Ordered all those items then to be told…", "text": "Ordered all those items then to be told that I had to redo my account.  Could not sign in after redoing my account and then had to order as a guest.", "rating": 2}, {"title": "Where is the sign out or logout…", "text": "Where is the sign out or logout located? Please clarify this in the settings or signing up area.", "rating": 2}, {"title": "sizing is all over the place", "text": "the shopping experience was not bad. I received my order very quickly. however, many of the item's sizes were WAYYYY off. I ordered most items in the same size - either 3 or 4x. I usually wear a 2 or 3. 2 of the 4s I could swim in and another I could barely move.. this makes it incredibly difficult to shop. it would be great if the website would allow reviews so people could know to either size up or down or stick with their usual size. very disappointing. about 1/2 of the order will be going back", "rating": 2}, {"title": "I was looking for clothes I can wear to…", "text": "I was looking for clothes I can wear to work. Your selection of clothes is very unatttactive. Nothing professional.", "rating": 2}, {"title": "Care about your consumers purchases.", "text": "I went to your store located at 1532 Southlake Pkwy Suite 5A to do a return, while in the store I located a pair of shoes that I wanted the money from the return to be applied toward.  The shoes that I was buying had a markdown, but the manager refused to give me the markdown price although I told her that there was another pair of the exact shoe with the same markdown price she totally refused to give me the markdown price and listen to what I was saying.  I have to say that the cashier checking me out explained that she was new to that particular store and that she was a manager at another store therefore she would give me the markdown price because it showed on the other pair of shoes also.  Ms. Brown said that she would do it although she may get in trouble she would let another manager that worked at that store know.  Ms. Brown stated that an employee neglected to change the price she wanted to please the consumer because it was not their falk. I appreciate what she did because she valued the consumer purchase in spite of the mistake made by one of their employees.  I was grateful for her valuing me as a customer therefore I thanked her and bought another pair of shoes as well.  I expressed to the cashier ( Latasha Brown) let me have her name and that I appreciated her for offering great customer service also. The other manager showed no interest in what I was saying and satisfying her consumer. I definitely wanted Ms. Brown to be recognized for her great customer service skills and I will be returning.", "rating": 2}, {"title": "2 of the eight joggers I ordered had…", "text": "2 of the eight joggers I ordered had holes in them", "rating": 2}, {"title": "Iam very  disappointed in my order", "text": "Iam very  disappointed in my order, I was not given yo me for free,I paid good money,I didn't appreciate it being stuffed in a bag totally  wrinkled.plus the quality was not as advertised, I've  purchased merchandise from Rainbow,and been quite  pleased, that is why this is such a huge disappointment 😞", "rating": 2}, {"title": "I canceled order still waiting for my…", "text": "I canceled order still waiting for my money to get put back on my card canceled it within 15 mins", "rating": 2}, {"title": "There is not selection of professional…", "text": "There is not selection of professional attire. To much crop. Not enough selection for people 50 and over", "rating": 2}, {"title": "I can't sign in to my account 😕", "text": "Date of experience: October 03, 2021", "rating": 2}, {"title": "Disappointed on Changes made to app", "text": "I am not a fan of the way you changed the Rainbow App. I used to faithfully order every week or every other week but now I don't because I don't like the fact that you can see the size chart like you used to. It would also tell you the size the model was wearing so you can get an idea on how it will fit you.", "rating": 2}, {"title": "cheap material", "text": "cheap material , and leggings were tried on then thrown into the bag inside out awful", "rating": 2}, {"title": "Nice selection HORRIFIC SERVICE", "text": "Nice selection, no mirrors, paired along with horrific customer service, specifically from the store manager, and if it’s bad there it’s not much else to say for this brand, store or the team. My experience was SO bad that I contacted their customer care team while standing there at the register, and filed a complaint against the store manager, in his presence! for the service that he chose to provide. This two star review is a for the variety of selection. ZERO stars for management and team.", "rating": 2}, {"title": "Keep on messing up my order", "text": "Keep on messing up my order. But other than that it was helpful and have a very blessed happy day!!!!          ~Mrs.Hooper", "rating": 2}, {"title": "The website is horrible", "text": "The website is horrible. I actually have an account, but everytime I sign in, I'm prompted to sign in. 😓You all have way better items in store.", "rating": 2}, {"title": "The app and mobile website are…", "text": "The app and mobile website are extremely buggy. I had to create a new account on the app since I couldn't log in or request a new password with my email address on either. After I placed my order on the app, the app closed. When I opened the app again, it does not show that an order was placed. My credit card was charged, so I know it went through, but doesn't look like I'll be able to track it.", "rating": 2}, {"title": "Website updates are horrible", "text": "Removed arrow to go back to top of the page. Unable to log into account and no option to see order history anymore", "rating": 2}, {"title": "Bad delivery service", "text": "i Just purchased clothes on September 21 it’s October 2nd and I have not received it I have no clue what’s happening and I can’t get them on hold", "rating": 2}, {"title": "It was ok a lot of size was not…", "text": "It was ok a lot of size was not available Sorry", "rating": 2}, {"title": "I do not like your new system", "text": "I do not like your new system. The website does not save my bag because I can’t sign in from there. The app is not much better. At this rate, you will loose a lot of my business.", "rating": 2}, {"title": "Difficultly placing order", "text": "Extremely difficult to make an order in app since the new update. Had to call customer service to complete my transaction.", "rating": 2}, {"title": "Defective sandal", "text": "I ordered three shoes but one was in complete ruin. The buckle band slide was completely defective. The strap was not secured to the sole of the shoe and the two segments of the sole were not sealed together properly. I live in the Caribbean, so to have it shipped back would not have made financial sense. I was very disappointed because I was looking forward to wearing it and even though the shoes are affordable, I'm thinking that the quality should not lend itself to such a deplorable state. I have since made another order with undeniable apprehension at the quality I will be receiving. I'm hopeful that the experience received was a one time event and that all my shoes in this order will be wearable.", "rating": 2}, {"title": "Shipping costs", "text": "The shipping was more than 1 item- you should get free shipping after $20", "rating": 2}, {"title": "Mostly everything that was in my chart…", "text": "Mostly everything that was in my chart had sold out. Rainbow needs to keep a size 12 shoes in stock.", "rating": 2}, {"title": "I still have not received my order n no…", "text": "I still have not received my order n no updates.so what's going on?", "rating": 2}, {"title": "Prices for plus size isn’t good like…", "text": "Prices for plus size isn’t good like for the other sizes", "rating": 2}, {"title": "U got my address wrong and i can't find…", "text": "U got my address wrong and i can't find a way to change it i hope my iteans dont get lost", "rating": 2}, {"title": "I order some slider and they didn't put…", "text": "I order some slider and they didn't put it on my order out was the leopard sliders with  red  and green  😑", "rating": 2}, {"title": "Can never find the items in the stores…", "text": "Can never find the items in the stores that are online so if you decide to purchase online you have to pay shipping if you place an order under the free shipping amount and the website is hard to navigate at times, especially the mobile site.", "rating": 2}, {"title": "Rainbow is my favorite store I always…", "text": "Rainbow is my favorite store I always shop with you guys. The only things is that on your active leggings you don’t always carry x-small size on the active wear pants, but other then that you are my favorite store to shop. Your prices are always low too! ✌🏼❤️", "rating": 2}, {"title": "I wish the shipping wasn't so high", "text": "Date of experience: August 30, 2021", "rating": 2}, {"title": "your shipping rates are ridiculous", "text": "your shipping rates are ridiculous. A $5.99 pair of shorts becomes $12.94, kinda hard to believe", "rating": 2}, {"title": "Damaged", "text": "One of the item had a hole in it and now I have to ship it back be", "rating": 2}, {"title": "Do Better", "text": "Well, the reason for the low rating Is 1) you don't offer in store pickup to assist with S&H.2) after pay isn't an option for payment. 3) The treashold for free shipping is $50...", "rating": 2}, {"title": "Web site and app not user friendly.", "text": "You guys changed ur website and the app is no better. I order online with you a lot. Use to be able to use filters to narrow down size and such. Nope, not no more! I don't have time to scroll through 900 black shirts. Also, There's no actual sign in now. No personal info in menu. What happened? Not a fan of the website now. Finding it to time consuming to find things and when I do it's sold out or size I need is out. Please put filters back. In the app too. I'm a big fan of Rainbow stores and I really love that the clothes have really improved. Please make online shopping easier. Thank you! My rating is solely based on online and app shopping. I give 5 stars for customer service and clothing.", "rating": 2}, {"title": "I love your clothes but your app is…", "text": "I love your clothes but your app is janky. I had to Uninstall and reinstall in a few times just so I could order.  It seems like if I close the app out I can't open back up. I have to uninstall it. Other than that it's all love", "rating": 2}, {"title": "Shipping price too expensive.", "text": "Date of experience: August 22, 2021", "rating": 2}, {"title": "Your asking for a code and you didn't given no code not good enough", "text": "No code is not good enough", "rating": 2}, {"title": "I wasn’t able to pay using my American…", "text": "I wasn’t able to pay using my American Express gift card I didn’t see the option available at all", "rating": 2}, {"title": "Shipping has taken forever", "text": "Shipping has taken forever. Still have not received my package after three weeks and no tracking updates. No one can answer for them", "rating": 2}, {"title": "Clothes aren't true to size.but I love…", "text": "Clothes aren't true to size.but I love rainbow.", "rating": 2}, {"title": "Took way to long to load payment page", "text": "Took way to long to load payment page. Whole process is very long.", "rating": 2}, {"title": "I am missing 2 items and this is not…", "text": "I am missing 2 items and this is not the first time this has happened.", "rating": 2}, {"title": "I never got my first package and now i…", "text": "I never got my first package and now i am watching to see if i get this package.", "rating": 2}, {"title": "I have not received my order as of yet", "text": "I have not received my order as of yet. I can not give a proper rating.", "rating": 2}, {"title": "The clothes run either to small or too…", "text": "The clothes run either to small or too big", "rating": 2}, {"title": "Untrustworthy....", "text": "I would have gave five stars but I was tricked into signing up with my email and I would have got a 10% discount code. The code was Invalid 🤷🏽‍♀️!", "rating": 2}, {"title": "I spent time searching this site…", "text": "I spent time searching this site yesterday for clothing at checkout everything I ordered disappeared 🙃.  I went into the store near the house and things were priced differently.  Today I did Place an order but it would have been to much trouble to start the full search again.  I was 😡upset.", "rating": 2}, {"title": "My shipment order number 26191423 was…", "text": "My shipment order number 26191423 was not shipped with the items I ordered. I just picked up my package from the address I shipped it to and 3 items were not in package. Round Toe Flats size 8 blue, girls rainbow checkered slip on sneakers size 2 and tie dye French Terry shirts blue large was not shipped.", "rating": 2}, {"title": "I ordered my items a while back and…", "text": "I ordered my items a while back and still have not received them not only have I not received them but there is no estimated delivery time. I ordered everything hoping it would be here before the 17th and NOTHING! This will be my last time ordering from them.", "rating": 2}, {"title": "I purchased  two  items  from your company", "text": "I purchased  two  items  from your company a pair of pants and a pair of slippers and I am very happy with my purchases. They both came on time and they were as pictured.", "rating": 2}, {"title": "Ordered my clothes for my upcoming trip…", "text": "Ordered my clothes for my upcoming trip They won’t arrive until after I am gone. I’m sorely disappointed. I don’t have time to go into the store because of my work hours.  They were supposed to arrive in 3-7 days and they won’t. It didn’t gong me the option of expediting my order for faster delivery. I was pleased with the selection and prices though.", "rating": 2}, {"title": "Excellent store", "text": "Date of experience: July 07, 2021", "rating": 2}, {"title": "I had a pair of black wax jeans that…", "text": "I had a pair of black wax jeans that was on clearance in my cart & before I could checkout it was gone. I was very disappointed as this was my first shopping experience with rainbow shops", "rating": 2}, {"title": "No reviews?", "text": "I hate the fact that there are no reviews. It's really like rolling the dice hoping these clothes fit well or are of decent quality. Probably my last time ordering if the clothes don't work out.", "rating": 2}, {"title": "I used to love the fit of the plus size…", "text": "I used to love the fit of the plus size jeans and pants. I spend lots of money with this store,but,my pass couple of orders have been a nightmare. Items fit like a junior size instead of plus size. I have recently found a new plus size store to shop at. I will miss shopping on the site,but, don't have time for the wait or hassle, perhaps the sizes will be better again in the future. Very disappointing.", "rating": 2}, {"title": "I keep seeing the same thing  over and…", "text": "I keep seeing the same thing  over and over.  were are the new designs..    long summer dresses,  flare short and long dress ,    summer sun hats..  to many bodycons.", "rating": 2}, {"title": "Took pages a long time to load", "text": "Date of experience: July 03, 2021", "rating": 2}, {"title": "I’m disappointed.org .", "text": "I’m disappointed.org .. bc I had a basket  full of dress and was trying to pay for it n it would it go threw. I lost all my dresses don’t remember what I had ..so had to do it like 4 times .. annoyed 😠", "rating": 2}, {"title": "I don't appreciate the high shipping…", "text": "I don't appreciate the high shipping prices 😡 and I don't appreciate the no availability of clothing sizes.. please restock more ofte.. are u guys going out of business or something", "rating": 2}, {"title": "Need more cute plus size options", "text": "Date of experience: June 26, 2021", "rating": 2}, {"title": "I have been waiting for a long time to…", "text": "I have been waiting for a long time to receive my merchandise very slow no one contact me to tell me situation on it or nothing", "rating": 2}, {"title": "Shipping cost", "text": "Date of experience: June 25, 2021", "rating": 2}, {"title": "Shipping was long", "text": "Shipping was long , even after adding extra items so it can arrive sooner it was still delayed. Size runs small also.", "rating": 2}, {"title": "Black pants ordered were horrible…", "text": "Black pants ordered were horrible quality seams between legs had holes in them now I will have to go to seamstress to try and fix pants extra money out of my pocket😡😡😡😡", "rating": 2}, {"title": "Frustrated customer", "text": "There are so many items the company broadcast on social media, but when you go to the Rainbow site it's out of stock. It would be nice if the company would discontinue circulating items that have been sold out for months without plans of a restock", "rating": 2}, {"title": "Where are the filters?", "text": "The website is fast and easy to navigate, however I did not find a way to filter the results of my searches. For example, I don't want to look through your entire wardrobe of dresses, one by one, and hope you have my size. I want to filter my size and have those results appear. There are too many clothing options on your site to not have filters.", "rating": 2}, {"title": "This site keep telling me that my order…", "text": "This site keep telling me that my order is incomplete because my email address is incorrect. But you send me a email. So is my order being process because my card information was entered.", "rating": 2}, {"title": "Will never order again", "text": "Date of experience: June 18, 2021", "rating": 2}, {"title": "Your website isn't user friendly.", "text": "Date of experience: June 17, 2021", "rating": 2}, {"title": "I didn't get an email receipt", "text": "I didn't get an email receipt.  And 5 days later, still no order confirmation or shipping notice.", "rating": 2}, {"title": "Wish there was more variety of options…", "text": "Wish there was more variety of options instead of the same ribbed shirt in 15 different colors", "rating": 2}, {"title": "The majority of items for sale were…", "text": "The majority of items for sale were sold out.", "rating": 2}, {"title": "Need updated options for plus size", "text": "Need updated options for plus size. Company shows no loyalty to loyal customers. We should be offered a substantial discount on our repeated purchases of their outdated plus sized clothes.", "rating": 2}, {"title": "Misleading website", "text": "The website needs to be frequently updated. The site displays clothing items and once you click the particular item(s) it’s sold out. Personally, I feel once an item or size has been completely sold out it should be taken down of the site. That’s very misleading.", "rating": 2}, {"title": "i give you this rate because most of…", "text": "i give you this rate because most of you items is outstock when you wanted to order need to updates your website more often", "rating": 2}, {"title": "Slow shipping", "text": "horrible shipping. I hate ordering online because the shipping always takes forever", "rating": 2}, {"title": "The website is poorly made/maintained…", "text": "The website is poorly made/maintained you have to log in every time even if you click \"remember me\". The website also buffers and takes a  long time for things to load.", "rating": 2}, {"title": "Was hard to navigate", "text": "Was hard to navigate. Pages are not numbered so i cant see how many pages i have to flip through.", "rating": 2}, {"title": "CCute clothes but that smells of mildew", "text": "The dress is really pretty and so is my Jean jacket I also got the red pants were beautiful however I must say that all of my clothes smell like they were in the basement they had a strong smell of mildew. I would not buy from rainbow.com again because of that", "rating": 2}, {"title": "I am not a fan of your check out…", "text": "I am not a fan of your check out process, it always tends to get hung up in the process.", "rating": 2}, {"title": "No one can tell me my delivery date", "text": "Date of experience: May 23, 2021", "rating": 2}, {"title": "My package was damaged and one of the…", "text": "My package was damaged and one of the clothes was damaged", "rating": 2}, {"title": "Everything is Sold Out!", "text": "Date of experience: May 21, 2021", "rating": 2}, {"title": "The clothing is beautiful but the Plus…", "text": "The clothing is beautiful but the Plus size clothing runs small and I dont get this I wear a 20 in women's clothing but a 3x is too tight fitting on me and even the jackets are tight on my arms at 3x", "rating": 2}, {"title": "Yet to receive delivery.", "text": "Date of experience: May 18, 2021", "rating": 2}, {"title": "Once you sign up you get a 10% discount…", "text": "Once you sign up you get a 10% discount and then never again. I've been a customer for over five years and never get any promos.The shoes I ordered, I had to order  online because each store was out of my size.  To boot, they are only $14.99 in the store but online they are $19.99.  That is ridiculous.", "rating": 2}, {"title": "Paid for items to arrive two days and…", "text": "Paid for items to arrive two days and now carrier put holiday and stop shipment,", "rating": 2}, {"title": "AWFUL. NEEDS WORK!!!!!", "text": "You’re app isn’t awful at all. Just wanted to grab your attention. I like the app itself and that you all give a description of what the models are wearing. It’s just a little difficult shopping online trying to figure out what will be see through or what will fit true to size. I suggest a review section where we could all post photos and give honest feedback on the clothing. Have a rating on the clothes and let the public let you know what’s higher quality then the next product. Customer satisfaction will rise as well as productivity.", "rating": 2}, {"title": "I paid for next day delivery and my…", "text": "I paid for next day delivery and my package 4 days later!", "rating": 2}, {"title": "They said the cost of the product would…", "text": "They said the cost of the product would be $7 if more them one is brought. I bought 5 and the pride was still $7.99. Maybe I got the discount i saw something in blue maybe that was my discount, It wasn't display good to me. I love your products, and I will buy again thank you.", "rating": 2}, {"title": "I wish we could order and pick up in…", "text": "I wish we could order and pick up in store", "rating": 2}, {"title": "That delivery dates and updates suck!", "text": "The delivery dates and updates suck!It take longer to receive my items.", "rating": 2}, {"title": "Would not allow me to sign in to my…", "text": "Would not allow me to sign in to my account or reset password", "rating": 2}, {"title": "Damaged item", "text": "My item of clothing I ordered arrived In plastic with stain on it. Was easily seen through plastic packaging but was shipped to me anyway.", "rating": 2}, {"title": "I used to love ordering from your…", "text": "I used to love ordering from your website but lately my orders are coming late and tracking is difficult and even one of your customer service reps missed up my tracking information and gave me a refund on something that was the wrong item.  She said it was my fault but I knew there was something wrong when I went to the website and seen the order was for $128 and she refunded $61. I called back to find out she refunded the wrong order. I tried to tell her to reverse the refund and fix the situation but she says she can't.  I don't want to take anything I don't serve.  I got that order but I didn't get another order number and she put an investigation on the tracking. The last 4 orders have been slow coming.", "rating": 2}, {"title": "Website is horrible", "text": "Website is horrible  it is extremely slow had to keep logging out and logging in . It took 39 minutes just to place an order .the website needs a upgrade", "rating": 2}, {"title": "I had thing in cart for me to purchase", "text": "I had thing in cart for me to purchase, when return they was gone.", "rating": 2}, {"title": "They give you a Promo code", "text": "They give you a Promo code, then when you try to apply it to your order, it doesn't work.", "rating": 2}, {"title": "Sizing were very irregular", "text": "Sizing were very irregular. Material on blouse and cover up very very thin.", "rating": 2}, {"title": "To whom it may concern", "text": "I love shopping for the dresses online. But honey the cost for the shipping is way to high. It’s almost the price as the original dress. I wouldn’t mind spending more money if the shipping was worth it.", "rating": 2}, {"title": "I applied a promo code and it did not…", "text": "I applied a promo code and it did not take the amount off of my order.", "rating": 2}, {"title": "I ordered 3 things all the same size…", "text": "I ordered 3 things all the same size and only 1 of them fit me. Your plus size clothes do not fit true to size. The only reason I didn't send them back was because I hate returning things and they fit my daughters who are quite a bit smaller than I am.", "rating": 2}, {"title": "Not enough to choose from in the colors…", "text": "Not enough to choose from in the colors I was looking for. Not enough variety in larger sizes.", "rating": 2}, {"title": "I use to love shopping at Rainbows I…", "text": "I use to love shopping at Rainbows I was truly excited about them having an online store but now y’all are such a disappointment. The clothes aren’t trendy anymore and the cost don’t match the quality of the clothes. Do better rainbows  !", "rating": 2}, {"title": "Not impressed", "text": "After placing my order I have received an insane amount of spam emails but no updates on my order. It has been two days past the latest date that my order was supposed to arrive and still nothing. Not impressed.", "rating": 2}, {"title": "Customer of 3 Yrs.", "text": "I was Overcharged on the Sales Tax; Our Sales Tax GA (Dekalb County) is 8% NOT 8.9% (Fulton County).  Also, the Customer Service Rep., Anastasia, claimed Customer issues can Not be \"Transferred\" to Management / Supervisors which was questionable.  I have since spoken w/ one of the Managers who is Super Professional & Courteous and I know she will diligently Solve my Sales Tax issue.", "rating": 2}, {"title": "I will never shop here again you guys…", "text": "I will never shop here again you guys told me my package found be here today and when I called fedex they told me it's still in arizona it's bine several weeks tell you the truth I just want my money back I will never shop here again and I will tell everybody about this  store", "rating": 2}, {"title": "One of the items I ordered was missing…", "text": "One of the items I ordered was missing and your customer service phone rep basically accused my of lying.  She also said she would give me a coupon for free shipping so I could order a replacement and she never did so I have to pay and additional $7 to order a $10 item that was missing from the original order and as far as I know, there will be no refund for the missing item.", "rating": 2}, {"title": "I'm still waiting for my order", "text": "I'm still waiting for my order, the delivery date, has been changed!😞", "rating": 2}, {"title": "Not enough color options", "text": "Date of experience: April 20, 2021", "rating": 2}, {"title": "I never received my 10% off for signing…", "text": "I never received my 10% off for signing  up online and shopping online.", "rating": 2}, {"title": "Takes forever to replenish stock", "text": "Takes forever to replenish stock, I log in everyday to check on basic Tops like camis and they are still sold out for 2 plus months in size so I wait and I check everyday. That sucks but other wise some items are a great fit and a joy to wear 2 stars because of stock", "rating": 2}, {"title": "Love All The Clothes At Rainbow❤️🌈", "text": "Date of experience: April 15, 2021", "rating": 2}, {"title": "Was trying to send stuff to my child an…", "text": "Was trying to send stuff to my child an it wouldn't let me send it to her address", "rating": 2}, {"title": "There is a cute dress I love but when I…", "text": "There is a cute dress I love but when I went to purchase it, it was Removed from my cart because you wouldn't ship it to my address. I have giving the site ALOT of business.", "rating": 2}, {"title": "Ordered fine they posted a delivery…", "text": "Ordered fine they posted a delivery date then when the day got here suddenly there was no delivery date I'm not impressed", "rating": 2}, {"title": "Too frequently this website showed that…", "text": "Too frequently this website showed that you were out of the things I wanted in my size.", "rating": 2}, {"title": "Terrible shoe sizing", "text": "I ordered two pairs of sneakers from rainbow I have big feet so I was happy I saw size 10 and 11 shoes I just wanted cheap shoes to ride my bike with and these shoes run so small they are so tight they aren't really a size 11. Now I wasted money on two pairs of shoes I can't even wear.", "rating": 2}, {"title": "To difficult in trying to manage my…", "text": "To difficult in trying to manage my information! Use a similar system! Getting ready to check was not easy either! All in all I give you 3 ⭐️ ⭐️⭐️", "rating": 2}, {"title": "Website was super slow", "text": "Website was super slow. Slow shipping is expensive as well", "rating": 2}, {"title": "I am always satisfied", "text": "Date of experience: April 04, 2021", "rating": 2}, {"title": "Didn't get my free shipping even after…", "text": "Didn't get my free shipping even after spending over $150.", "rating": 2}, {"title": "Due to website issue I was not able to…", "text": "Due to website issue I was not able to place a order under my account. I had to checkout as a guest.", "rating": 2}, {"title": "You keep talking about free shipping…", "text": "You keep talking about free shipping and handling but you want my card number for what", "rating": 2}, {"title": "I don't appreciate how Rainbow sends…", "text": "I don't appreciate how Rainbow sends you emails and if you don't want them ,we have to pay.", "rating": 2}, {"title": "I did not receive a order summary order…", "text": "I did not receive a order summary order number confirmation number nothing", "rating": 2}, {"title": "Every year yeah have the same styles…", "text": "Every year they have the same styles in clothes and shoes. I feel like y'all need to upgrade your merchandise, also some of the clothing is not true to size", "rating": 2}, {"title": "I brought all those clothes and your…still charged me shipping  never agsin", "text": "I brought all those clothes and your still charged me", "rating": 2}, {"title": "Poor product quality", "text": "Date of experience: March 22, 2021", "rating": 2}, {"title": "Shipping and handling is too much…", "text": "Shipping and handling is too much especially when you buy only a few items", "rating": 2}, {"title": "There were a couple of pairs of shorts…", "text": "There were a couple of pairs of shorts that I wanted but there was no $X of size 28.", "rating": 2}, {"title": "The web site with the password wasn't…", "text": "The web site with the password wasn't performing the directions would not work  had to contact customer service twice the second time they got me into account and all my cart was gone when I tried to recreate the cart very time consuming procedure most items were then out of stock couldn't find half of order ended up ordering not sure of and sad purchases may be returned to you Gloria Surls 3550 SE Hwy 54 Collins MO 64738 14173099207", "rating": 2}, {"title": "it takes to long for order to be…", "text": "it takes to long for order to be processed and shipped and when you need to do a return or exchange there's too much to go thru it shouldn't be like that your store computer system also needs to be updated to make returns and in store exchanges your store here in Milwaukee WI are way to messy and unorganized they need to be seriously be updated", "rating": 2}, {"title": "Cheap low quality cloth", "text": "got 5 items:- Boots are different, one boot is wider than the other. Like visibly wider.- Leather jacket. Smells like a dead fish. Fugly. Will be returning- Wind breaker. Weird fit, but ok.- Blue bomber. I actually like it- underpants. okOverall very poor quality cloth. I am happy I got most of the things on sale, otherwise would not worth it. Boots are the biggest disappointment because they are actually cute, but my right foot is seriously uncomfy :-( Wish they were even.", "rating": 2}, {"title": "Mehh", "text": "Your website could be so much better. The selections are redundant.", "rating": 2}, {"title": "Y'all should start back giving free…", "text": "Y'all should start back giving free things to people who order a lot", "rating": 2}, {"title": "Website difficult to navigate..", "text": "Website difficult to navigate... too many categories..too much going on just like in store", "rating": 2}, {"title": "I’m not comfortable about storing my…", "text": "I’m not comfortable about storing my credit card.  I use to order and give my card number, I was interrupted the last order and I’m surprised it went through.  I shouldn’t be forced to store my card to order your merchandise.  Very unhappy", "rating": 2}, {"title": "I wasn’t able to place my order online…", "text": "I wasn’t able to place my order online until I added my address, I called customer service and they weren’t able to help me with the order so I had to figure it out myself", "rating": 2}, {"title": "The clothing is not true to size…", "text": "The clothing is not true to size however the colors n the detailing of the clothing is what keeps me coming back n I have to add that the material is extremely thin.", "rating": 2}, {"title": "You took items out of my shopping bag…", "text": "You took items out of my shopping bag that I wanted to buy and now you don't have it any more I am a good customer and this is how I get treated.", "rating": 2}, {"title": "Need more variety in XL sizes", "text": "Date of experience: March 15, 2021", "rating": 2}, {"title": "not a great selection", "text": "Date of experience: March 14, 2021", "rating": 2}, {"title": "Very good job", "text": "Date of experience: March 13, 2021", "rating": 2}, {"title": "The leggings I ordered in my usual…", "text": "The leggings I ordered in my usual size, 3x, were so small that I couldn’t even get them on. These run way too small. Wasted my time by ordering through mail", "rating": 2}, {"title": "I love the clothes it’s just that they…", "text": "I love the clothes it’s just that they say 3x and I was mad cause it must run small and now I dnt know how to return it and I’m going on vacation wanted to wear the item on my vacation", "rating": 2}, {"title": "Not enough of a selection.", "text": "Date of experience: March 08, 2021", "rating": 2}, {"title": "When I processed my order", "text": "When I processed my order, I was given a different amount then what was charged to my card. After I completed my order, the amount was $4.35 more.", "rating": 2}, {"title": "The clothes are cut extremely small", "text": "The clothes are cut extremely small. I ordered large in everything but they feel like a small. Before ordering I looked up the sizes to each piece to ensure I was ordering the correct size. I wear a 9/10.", "rating": 2}, {"title": "Like the cloths picked out", "text": "Like the cloths picked out . Order the size for me but cloths dont fit me but my 11 year old daughter.", "rating": 2}, {"title": "I am extremely disappointed in your…", "text": "I am extremely disappointed in your company, because you do not carry nine in the house I have seen so many wedges tennis shoes sandals that I would love to purchase but because you don’t carry 91/2,I can’t purchase them the 10s are too big,Very unsatisfied customer.", "rating": 2}, {"title": "I love Rainbow and my family love…", "text": "I love Rainbow and my family love everything about them love able people Customer service is lovely respectable and every day we love our rainbow the nice prizes they have the pretty clothes they have for kids and adults Thank y’all  Sincerely Mrs. Rosechell Branch and Family 😍😍😍😇🙏", "rating": 2}, {"title": "Fit to small", "text": "The close say therefore expert really there not there to smalle It's 4XS should be  Bata for access more like  A1X Its forex it should fit", "rating": 2}, {"title": "SKEPTICAL", "text": "I HAVE ORDER FROM HERE BEFORE  AND I NEVER GOT MY PURCHASE. I HAD TO GET A REFUND FROM MY BANK. IM JUST PRAYING I GET MY ORDER THIS TIME AROUND. RAINBOW DID NOTHING TO HELP TRACK OR FIND MY ORDER EVERYONE AT RAINBOW HAD A NONCHALANT OH WELL ITS NOT OUR PROBLEM ATTITUDE.", "rating": 2}, {"title": "Disappointed", "text": "I called customer service twice about an item that was too small.  I returned it and have not seen a refund yet!   It’s been since January!  Now what really beats the cake is I purchased more items after and one of them has a huge stain on it!   No tag came with item!  I’m giving a bad review and most likely will not order in more items from Rainbow.  Very disappointed.  I don’t do, but one chance with a company anymore.  I just get over it and move on!", "rating": 2}, {"title": "They have been two weeks and I still…", "text": "They have been two weeks and I still have not received my item", "rating": 2}, {"title": "This is my 4th time ordering from here…", "text": "This is my 4th time ordering from here and never had an issue till tonight. I do not like that Robot check box it took me 10 minutes to place my order and my card information was asked 1st.  Something needs to be done or changed on that option", "rating": 2}, {"title": "i got my packages today and got the a…", "text": "i got my packages today and got the a box for a size 11 but the shoe was a size 10 that came instead of an 11.", "rating": 2}, {"title": "I never had no problem with rainbows I…", "text": "I never had no problem with rainbows I love ❤️ their clothes and I will always shop at rainbow 🌈", "rating": 2}, {"title": "You have nothing to choose from", "text": "You have nothing to choose from. Everything I want is gone. Not alone talking about the clothes you have on fb and when you hit. Order its sold out. Please remove them its very disappointing to want something then it's not available.", "rating": 2}, {"title": "I think that you guys owe plus size…", "text": "I think that you guys owe plus size women a HUGE APOLOGY for the way you guys categorize women’s clothes and plus size clothes! We are plus size women and that’s the way you should address this category! Thanks so much....De", "rating": 2}, {"title": "I purchased a fringed jean jacket it…", "text": "I purchased a fringed jean jacket it was poorly made. They didn’t take the time to shred the Jean properly  to make the fringes look neat I had to clean it up myself.  I was very disappointed with this item only", "rating": 2}, {"title": "Purchased a robe in a size 3X", "text": "Purchased a robe in a size 3X, Really enjoyed it went back purchased 2 more in two different colours they sent me sizes 1x with 3X tags in the neck.Very disappointed. 😞 Wish I could post the picture I laid the robes on top of one another you can see about a 6\" difference in size.", "rating": 2}, {"title": "Never gives coupons", "text": "Date of experience: February 14, 2021", "rating": 2}, {"title": "I keep having the same issues with…", "text": "I keep having the same issues with Rainbow... No invoices. I have to keep requesting them. Between the first two weeks in February  I order 4 packages and I had to request them, I only received 3 invoices with one being sent twice. I reached out to customer service to let them know and they haven't offered a response. I live in a different country and I CANT receive my packages from the shipping company without an invoice. Yesterday I ordered 2 more packages and I will have to request the invoices as soon as it has been shipped. Rainbows have good clothes, hence why I still support them but it sucks not getting help from them..  This is not how you deal with customers! Customer serve sucks!!!!", "rating": 2}, {"title": "The site was not very cooperative in…", "text": "The site was not very cooperative in letting me place my order. I had to try 3 different devices. I did not get an email confirmation of my order. The best thing was the price of the items.", "rating": 2}, {"title": "SHIPPING", "text": "I think that you should offer free shipping to regular customers like myself, without having to spend 50$ or m[ore.", "rating": 2}, {"title": "One day expedited shipping more like two days", "text": "I paid for one day expedited shipping but I think it’s taking a little too long", "rating": 2}, {"title": "A lot of things 3x are not a 3x I’m so…", "text": "A lot of things 3x are not a 3x I’m so disgusted I’m always taking things back to the store and I’m disabled", "rating": 2}, {"title": "My order was never received", "text": "My order was never received . I was given a bad tracking number . After I complained I was given a different number that said my order was delivered , and it never was . I’m still waiting on the investigation to conclude .", "rating": 2}, {"title": "Slow shipping", "text": "I recently started shopping online with Rainbows and the delivery turnaround time is insane. It takes forever for items to come and when they finally arrive i forgot I ordered it. Other retail stores I order from, their service is PROMPT! I love the deals from Rainbows but the FedEx shipping is ridiculous!", "rating": 2}, {"title": "The online services is okay but if you…", "text": "The online services are okay but if you want to take something back to the store and it didn’t state online only the managers give you a hard time or don’t take the items back at store.", "rating": 2}, {"title": "Disappointed", "text": "I was tryin to pay and it didn’t let me pay full price I had to pay in installment even doe all the money was on the card", "rating": 2}, {"title": "Got some I did not order and the…", "text": "Got some I did not order and the quality is quite different from the pictures.I'm disappointed", "rating": 2}, {"title": "It was fast to order price was good", "text": "Date of experience: January 30, 2021", "rating": 2}, {"title": "The sizing isn't true to it's size and…", "text": "The sizing isn't true to it's size and after wash some clothes it falls apart", "rating": 2}, {"title": "Technical difficulties", "text": "For 3 days, I have been trying to process my order. There is obviously something wrong with the website. The technical difficulties is frustrating. I finally called and spoke to a customer service representative named Esther. She was very kind and helpful. She took my order over the phone. You need to fix the website ASAP.", "rating": 2}, {"title": "You never have enough sizes 4x thru 5…", "text": "You never have enough sizes 4x thru 5 x.Other than that it is okay.I prefer to shop online instead of in store.", "rating": 2}, {"title": "Button was off the arm of my 👔 not…", "text": "Button was off the arm of my 👔 not cool with strings hanging off the garment", "rating": 2}, {"title": "Ordered over a week ago...still have…", "text": "Ordered over a week ago...still have not received my clothes that's coming Fedex??? Will not order online again!!! Thought only postal service took weeks to get your stuff...ugh!!!", "rating": 2}, {"title": "Okay", "text": "Easy searching sit for nice clothes. But my goodies shirts were to small ordered a 3x when I normally wear 2x or 3x depending on material but these are not comfortable at all. I've only ordered shoes from them not clothing too much never again will stick with shoes", "rating": 2}, {"title": "Handbag with bad stitching", "text": "The small handbag was a beautiful color, but the stitching around the bag is very poor quality. So very disappointed! I will be returning it to the local store.", "rating": 2}, {"title": "I love y’all excellent service and…", "text": "I love y’all excellent service and customer", "rating": 2}, {"title": "The website had glitches made it…", "text": "The website had glitches made it difficult to purchase Item", "rating": 2}, {"title": "Certain brand names don’t fit plus size", "text": "When I order shirts from Rainbow there is a certain brand name that doesn’t fit perfect at all. I do not think I can put the names of the tops that I do and do not like on the review. I know now to check the description about the tops that I buy and make sure it’s the perfect fit brand.I hate buying things and not able to wear them a waste of time. Disappointed", "rating": 2}, {"title": "I ordered my stuff December  28th and…", "text": "I ordered my stuff December  28th and it’s January 11 and I still never got my package", "rating": 2}, {"title": "I would give 5 if you offered free…", "text": "I would give 5 if you offered free shipping for returns.  I dont have a store in my state to return to.", "rating": 2}, {"title": "Disappointed", "text": "I attempted to use a visa gift card on your site but it keep refusing the payment. I called your customer service and they stated that if they cannot reach someone to verify the amount the site will not accept it. What????", "rating": 2}, {"title": "I still haven't received my package", "text": "I still haven't received my package.  It won't be delivered until the 11th. They were shipped on the 28th. Still waiting", "rating": 2}, {"title": "The tennis shoes that I wanted they…", "text": "The tennis shoes that I wanted they never had my size", "rating": 2}, {"title": "It would not let me purchase a purse…", "text": "It would not let me purchase a purse online", "rating": 2}, {"title": "Easy and user friendly", "text": "Date of experience: January 05, 2021", "rating": 2}, {"title": "Too many pop ups", "text": "Date of experience: January 05, 2021", "rating": 2}, {"title": "I’m very disappointed", "text": "I’m very disappointed I got 3 outfits 2 of them were all good but the one had stands on the pants n it looks like ink on the top of the hoodie n on each side very upset", "rating": 2}, {"title": "I still don't have my order..", "text": "Date of experience: January 04, 2021", "rating": 2}, {"title": "I was sent the wrong items and the…", "text": "I was sent the wrong items and the wrong size", "rating": 2}, {"title": "There can be more fancy clothes for…", "text": "There can be more fancy clothes for plus size clothes", "rating": 2}, {"title": "I order different color shirts and they…", "text": "I order different color shirts and they send me most all the same color if they didn't have the colors they should have not send me any colors I order a purple lavender which I hope I received the same color I paid for other than that they're good .Milán", "rating": 2}, {"title": "I cld not back out & go back and find…", "text": "I cld not back out & go back and find the things I had just clicked on like most sites! PISSED.", "rating": 2}, {"title": "Not much in my size", "text": "You need more selection of women's shoes in size 12.  Limiting us to black shows only with the best ones in smaller sizes only is body shaming.  I would love to have so much of what you have but you want me to be smaller.", "rating": 2}, {"title": "The layout of your website is weird", "text": "The layout of your website is weird. When trying to checkout your cart appears as a \"bar\" on the side of the screen making it difficult to navigate through checkout", "rating": 2}, {"title": "They were out of my size in almost…", "text": "They were out of my size in almost every pair of jeans. I also did care for the fact that a majority of them had rips in them. I love a good pair of ripped jeans, but I'd like a good choice of normal ones over ripped.", "rating": 2}, {"title": "I like the application but I can't make…", "text": "I like the application but I can't make the purchase, it keeps circling and I keep waiting ...", "rating": 2}, {"title": "Very good quality cloths", "text": "Date of experience: December 26, 2020", "rating": 2}, {"title": "You guys have nice stuff", "text": "You guys have nice stuff, but the sizes aren’t catering to each and every customer as I had hoped. Plus something I seen you guys had before was no longer available to be found which sucks.", "rating": 2}, {"title": "I made an order and was to wait for the…", "text": "I made an order and was to wait for the coupon code to apply that was going to be coming by email and did not come so I lost the 10% off.", "rating": 2}, {"title": "I had so many issues trying to make my…", "text": "I had so many issues trying to make my online purchase. The site kept freezing up and would not connect to my PayPal. The site wouldn't accept my credit card, so I had to use another credit card. I tried to check out last night and couldn't but this morning the site finally allowed me to check out. It was a pleasant experience. Thank you.", "rating": 2}, {"title": "20 days no package", "text": "Date of experience: December 23, 2020", "rating": 2}, {"title": "I'll leave a better review once my…", "text": "I'll leave a better review once my items have shipped.", "rating": 2}, {"title": "wrong colors…", "text": "I received wrong colors I bought green pants got black. Bought a black jacket got green. 😡 first time ordering. How do u mix coat with pants?", "rating": 2}, {"title": "You need a better size selection", "text": "You need a better size selection. You lost out on about 200 bucks from me", "rating": 2}, {"title": "No coupons no free shipping", "text": "No coupons. No free shipping. I’m regular customer.", "rating": 2}, {"title": "You should  have free shipping!!!", "text": "Date of experience: December 15, 2020", "rating": 2}, {"title": "I love Rainbow …", "text": "I love Rainbow been shopping with them since I started shopping on my own as a teenager and now for my daughter it's always something at rainbow for you always", "rating": 2}, {"title": "Good quality clothing at a reasonable…", "text": "Good quality clothing at a reasonable price.I highly recommend this site.", "rating": 2}, {"title": "never offer free shipping", "text": "Date of experience: December 12, 2020", "rating": 2}, {"title": "I'm a frequent customer and I think…", "text": "I'm a frequent customer and I think your company should have a reward points program for customers like me.", "rating": 2}, {"title": "When you check out and pay with Pay pal…", "text": "When you check out and pay with Pay pal it should be noted there that you cannot return to the store That was a BIG Inconvenience", "rating": 2}, {"title": "Stock low", "text": "Too much full priced off season stovk", "rating": 2}, {"title": "I give them two stars only because…", "text": "I give them two stars only because without any explanation they removed certain items that I loved about my purchase at the time of paying, I looked everywhere on their page for an explanation and I did not find any answer ... what a bad plan so I do not know if I would return  to buy even though they have excellent articles.", "rating": 2}, {"title": "Very glitchy and slow every time I'm in…", "text": "Very glitchy and slow every time I'm in the site.", "rating": 2}, {"title": "Was estimated to use the 4 payment…", "text": "Was estimated to use the 4 payment options and ut didn't let me not happy but it", "rating": 2}, {"title": "Coupons not valid", "text": "I'm good with the clothing and shoes but I've attempted several times(4 purchases completed with no discount applied) to get and use the coupon offering a percentage off after signing up for text and email without avail. Of course I started receiving the emails and text coupon would not work, It would be nice to get a percentage off after I've made several purchases. Not satisfied!", "rating": 2}, {"title": "Not that many good items", "text": "Date of experience: December 02, 2020", "rating": 2}]