[{"title": "Goodrates I don't need home insurance.", "text": "Goodrates I don't need home insurance.11", "rating": 2}, {"title": "If you're looking for a company that…", "text": "If you're looking for a company that you can talk to somebody live this is NOT it they make you jump through hoops before you can even get a live representative.. CUSTOMER SERVICE IS NON THEREAnd even their hours on the website are not correct How can something as simple as the correct hours they cannot handle and they want to handle your life insurance once you're dead how do you know they're going to handle it correctly", "rating": 2}, {"title": "Have not received policy or any documentation", "text": "Received paperwork concerning life insurance through this company.  Sent in the questionaire of what I am looking for in a policy.  They sent me back some brief information and cost and they had really great prices for what you will recieve.  But, I have not received the policy yet and have not received first payment schedule so now unsure of what I signed up for.  ", "rating": 2}, {"title": "I am a new account holder", "text": "I am a new account holder.  I am still trying to understand everything ", "rating": 2}, {"title": "I honestly don’t know I even fell for…", "text": "I honestly don’t know I even fell for it. I’m a combat vet, I’ve seen and done things which in turn, affected me in more ways than one. The first time I received this, I was a bit intrigued as it states, “no medical exam.” I’ve entered all my info and reasons. Long story short, denied and guess what it’s for, my medical. Serve your country, only for companies like these to leave you hanging due to the disabilities that we have.", "rating": 2}, {"title": "Rude Salesman and wrong quote on offer", "text": "I received an letter through the mail from tru stage offering me a \"deal\" because I am a member of Utah First Credit Union. On the letter it stated as low as $13 a month for $15,000.  When I called, the price went up to $80 a month. I am retired and on a fixed income.  How do they think that a single elderly lady can afford $80 a month? It is  ridiculous.  The salesman was very rude to me.", "rating": 2}, {"title": "I have to change my account numbers…", "text": "I have to change my account numbers because my purse got lost with all my account numbers, I call this company and they mail me a form to fill out and to return with my new acc#, in the mean time they keep posting the payment to the closed account, i call the company so many times, and was told that they did not back the form, until one day when i call again, a customer service person was kind enough to let me know that the form was received(no one was paying any attention to the forn), I then received another form to fill out, when I call the company, the gentleman I spoke with was so rude, I have to fill out a second form and again mail the form. I would hate for anything to happen again and I have to call this company again", "rating": 2}, {"title": "I am not too certain", "text": "I am not too certain . The policy I received seems to be different from what I was told before I signed up. I will have to contact someone for proper explanation.", "rating": 2}, {"title": "We are currently experiencing technical…", "text": "We are currently experiencing technical issues. Please call us for information on TruStage Products and Services.Cannot pay bill online.", "rating": 2}, {"title": "Make it difficult to cancel", "text": "Just became Caregiver for my father and POA I first was requested to fax proof. that was good but my father has been paying for so long he's paid more than what the policy will pay upon his death. When I read the webpage it instructed me to call customer service to cancel the policy I would be sent a cancellation form . A woman tells me yes, they recognize I'm the POA but to cancel I need to talke to someone in cancellation dept who  informed me there is no form. I need to fax a letter with policy number and signature stating I would like to cancel the policy. Almost 3 weeks later I get a past due bill. When I call I'm told Yes the cancellation request was received but they didn't accept it because they didn't recognize the signature. I asked why wasn't I informed? She says they get to it when they get to it. I sent another fax today requesting to cancel and printed it out as clear as I could. I'm praying they will accept it this time.", "rating": 2}, {"title": "Not happy", "text": "Not happy. I tried to purchase additional coverage and no one ever contacted me!", "rating": 2}, {"title": "Cart in front of the horse", "text": "Asked for my opinion of policy before I received it. I can't give feedback on a product I don't have", "rating": 2}, {"title": "Whatch out for the words because they can trick ya.", "text": "Everything was good", "rating": 2}, {"title": "I would like a paper or Book so I can…", "text": "I would like a paper or Book so I can keep track of y payments, when are due when paid", "rating": 2}, {"title": "Don't here from to let me know how…", "text": "Don't here from to let me know how things are going with my policy.", "rating": 2}, {"title": "I have not received any confirmation or…", "text": "I have not received any confirmation or paperwork", "rating": 2}, {"title": "I would recommend Trustage to friends and family", "text": "Trustage is a trusting and very good insurance company", "rating": 2}, {"title": "Unsatisfied", "text": "Don't communicate effectively", "rating": 2}, {"title": "No contact", "text": "No contact, written or otherwise in 8 months.", "rating": 2}, {"title": "Don't value a person's time", "text": "Date of experience: January 05, 2022", "rating": 2}, {"title": "Not alot of information about this…", "text": "Not alot of information about this company", "rating": 2}, {"title": "Your ads on television is somewhat false", "text": "Date of experience: June 04, 2019", "rating": 2}, {"title": "Not interested at the moment", "text": "Date of experience: March 11, 2022", "rating": 2}, {"title": "Postiv3 and easy", "text": "Date of experience: May 07, 2019", "rating": 2}, {"title": "I had a very difficult and frustrating…", "text": "I had a very difficult and frustrating experience with communication over several days.  I had purchased a small life insurance policy and had a wonderful agent working with me, but after reviewing the cost I had decided it was too expensive for the low amount and decided to cancel the policy and look elsewhere.  I called and spoke to someone who said \"yes, we will cancel this for you\".  I then began receiving information regarding my policy in the mail and wondered if it had been cancelled.  I then began receiving e-mails about my policy and answered them to inform someone I had cancelled the policy and to please confirm this.  I received no e-mail, no written letter or phone call confirming this had been done.  A few weeks went by and still no confirmation.  I then decided to place another call this past weekend.  I just want the marketing department to understand what I dealt with and how this irreparably damages a company's reputation.  I called and spoke with someone who had difficulty understanding me and it took about 5 minutes just to get my name.  He then said he couldn't help me and had to give me another number to call.  I told him that I had just called that very same number.  He then gave me another number to call.  I placed the second call and was greeted with a unpleasant, non-smiling voice.  I explained my issue that I needed to speak to someone about cancelling my insurance policy.  After I explained this to her she then said \"why are you calling\"?  I had to repeat this again.  She then said \"well, I have to transfer you\"!  I thought she had transferred the call but she had heard me say \"Geez\".  I was surprised when she said \"you don't have to be mean, ma'am\"!  I said \"well I am sorry you were not very pleasant\".  She then hung up on me!!!  This was uncalled for and unprofessional.  She doesn't belong answering your phones.  I then recalled as I wanted to make sure I had confirmation on the cancellation of my policy.  A lovely woman named Cassandra answered the phone and I pleaded with her to just help me get this done!  She was very kind but then said \"I am so sorry but on the weekend we cannot transfer calls!  So, please reread that.  Does that in any way make sense?  You are better off from a marketing standpoint to have an automated voice recording saying \"Please call back during our normal business hours Monday through Friday\"!  Cassandra was kind enough to give me a few numbers so I could call today.  I called this am and was able to get confirmation that the policy was cancelled.  All of this could have been avoided if someone had just mailed me a notice of cancellation or a simple e-mail confirming this.  I do hope someone from the marketing department reads and reviews this.  I am writing this in an effort to help for future reference and teaching purposes.  Stay well in these difficult times.  Sherri L. Hassan", "rating": 2}, {"title": "It was alright", "text": "Date of experience: February 21, 2019", "rating": 2}, {"title": "MAYBE THIS IS WHAT IT TAKES FOR SOMEONE TO FINALLY CANCEL MY HORRIBLE POLICY??", "text": "I have decided to write this review for multiple serious reasons:1) Over the past several months, I have formally written to the contact number that is repeatedly given to reach out to as far as needing to resolve some type of policy issue over the phone.2) After I received absolutely no help on that front, I then faxed a letter expressing my same concerns to the address listed on the website for those exact purposes.3) And most recently, I actually got up and physically visited the actual corporate offices of the insurance company that was in charge of my specific policy. 4) Truthfully, I was desperately praying that I would finally be able to speak with qualified personnel in regards to my immediate need for a simple policy cancellation request.5) This is because we not only no longer need the policy as far as our immediate priorities go right now, but we are also no longer able to afford additional costs with both my husband and I being unemployed and without work due to the COVID-19 pandemic.________________________________________________________________To give readers an even deeper context, I had to set up an online account with CMFG through their website, which gave me quite a few problems at first in trying to just generally open an online profile.Regardless of the complications, I was finally able to set an online account up to make things easier on my end as far as my desire to pursue my request for my policy cancellation.However, when I accessed the online site and navigated through the phone lines listed to call in the event of an issue, I right away used the number listed all over the site titled  \"Contact Us\" for what seemed to be something that they could help with if you were unable to get the help you needed online or by yourself individually. Once I dialed the designated number:      - I was placed on hold for almost 45 minutes;      - I was given conflicting information related to navigating links listed;      - I was also transferred more than five times to different departments;      - In speaking across departments, my situation/issue felt nonexistent.In all honesty, I couldn't believe what I was dealing with. I would expect a corporate insurance company to instead conduct themselves accordingly:1) Reasonably safeguard while also maintaining confidential records;2) Maintain highly technical as well as sophisticated security software; 3) Prioritize the use of private security systems that:      - maintain integrity and operate efficiently;     - protect the safety of staff, operations, and most importantly clients;     - safeguard all types of confidential information and sealed records;      - release genuinely smart business advice with a heartfelt mission.Ultimately the reason I felt I had to write this review is to somehow finally get the attention of someone within this corporate insurance company that cannot seem to prioritize one of their former, loyal and now suffering individual clients.With that necessary and forced aforementioned review commentary with regard to this issue, I can only genuinely hope and pray that this is what it will finally take so that we are able to formally end this by NO LATER than tomorrow. I have MORE than earned the right to expect, request, and ultimately demand that your CMFG Life Insurance Company makes the less than 10 whole minutes of time to pick up the phone and dial my number immediately upon entering your facilities tomorrow morning... ALSO - just as a little reminder in case you happen to get distracted for whatever reason... just wanted to remind you that tomorrow's date is: TUESDAY, APRIL 6th, 2021. Unfortunately, I am compelled to both reiterate and stress the significance, the importance and the timeliness with which this particular issue is handled. Furthermore, in expressing my upsetting concerns through the course of this review, I genuinely expect that my long overdue policy cancellation request:1) Will maintain high priority with regard to overall timelines & efficiency; 2) Will be addressed immediately tomorrow morning, as soon as staff arrive at the office and then are subsequently briefed on the situation; &3) I most certainly expect my personal situation to be handled with:      a) Privacy and Professionalism.      b) Flexible & Positive Corporate Attitudes.      c) Receptive & Empathetic Feedback Upon Issues Surfacing.      d) Genuine & Meaningful Respect in Providing Varietal Solutions.P.S. Please call me tomorrow as discussed above so we can all finally be done with this issue. If I don't hear from anyone, I will continue to press forward in advocating for a complicated and unprofessional situation.", "rating": 2}]