[{"title": "Though your customer service is…", "text": "Though your customer service is helpful, there is no reason that it should take so long to receive my order. I do like your clothing, i have ordered previously with the sane delay. I don't think i will be ordering again ", "rating": 2}, {"title": "Okay so this is my second order with…", "text": "Okay so this is my second order with this company. The first order I got a medium because it was suggested I size down & they were too tight and rolled down at the waist. But I loved the material and the way they felt soft & dog hair didn’t stick to them. So my second order I got my regular size & still roll down they aren’t tight but still don’t stay up. It was frustrating all day walking delivering mail & my high waisted leggings are constantly rolling down. I will not be purchasing anymore of these leggings they are so expensive as it is to be so uncomfortable around the waist. And I was dumb in buying 3 pair my second order thinking they would be comfortable. 😭", "rating": 2}, {"title": "Mothball stench", "text": "The pants that I ordered fit great. However, they have an absolutely terrible mothball stench. I have washed them twice and hung them outside for an entire day and they still stink. I have emailed the company regarding this issue and have not received a response. ", "rating": 2}, {"title": "wouldn't buy clothes again as a plus-size woman ", "text": "Halara has discounts for their \"regular\" fitting clothing but not their plus-size clothing of the same kind. For example, the adjustable strap waffle overalls. This is discriminatory and honestly just wrong. On top of this, I have worn my overalls maybe four times and the material is already starting to pill. I do not think their plus-size clothing is true to size and the quality is sub-par for the price. ", "rating": 2}, {"title": "I was disappointed with these pants", "text": "I was disappointed with these pants. The fabric is very thin and feels more like plastic than quality material. I ordered a small size, but they fit awkwardly. Additionally, they don’t look anything like what was shown in the Instagram videos. Overall, not what I expected. I won’t buy the brand anymore.", "rating": 2}, {"title": "Material has bad smell", "text": "My last order of jeans fits perfectly but has the most awful smell in the material. I’ve washed several times and cannot get smell out ", "rating": 2}, {"title": "Jean texture", "text": "I received my order but was disappointed with the texture of the jeans. They aren’t Jean material but more like a legging fabric with colour of jeans. Wasn’t what I was expecting. Disappointing ", "rating": 2}, {"title": "The sizes are not accurate! Return process is painful ", "text": "The sizes are not accurate, the return process has been very difficult. I am still waiting on the email with instructions and it has been over 48 hours.", "rating": 2}, {"title": "They fit BUT, ", "text": "Yes, they fit and are stretchy but the fabric is so uncomfortable and does not breathe at all. Even with the ease of ordering and styles and sizes available, I unfortunately won't be reordering due to synthetic fabrics. It is a disappointment.", "rating": 2}, {"title": "After washing the leggings", "text": "After washing the leggings, it started pilling and the materialwas no longer smooth. For such an expensive legging I would not.expecy that to happen on the first wash. Won't be buying again", "rating": 2}, {"title": "I love your pants", "text": "I love your pants, but making returns is very confusing.  I wish you could call and talk to someone.  It seems like it is just a computer responding to my questions and I get nowhere?", "rating": 2}, {"title": "I was not happy with the delivery…", "text": "I was not happy with the delivery process. I was told 7 days and it took twice that time and I did not get my package before vacation. I was also not happy with the fit of the jeans style leggings. Not at all what I had hoped, I have been very impressed with previous orders ", "rating": 2}, {"title": "I ordered jeans on 10/4 and received…", "text": "I ordered jeans on 10/4 and received them on 11/2. I received one communication saying they were delayed - which was helpful. When I ordered them, nothing indicated to me that they were a pre-sale item and would not be shipped out. I recommend making that clear to the customer, so they are not dissatisfied with the length of time to receive this purchase. ", "rating": 2}, {"title": "SMELLY SMELLY SMELLY ", "text": "SMELL! Have worn and washed several times but the chemical smell is awful. Super sad because they are the perfect teacher pants… but SO GROSS THAT SMELL!", "rating": 2}, {"title": "I love Halara but everything order fits…", "text": "I love Halara but everything order fits differently than the last item. I order a large in everything. Some are too big, some should be an XS. I don’t know what size to order because the sizing isn’t consistent. ", "rating": 2}, {"title": "Not what I expected", "text": "Unfortunately the pants I ordered were not what I expected. The material is stretchy with they are not form fitting. I really was looking forward to using them but I will be returning them. The material is thick which was a plus.", "rating": 2}, {"title": "They don't roll up at the bottom", "text": "I bought 3 pairs in different colours and although they fit well round the waist they do not fold at the hem as pictured.  The fabric is too thin and wide and they just keep unfolding and falling down. Disappointed as they are too long without being rolled up. Not sure what the solution is. As much as I like them, they just don't look like they do on the website. ", "rating": 2}, {"title": "I have returned pieces over 10 days ago…", "text": "I have returned pieces over 10 days ago and I haven’t received acknowledgment of return nor refund. ", "rating": 2}, {"title": "All around hassle", "text": "The return/refund policy is a hassle, and the clothing isn't made with consistent sizing. So, it's always a risk to order from them.  In addition, I had a gift card and chose to wait a few months to use it, and they deactivated it!  I thought that was illegal since gift cards are considered as cash. So i had to wait to place my order because I had to contact this company about getting the gift card reinstated.  THEN, once I was finally able to place my order, the gift card didn't show on the receipt, so I had to contact them again to make sure it was applied.  Once that was sorted, i get another email stating that my order won't be shipped until my item is made. I was never informed that the item wasn't created yet.  If something is pre-order, the customer should know.", "rating": 2}, {"title": "Within 20 minutes of ordering I…", "text": "Within 20 minutes of ordering I connected with customer service via chat and requested a size change.  I was told the request had been passed along.  10 hours later I got an email that my order had shipped.  Size had not been changed. When I reached out again I was told I would have to pay for return shipping to exchange them.  They did offer a $10 GC code for future order.  Not good enough in my opinion.  Return shipping should have been waived.", "rating": 2}, {"title": "While trying on my leggings they ripped…", "text": "While trying on my leggings they ripped right under my butt cheek area. The material is not as stretchy as I thought and I've never had any issues with other top brands. I need to send back for another pair of refund but I'm not able to since I can't figure out how to find shipping labels. Most likely won't ever buy again. ", "rating": 2}, {"title": "I don’t recommend this product or…", "text": "I don’t recommend this product or company. It was my first time buying from them and I bought these pants after reading numerous reviews. Only to find out when I received them they’re cheaply made and do not stay up on my hips/waist. I keep having to pull them up because they fall down, which is very obnoxious when you’re working out or doing anything. I would have returned the product if it wasn’t so difficult to make a return with this company. Overall just very disappointed. ", "rating": 2}, {"title": "Love your products but shipping took…", "text": "Love your products but shipping took almost a month. I email about this issue but nothing was done, no answers or any communication. ", "rating": 2}, {"title": "Not what I expected", "text": "Some of the items aren't what I expected based on the description and photos shown. I ordered a pair of softlyzero leggings and they are extremely thin, based on the photos I expected something that would be a bit thicker for the winter months. I also am a bit disappointed in the corduroy pants I got, they're rolled up in all of the photos so I expected the pant length to reflect that style, but they aren't long enough for me to roll up. All in all, they are decent products, but I just don't feel like the descriptions and photos shown do a great job of showcasing the products based on what I received. ", "rating": 2}, {"title": "My package is being held by the…", "text": "My package is being held by the shipping company. They say it is not prepared properly for shipping. I have recently had a few responses from customer service but with no results to remedy the situation. I would like to receive the clothing I ordered and paid forLaura messinger", "rating": 2}, {"title": "My yoga pants had two separate holes in…", "text": "My yoga pants had two separate holes in them brand new and the sizing varied between different pieces.", "rating": 2}, {"title": "They’re comfortable pants but such poor…", "text": "They’re comfortable pants but such poor quality. I would be willing to pay more for better pants. ", "rating": 2}, {"title": "The design for the jumper is awful as…", "text": "The design for the jumper is awful as it side zips and is impossible to don without assistance of another person. Would have been much better to have a pull on option without a zipper. ", "rating": 2}, {"title": "Not easy to return", "text": "Buying clothes online takes some trust and most companies make it easy to return. Halara prefers to offer you a gift card sans the shipping fee. IF you return the items that do not fit, you have to pay the shipping. I I am short 5’3 and 136 lbs. I bought petite size  hoping they would Not be too long, but instead were too tight. The medium sized I returned for fit, but are of course way too long, and still fit a bit tight. It does take a long time to get your items and really wanted some comfortable fitting pants, but it was tough for me here", "rating": 2}, {"title": "I bought 5 pairs of slacks..", "text": "I bought 5 pairs of slacks... Didn't live up to the hype. Yes, they are stretchy but they are also a heavy material. Dune look anything like I saw. Very misleading ", "rating": 2}, {"title": "Bad customer service experience ", "text": "I was sent the wrong item and contacted customer service. They said I had to return the item and purchase the right one with the refunded money, as they are not able to send me the correct item. I originally purchased the product with a 20% off coupon so the item I ordered would be more expensive for me when I repurchase it withoutthe coupon. When I explained this to customer service they stopped responding and I haven't been able to come in contact since.", "rating": 2}, {"title": "Returns are too expensive", "text": "Returns are too expensive. $30 to send something back! The products are great but can’t risk having to return something. ", "rating": 2}, {"title": "Halara SoCinched High Waisted Tummy…", "text": "Halara SoCinched High Waisted Tummy Control.I recieved these today, hoping they would keep their promise of not rolling down, but as soon as I sat down in the tights they rolled down. I tried repositioning them but they rolled down no matter what. They are soft and comfortable, but I need a pair that don't roll down...", "rating": 2}, {"title": "Unimpressed with the quality of the…", "text": "Unimpressed with the quality of the pants - i thought based on the ads i was seeing, they would be better made. ", "rating": 2}, {"title": "Clothes didn’t arrive ", "text": "I ordered clothes for 2 special events. Those dates have come and gone, and the order is still not here - almost 2 weeks after the arrival date on the check out page. Probably won’t order again. ", "rating": 2}, {"title": "So sad! ", "text": "One pair I got was great. The other pair ripped along the seam within 5 minutes of putting them on. And no I didn't get the wrong size. Super disappointed because the other pair was great. Won't spend that much money again on a hit or miss. ", "rating": 2}, {"title": "clothing arrived with a repulsive…", "text": "clothing arrived with a repulsive manufacturing smell. Hoping wash #3 after a vinegar soak takes care of it. ", "rating": 2}, {"title": "Again your return process is very…", "text": "Again your return process is very difficult. This is my second time having problems with a return", "rating": 2}, {"title": "Cute but poor quality product ", "text": "Slow shipping and disappointing quality. I was excited to finally get my jeans 2 weeks after ordering. Unfortunately, after wearing them for 8 hours in my work from home office job they already have several small snags in them. For the money I would expect a lot better quality.", "rating": 2}, {"title": "Item did not fit my body properly", "text": "Item did not fit my body properly. It wasn’t about the size it was about how it was made. I’ve been trying to return it since it has arrived and I have received no information on how to.", "rating": 2}, {"title": "my returns", "text": "Took a long time to get a response on the app.  and I wish I could have did both my returns thru the app and would have been nice and easy.  Instead they messed up and now it has been a long drawn out ordeal.  ", "rating": 2}, {"title": "The jeans are cute but smell terrible", "text": "The jeans are cute but smell terrible. I’ve washed them five times and they still smell bad. Also, one of the pockets was sewed with too much material and looks bulky when on.", "rating": 2}, {"title": "Honestly", "text": "Honestly, was quite disappointed in how long it took for me to receive the package.", "rating": 2}, {"title": "Disappointing returns process", "text": "For relatively high priced items I'm disappointed there isn't a free returns service. Also the requirement to take a photograph on each item returned means I will not be using Halara again. Why should I need to stipulate that an item doesn't fit me well by taking a photograph to prove it? I am not comfortable with this.", "rating": 2}, {"title": "I’m just not a fan of the products I…", "text": "I’m just not a fan of the products I have purchased. Materials are thin and leave a lot to be desired. ", "rating": 2}, {"title": "I’m incredibly dissatisfied ", "text": "I’m incredibly dissatisfied with my leggings. The other 3 items are just ok. But those leggings. No way. They’re the whole reason I initially ordered. They seem defective and fall down and are terrible quality. This deterred meFrom ever ordering from halara again. If I could return and get a refund I would", "rating": 2}, {"title": "Picture misrepresented product", "text": "I bought trousers. There was no info re: the fact that they are styled as trousers and material is atheleisure in description. Picture misrepresented product. Camel colour is more yellow and pants for big.", "rating": 2}, {"title": "Wouldn’t use too complicated to return and make sure you send back any freebies ", "text": "The measurements of clothing wasn’t accurate. I had to return all items and it was really confusing as you had to wait for confirmation from the customer service before even getting details of how to return. The online portal says you can’t return any free gifts but when you read the same print it says you have to so don’t get caught out!", "rating": 2}, {"title": "ugly mediocre quality clothes", "text": "the stuff is all mediocre. not better quality than items from walmart that are a fraction of the price. I wont take my chance on ordering anything for here again. the sizes are inconsistent and the clothes are ugly to be perfectly frank", "rating": 2}, {"title": "I wish Halara had more curve options", "text": "I wish Halara had more curve options. There are so many cute smaller sizes but the curve option is limited! I love Halara and everything I’ve received but curvy girls are very limited! I could order more if we had just as many options as smaller sizes!", "rating": 2}, {"title": "The product was great but the shipping…", "text": "The product was great but the shipping was terrible. I opted for the free shipping because the time frame given was acceptable. If I would have known it was actually coming from China and that time frame provided had no way of being accurate logistically I may have went a different route. The lack of honesty in predicting delivery was disheartening. ", "rating": 2}, {"title": "They roll down and pinch", "text": "The pants roll down and pinch my skin and it pulls the baby hairs. Makes it very uncomfortable and painful to wear. Very disappointed ", "rating": 2}, {"title": "Penalizes plus size customers", "text": "Inconsistent sizing throughout all of their pants. (Same measurements - sometimes I need XL(16), sometimes 1X (18), sometimes 2X(18).  All with the same size waist!)   Plus size clothing costs significantly more (nearly double with two particular pairs of pants)  No discounts for plus size clothing.  A LOT of the items are not available at all for plus size women.  And apparently there are no short fat people - no plus size petites are available.", "rating": 2}, {"title": "It was not clear from the photo that…", "text": "It was not clear from the photo that the jeans had such an exegerated flare, which I did not like and was a disappointment. Otherwise the jeans fitted well and was very comfortable.", "rating": 2}, {"title": "You make it extremely difficult to…", "text": "You make it extremely difficult to return order exchange an item. I even downloaded the app!!", "rating": 2}, {"title": "How do I make a return?", "text": "The shipping took a long time and the return process for one of the items is clunky.", "rating": 2}, {"title": "The blue pants did not meet my…", "text": "The blue pants did not meet my expectation for the  price i paid i did not like the fit and ended up giving it away.", "rating": 2}, {"title": "Both skirts ordered were the same size…", "text": "Both skirts ordered were the same size and one skirt was sewn very wonky and made a large bell shape which was very unflattering. I wrote a review and no one reached out to address the issue ", "rating": 2}, {"title": "Fabric has no structure", "text": "Fabric has no structure. Can see every lump and bump of my thighs and underwear underneath the pants.", "rating": 2}, {"title": "Not a Good Experience All Around", "text": "The stretchy work pants look hoghly more professional on the website than they do in person. Upon trying them on, I looked more like I was going to yoga than to work. I think I'd be called for a meeting with HR if I ever wore the pants I ordered to work. Returning was an absolute nightmare. I had to email the support line, didn't get a response, and the only way to process my return was through an extensive conversation via their live chat. Insane experience for a company that is advertised everywhere. I really looked forward to my order and I'm sad.", "rating": 2}, {"title": "Long shipment", "text": "Long shipment,  I thought it comes from the US, and only after ordering,  found out it's of Chinese origin.Product not as it looks it photos. ", "rating": 2}, {"title": "To be honest", "text": "To be honest, After reading review after review I was so excited to finally find a comfy pair of jeans that not only fit good but made me feel great. I am a larger woman and that's a hard feat. It took much longer than expected to recieve my package but it didn't matter because when they finally did arrive I was so excited. When I tried them on I was so disappointed. They were huge not only in the waste but the legs as well. I understand I ordered wide leg however these were atleast double wide leg. Unfortunately I'll be returning these jeans. I really really wanted to love them.", "rating": 2}, {"title": "This was my first purchase", "text": "This was my first purchase.  The items did not fit properly.  I went online to return but had to call email the company because they asked for pictures of items.  When I emailed them, I was disappointed to find that I had to pay to return the items.   I could have gotten a gift card, but after my experience,  I chose not to.", "rating": 2}, {"title": "Inconsistent sizing", "text": "Inconsistent sizing. I purchased jeans in  size Small but when I purchased a different pair of jeans in a size Small they were way to small. ", "rating": 2}, {"title": "Unreliable sizing", "text": "Unreliable sizingI ordered 3 items and only one was true to size, and true to the picture on the website. Two items were far too big. Because returns are too much of a hassle and expensive (international shipping and tracking), I will simply donate my new orders to charity. I don't recommend Halara.", "rating": 2}, {"title": "I followed the size chart", "text": "I followed the size chart, ordered the suggested size, they were way too big.   I ordered them on Sept 30, and had no idea that I had to wait till the sale was over before they would ship my purchase.    They didn't ship it out till Oct 14 and I did not recieve my purchase till Oct 22.  Almost a month after I ordered the pants.   I have followed the return instructions, I'm hoping the returns are not as complicated as the order.     I was dissapointed and may give them another chance someday, but I will probably order from Amazon from now on, way easier for returns and faster shipping and usually correct size chart. ", "rating": 2}, {"title": "Arrived with a hole in them", "text": "They are lovely leggings but came with a huge hole in them, such a shame because they look nice on. And for some reason I can’t return or exchange them.", "rating": 2}, {"title": "The returns are unnecessarily complicated", "text": "They make the returns unnecessarily complicated. While the products seem nice, they are not fitted for truly petite sizes. Since the only option was to order online, I could not try the clothes on in advance and eventually, I had to opt for a return. However, while they make it seem like a return is an easy option (after all they are required by law to provide this option) they make you fill out the whole form only to find out that you cannot submit it. Everything else on their website works, the internet connection works, and different browsers have been tried, but the button to \"submit\" the return request simply does not work. So you need to go through a lengthy process of returning the items via a help centre, where they still try to push you to keep the order. While I appreciate the effort to avoid sending an unnecessary amount of packages back and forth I do not appreciate the amount of time it took me to complete one simple return, especially since I had the impression that there was not a \"technical issue\" but rather it was a well thought through approach to make customers keep the orders even if they want to return them  ", "rating": 2}, {"title": "Sizing was way off and took a long time…", "text": "Sizing was way off and took a long time to receive my order", "rating": 2}, {"title": "Will not purchase here again. Received my purchased unfortunately…", "text": "Received my purchase and unfortunately these leggings did not meet my expectations. Have been trying to reach customer service to return them however no one gets back to you with return instructions. And the website does not instruct you either. Will not make another purchase here. ", "rating": 2}, {"title": "Jump suit is awesome fit but the square…", "text": "Jump suit is awesome fit but the square neck is less sharp than I would preferJeans are way more flared/ wide leg than I like and the colour is off, I thought I ordered the dark blue denim these are more or a lighter blue", "rating": 2}, {"title": "I was told if I gave my phone number…", "text": "I was told if I gave my phone number for texts I would get a discount. I DIDN’T get any discount. ", "rating": 2}, {"title": "Returned …", "text": "Returned my very first order for a gift card. Received my second order and I'm still not pleased with the items. ", "rating": 2}, {"title": "Great for athleisure. Don't recommend for anything else.", "text": "Halara is decent at athleisure. I wouldn't recommend their clothing for work, even if they say it's for work. I thought the material would be a little thicker. Ordered about 10 items. 7-8 are getting sent back because they just don't fit right. ", "rating": 2}, {"title": "Inconsistent sizing and fit", "text": "I bought 3 pairs of pants and followed the size guide. All size medium, all different sizes. I’ll be returning at least 2 of the pants if not all 3. I haven’t decided if I want to risk washing one of them to see if they’ll shrink a bit to fit better. I’ll be keeping 2 of the tops but one will be returned. I didn’t like the fabric. ", "rating": 2}, {"title": "Poorly made, thin fabric, impractical pockets and sizing", "text": "The pants were a much thinner legging material than I thought they would be. I’m 5’10” and 140lbs and I ordered a size small/tall. They are too short and too loose for me. The regular pockets are too loose to hold my phone and the side pockets are too small to be functional. On my second time wearing them the button above the zipper popped off. Poorly made, cheap fabric, and not very functional. That being said they are extremely comfy! ", "rating": 2}, {"title": "I got waisted nave blue ones from tik…", "text": "I got waisted nave blue ones from tik tok shop and i am obsessed how nice they are,these booty lifting not so much very hard material, not happy at all,sorry i wish i order the same one from tik tok shop", "rating": 2}, {"title": "The pants were too short and it took…", "text": "The pants were too short and it took too long to receive the items. I didn’t realize there was no refunds or exchanges.", "rating": 2}, {"title": "Horrible return policy!  Work pants are yoga pants with pockets slapped on", "text": "I got the pants that are supposed to be good enough to wear to work.   The pants are just yoga pants with pockets sewn on.  I had planned to return them, but it required 3 photos to be sent.  I feel that is a horrible return policy.  I don't like the product.  They are skin tight and I am not comfortable wearing them to the office.  And asking me for a photo as proof??  Never trying anything from here again.", "rating": 2}, {"title": "Late arrival", "text": "Took 2 weeks to arrive from ordering. Too long!", "rating": 2}, {"title": "Refund", "text": "Still awaiting a refund.   Followed all the instructions, downloaded the App, sent photos and paid personally for postage and still a month later there’s no sign of a refund?!", "rating": 2}, {"title": "Not great", "text": "Overall not great. Shipping takes ages, sizing guides are misleading. Tried to return but I have to pay extra costs to do so. Overall very disappointing and dissatisfied, would not purchase again. ", "rating": 2}, {"title": "I was not satisfied with the pants I…", "text": "I was not satisfied with the pants I ordered. The material didn’t feel breathable. The waistband was very tight for the pant size. ", "rating": 2}, {"title": "wrong size sent", "text": "A bit frustrated as i was sent the incorrect size for a shirt i ordered (i ordered a medium and was sent an extra small).  I still have the shirt as the shipping to sent it back would be as much as the cost of the shirt, very simply - not worth it. ", "rating": 2}, {"title": "Fabric not as expected ", "text": "The fabric is just too much like athletic wear. It is like “quick dry“ fabric, the type of fabric I wear for camping or hiking, but not to the office. So for some of the pant styles, it’s fine, but not all of them. It would look ridiculous with a pair of heels—hiking boots, yes, but heels, no. Also, it’s not really suitable for cold winter climates. And that’s what I was looking for.", "rating": 2}, {"title": "Didn’t get the size I ordered…", "text": "I ordered my last pants to be a petite and received a regular. They are way too long and I can’t wear them at all. Live the material but sucks that they don’t fit because I didn’t get what I ordered ", "rating": 2}, {"title": "Quality was not as expected", "text": "Quality was not as expected.   Fabric was too thin and flimsy.   Will not wash well.   Very Disappointed!", "rating": 2}, {"title": "Terrible Return policy", "text": "I don't like that you don't stand by your product in order to offer returns that are not charged to the customer. Based on your measurement suggestions, I ordered the size and its a little too big. Unfortunate to then have to pay for a return ", "rating": 2}, {"title": "Way too tight on me & they want a pic to return?", "text": "Way too tight on me.  Now I am trying to return and they want a picture?  I’m not sending a picture of pants that look awful on me.  ", "rating": 2}, {"title": "Made in China, one and done", "text": "Had I known the products that you sell on here are from China, I would never have purchased. I should have had a clue why it took over a month to receive 2 items. All I can chalk it up to is one and done. I proudly shop and support American businesses. ", "rating": 2}, {"title": "it took a very long time to receive the…", "text": "it took a very long time to receive the order. I ordered two of the same things, size, just different color, and they are very different in fit.", "rating": 2}, {"title": "1 dress was cute and the other wasn't a…", "text": "1 dress was cute and the other wasn't a good fit and the zipper kept opening. I sent an email over 48 hours to return and still haven't heard back. The link for communication doesn't work either. ", "rating": 2}, {"title": "Very slow shipping", "text": "Frustrated that the shipping.  took nearly 2 weeks from ordering date. I ordered products from Europe on the same day that arrived quicker !", "rating": 2}, {"title": "Price not worth the quality ", "text": "This shipping was pretty long for what you pay for the items. Then, once received the quality of the material felt really cheap and too loose and stretchy. I was expecting it toBe better quality for what I paid for. Wore it once to the gym so far and it became looser as I worked out and no support in the top as it stated online. Don’t think I’ll be ordering from Halara again - the color was nice,But not worth the price for the quality . ", "rating": 2}, {"title": "Long winded returns process ", "text": "Too tight on the waist for me (i suppose it depends on personal body shape) the returns process is very long winded, i wouldn’t order from them again ", "rating": 2}, {"title": "Quite unhappy", "text": "Very good sizing and quality but unfortunately only received one of my buy one get one free items and unrealistically asked to prove that I didn’t receive it :(", "rating": 2}, {"title": "My original order didn't fit", "text": "My original order didn't fit, so I was able to get a credit to order a different size, which also don't fit right. There is a gap on top in the waist, yet they are too tight in the hips and thighs and then way to big on the bottom and too long. I would just like to return them, but after paying shipping I won't get much back. I am sad they do not fit like they show in the videos, are not stretchy or comfortable, and aren't made for anyone with curves. I wear a size 4 in normal clothes and the small made me look and feel obese. The medium was some weird size as I described above. Very disappointed.", "rating": 2}, {"title": "Product isn’t as good a quality as…", "text": "Product isn’t as good a quality as expected ", "rating": 2}, {"title": "Product took too long to come and had inaccurate tracking.", "text": "The product is fine and fits as described and would order again except for the fact that it took a month to arrive and is sketchy on the tracking.  It had tracking but was not up to date.  Once it arrived in this state, it was missing for 10 days. I only received it after I finally let them know that it still hadn't come a month to the day after ordering.  It arrived 2 days later.  And it states that there are no refunds if its lost or stolen in transit.  I order 3 items, so that isn't good. I would have lost a lot if it didn't show up.", "rating": 2}, {"title": "The material is not the best as…", "text": "The material is not the best as described. Is advertised just on skinny bodies, but on curvy ones and a little bit of belly like myself is definitely not the same", "rating": 2}, {"title": "Website bugs/errors regarding “find my…", "text": "Website bugs/errors regarding “find my size” feature from iphone; also when trying to track my return, error message displayed repeatedly and unable to track. ", "rating": 2}, {"title": "Returns are bad", "text": "Shopping was ok. Delivery was quite fast. Quality is 50%. Ordered 2 pairs of pants. One very thin, almost see through. The other great fabric but did not fit well. The returns is a very complicated and costly project from Canada. Will use other store. ", "rating": 2}, {"title": "I’m so disappointed.", "text": "I’m so disappointed.. my jeggings smell so bad. Like bad breath and the smell wont go away. The leggings are so smooth and the color is gorgeous but they don’t hide anything. You can see through them and they just aren’t thick enough to give that smooth look to the skin. ", "rating": 2}, {"title": "trying to return an item is…", "text": "trying to return an item is impossible.. Generated emails", "rating": 2}, {"title": "Disappointed", "text": "I thought I was taking advantage of a 2 for 1 offer. I only received one pair of leggings-feeling cheated/disappointed.The leggings I received are perfect! ", "rating": 2}, {"title": "Color changed after I wear it 2 times", "text": "Color changed after I wear it 2 times, if you touch it color will show on your hand and under your nail. I don’t like it. ", "rating": 2}, {"title": "Fit was not what I expected", "text": "The only thing good about the pants is that they are the right length. I just did not expect the high waisted portion of the torso to be so high. I also feel like I should've ordered a larger size because they fit very tightly and are slightly uncomfortable even though I followed the size guide. The skirt is cute but again, it came up very high on me.", "rating": 2}, {"title": "My last order I didn’t get what I…", "text": "My last order I didn’t get what I actually ordered. I tried to explain that on a chat and of course they didn’t understand what I was talking about. They sent me a pair of black dress pants and when I ordered the black flared leggings with the back pockets just like the navy blue ones. I had ordered the week before. ", "rating": 2}, {"title": "Shipping took longer than expected", "text": "Shipping took longer than expected. Then once I recieved the product. All 3 rompers fit smaller than expected. I'm not happy at all. ", "rating": 2}, {"title": "Bad Smell.  The jeans are very comfortable but they…", "text": "The jeans are very comfortable but they stink of a stringent bleach smell, I washed them twice and they still stink", "rating": 2}, {"title": "The pants are great but they were…", "text": "The pants are great but they were delivered to the wrong address.", "rating": 2}, {"title": "Used my exact measurements and the…", "text": "Used my exact measurements and the pants I ordered are 2 sizes too big, so disappointed...they look and feel wonderful though ", "rating": 2}, {"title": "Do not fit any different then pants you…", "text": "Do not fit any different then pants you can buy from other retailers. They are iron free and material is comfortable. ", "rating": 2}, {"title": "The product seems like good quality", "text": "The product seems like good quality! My order was incorrect!! The support team responded quickly! However, the \"easy\" return has not been easy!!! Trying to get all the correct info to return is not easy!! Very frustrating! Don't have time to fool around with this! Was very easy to order and take my money!!! Not easy to fix it! Would be nice if can talk to someone to get this fixed! Otherwise I would not recommend this product!", "rating": 2}, {"title": "Shipping took 2.5 weeks", "text": "Shipping took 2.5 weeks. Kind of disappointing, but good product!", "rating": 2}, {"title": "A bit disappointed. ", "text": "I just received my order. I noticed right away that the clothing had a very strong smell to them. I washed them and they still have that strong smell. Tried on my purchase and the fit is okay in the hips, too loose in the waist and not long enough in the leg.", "rating": 2}, {"title": "Cool designs and fits but the quality…", "text": "Cool designs and fits but the quality of the fabrics isn’t good. After one wear there are clear signs of wear. I made a complaint about 3 items and got a refund. The customer service is very good. They answer quick, fair and are really there to help. ", "rating": 2}, {"title": "I have not been impressed", "text": "I have not been impressed with the fit of anything I’ve purchased this far. I’ve given several opportunities, with trying different items, however they don’t fit the way expected. ", "rating": 2}, {"title": "Returns should be allowed", "text": "Returns should be allowed. Most of what I ordered did not fit and when I checked my email to see about returning, it said all sales are final. Bummer! ", "rating": 2}, {"title": "Unsatisfied with the return fees", "text": "Unsatisfied with the return fees. The dress doesn't fit correctly and I have to pay to send it back. ", "rating": 2}, {"title": "Pants were not up to my standards", "text": "Pants were not up to my standards.  They ran big and the button popped off immediately ", "rating": 2}, {"title": "I made two orders", "text": "I made two orders, I have received the second order but not the first one…. I’m kinda frustrated with that. ", "rating": 2}, {"title": "sent wrong colour and they are made…", "text": "sent wrong colour and they are made really big not true to size :(", "rating": 2}, {"title": "Info about Return products", "text": "I haven't seen anywhere or been comunicated about the possibility of returning the products purchased and this makes the experience much worse", "rating": 2}, {"title": "BEWARE", "text": "Pants are comfy. Little expensive. But beware they will BOMBARD your email with review requests. I didn’t answer the first time.. leave me alone! Is Halara happy now? That I left a review? Maybe they will leave me alone now.", "rating": 2}, {"title": "The waistband is much too tight despite…", "text": "The waistband is much too tight despite carefully reading the sizing chart.", "rating": 2}, {"title": "Awful quality and charging for return…", "text": "Awful quality and charging for return was even worse.", "rating": 2}, {"title": "Shipping takes forever", "text": "It took over three weeks to get my order. I would not order again.", "rating": 2}, {"title": "Bought 2 pants", "text": "Bought 2 pants, same type, same size. One was slightly smaller and hard to get on past my thigh... quality in the material seems cheap like it will tear.Skirt is cute so that's a plus but won't be buying from here again", "rating": 2}, {"title": "The package took forever to arrive", "text": "The package took forever to arrive. The returning process takes forever.", "rating": 2}, {"title": "I ordered the same size but this time…", "text": "I ordered the same size but this time in petite.  I assumed (my first mistake) this would only mean inseam. The pants are so tight I can barely get them on. Maybe I will lose some weight???", "rating": 2}, {"title": "Delivered to the wrong address", "text": "Delivered to the wrong address, and took a while to get here so now I have to wait a while hopefully they send me my items ", "rating": 2}, {"title": "I purchased 2 pairs of pants", "text": "I purchased 2 pairs of pants, they were 2 for $49 I believe.  One pair of the pants came with a stain on the front.  In order for me to get a pair without the stain I would have had to pay to ship back the stained pair. That's not good customer service. ", "rating": 2}, {"title": "The clothing didn't fit as shown on the…", "text": "The clothing didn't fit as shown on the website.  Return process was very complicated.", "rating": 2}, {"title": "It took a long time to get them", "text": "It took a long time to get them. Also, I ordered the tall ones and they aren’t that tall at all, when I washed them they shrank.   Definitely not worth the cost", "rating": 2}, {"title": "Return all of it", "text": "Do not looks like the pictures unfortunatly. ", "rating": 2}, {"title": "Hole formed in item within 10 min of…", "text": "Hole formed in item within 10 min of wearing while at work. ", "rating": 2}, {"title": "Dress was too expensive to be…", "text": "Dress was too expensive to be completely see through", "rating": 2}, {"title": "Just ok", "text": "I ordered two items, both sized M petite. One was quite small, the other one rather large. The sizing is off. Apart from that, the quality of the pants was not what I expected for 35 Euro product. It was just ok.", "rating": 2}, {"title": "You told me you were going to give me a…", "text": "You told me you were going to give me a gift certificate for $43.15 within 24 hours and it’s been 24 hours!!!!", "rating": 2}, {"title": "Received incorrect style pants", "text": "Received incorrect style pants.  I have to pay for return shipping, very frustrating ", "rating": 2}, {"title": "My only issue was that it took so long…", "text": "My only issue was that it took so long to get shipped out and to arrive. ", "rating": 2}, {"title": "Disappointed with quality ", "text": "Only wore the trousers twice and a hole has appeared through the stitched seams. Quality is not good enough. ", "rating": 2}, {"title": "The shipping took a while and the…", "text": "The shipping took a while and the material on the cargo leggings is very itchy", "rating": 2}, {"title": "Love all my leggings I got", "text": "Love all my leggings I got. Tracking was what threw me off ", "rating": 2}, {"title": "It took a month for my order to arrive…", "text": "It took a month for my order to arrive and I’m still waiting on half of my order.", "rating": 2}, {"title": "I'm just upset my clothes were way too…", "text": "I'm just upset my clothes were way too big. This is not a cheap clothing line", "rating": 2}, {"title": "sizes are not accurate", "text": "sizes are not accurate. Return policy sucks. Won't buy again.", "rating": 2}, {"title": "No free returns so could be expensive", "text": "No free returns so could be expensive ", "rating": 2}, {"title": "The fabric is a knit, soft and comfortable but stretches..I suggest buy down a size. Hips stretch out....not a great look", "text": "The fabric is a knit, soft and comfortable but stretches..I suggest buy down a size. Hips stretch out....not a great look. ", "rating": 2}, {"title": "Sizing was definitely not accurate", "text": "Sizing was definitely not accurate, way too big. ", "rating": 2}, {"title": "false claims ", "text": "The leggings are nothing what they claim. ", "rating": 2}, {"title": "Its true to size but has a huge amount…", "text": "Its true to size but has a huge amount of material in the tummy i look pregnant in it. I won't wear it. Im.super bummed", "rating": 2}, {"title": "Not a fan", "text": "One pair super huge the other tight", "rating": 2}, {"title": "Don’t like the shipping costs for…", "text": "Don’t like the shipping costs for returns I am from Canada ", "rating": 2}, {"title": "I ask a adres to send back not a…", "text": "I ask a adres to send back not a coupon. Jeans ugly, top looks shit. I know I live in Europe but why so hard to send back? ", "rating": 2}, {"title": "Your clothes are great", "text": "Your clothes are great!  Shipping is to long.  31/2 weeks is just ridiclous!", "rating": 2}, {"title": "Shipping was VERY slow.", "text": "Shipping was VERY slow. ", "rating": 2}, {"title": "Not what I expected at all", "text": "Not what I expected at all. These leggings aren’t soft, and you feel the bum hem pulling from the crotch. ", "rating": 2}, {"title": "Quality less than expected", "text": "Quality less than expected, cut of the trousers is peculiar and very unflattering. ", "rating": 2}, {"title": "Sizes WAY out", "text": "Sizes WAY out.  Ordered XL and they fit my size 10 daughter in law!", "rating": 2}, {"title": "Don’t like fabric", "text": "Date of experience: November 05, 2024", "rating": 2}, {"title": "It just doesn't fit like it does in the…", "text": "It just doesn't fit like it does in the adds, I'm 119lbs and it makes me look puffy and large in the hips. I won't wear this. Waste of money!", "rating": 2}, {"title": "Cheap material", "text": "Pants ordered are just okay. Not what I can wear to work, will wear them when I clean the house", "rating": 2}, {"title": "Arrived Very Late", "text": "Nice clothing, but it took many days after its stated arrival date.", "rating": 2}, {"title": "The pants are itchy", "text": "The pants are itchy, i had them on for 30min and the are loose ready not holding", "rating": 2}, {"title": "Disappointed in pants", "text": "The pants did not look/fit/feel the same as the photos ", "rating": 2}, {"title": "Very mixed", "text": "Jeans were great. Stretchy pants ugly and very unflattering", "rating": 2}, {"title": "Very slow delivery", "text": "Very slow delivery. Colours weren’t quite as advertised. Somewhat disappointed in my order", "rating": 2}, {"title": "I ordered the petite sizes (I’m 5’3)…", "text": "I ordered the petite sizes (I’m 5’3) and they are still SO long.", "rating": 2}, {"title": "Great pricing !", "text": "All of the items from Halara are very reasonably priced!", "rating": 2}, {"title": "You asked me to ship back by mail for…", "text": "You asked me to ship back by mail for refundbut it cost me 25 to ship by Canada post", "rating": 2}, {"title": "Not Happy", "text": "I had to pay to get the pants tailored.  I did order the petite, yet the length was too long.", "rating": 2}, {"title": "Liked the service but didn't like the…", "text": "Liked the service but didn't like the pants :(", "rating": 2}, {"title": "Took way to long to get my order", "text": "Date of experience: October 23, 2024", "rating": 2}, {"title": "The pants I ordered smell really bad of…", "text": "The pants I ordered smell really bad of moth balls. I washed them twice and still they smell bad. 😞", "rating": 2}, {"title": "Pants was stained when it arrived.", "text": "Date of experience: October 31, 2024", "rating": 2}, {"title": "None of the clothes were as great as it…", "text": "None of the clothes were as great as it was advertised. ", "rating": 2}, {"title": "Just wasn’t what I expected", "text": "Just wasn’t what I expected ", "rating": 2}, {"title": "The pants don't fit", "text": "The pants don't fit, too big.  I don't feel it was true to size. ", "rating": 2}, {"title": "Still waiting for order", "text": "Still waiting for ordet", "rating": 2}, {"title": "You get what you pay for", "text": "Long delivery, product size/quality disappointing", "rating": 2}, {"title": "Sizing runs very small.", "text": "Sizing runs very small. ", "rating": 2}, {"title": "The leggings are so thin", "text": "The leggings are so thin, and they roll down badly. ", "rating": 2}, {"title": "Form schlecht für Hourglass Mädels", "text": "Date of experience: October 19, 2024", "rating": 2}, {"title": "Slow shipping", "text": "Slow shipping. Challenging return process. ", "rating": 2}, {"title": "Was late by 5 days.", "text": "Was late by 5 days. ", "rating": 2}, {"title": "The pants were too baggy", "text": "The pants were too baggy. They didn’t fit like it showed in the video.", "rating": 2}, {"title": "Everything I order is way too small", "text": "Date of experience: October 17, 2024", "rating": 2}, {"title": "Shipping took too long", "text": "Date of experience: October 25, 2024", "rating": 2}, {"title": "The délivrery was to long.", "text": "Date of experience: November 01, 2024", "rating": 2}, {"title": "Return process difficult", "text": "Return process difficult ", "rating": 2}, {"title": "The quality no good", "text": "The quality no good ", "rating": 2}, {"title": "Long and boxy", "text": "Long . Even with 2 inch heels. It made me look boxy", "rating": 2}, {"title": "Took 2 months to get to me and they…", "text": "Took 2 months to get to me and they poorly fit", "rating": 2}, {"title": "Sizes are wrong", "text": "Date of experience: November 01, 2024", "rating": 2}, {"title": "Pants did not fit well at all", "text": "Date of experience: October 22, 2024", "rating": 2}, {"title": "The pants are see through", "text": "The pants are see through ", "rating": 2}, {"title": "weird sizes ", "text": "weird sizes", "rating": 2}, {"title": "Clothes look cheap!", "text": "Date of experience: October 25, 2024", "rating": 2}, {"title": "First off", "text": "First off, these leggings are just not flattering on me. I have tried initiating a return, to no avail. Very frustrating to say the least.", "rating": 2}, {"title": "Shipping times is not it", "text": "So, the cinched Legging material was soft . The top of the leggings does roll down a bit when sitting or moving around. However, the butt-lifting flare leggings are not it. Those leggings do not hold you in anywhere. The topping of the cake was SHiPPING! The worst! If you ever need your clothes on time and as promised by the company, expect that shipping time to be tripled. Order three months in advance! My shipment took one and a half months to receive. ", "rating": 2}, {"title": "I was suppose to get petite but these…", "text": "I was suppose to get petite but these hang all over the floor . Very unhappy .", "rating": 2}, {"title": "Just wasn’t what I was expecting", "text": "Just wasn’t what I was expecting. They’re thinner than I would like. ", "rating": 2}, {"title": "Disappointed ", "text": "It took a month between ordering and receiving my items. I emailed customer service and their reply was in essence 'tough luck you ordered a pre sale item'. I was quite disappointed with the reply and won't use your company again. I would struggle to recommend this company. If ordering a sale item leads to being treated differently, you really need to look at business model. The products were beautiful though.", "rating": 2}, {"title": "None of the items fit as they do in the…", "text": "None of the items fit as they do in the photos. I waited so long for 3 items that I will never wear. I was so excited for these great work pants, but they have a tiny waist and really long legs. Who are they made for?? ", "rating": 2}, {"title": "ordered tall I am 5’11 and very short", "text": "ordered tall I am 5’11 and very short ", "rating": 2}, {"title": "Not as expected", "text": "Way lighter material than I thought it would be. Flared pants are not what I expected and the leggings have odd hems that are not straight. Very cheap and would not recommend.", "rating": 2}, {"title": "Materials and sizes weren’t what I…", "text": "Materials and sizes weren’t what I expected", "rating": 2}, {"title": "I received the wrong product", "text": "Date of experience: October 17, 2024", "rating": 2}, {"title": "The size is not good for me.", "text": "Date of experience: October 17, 2024", "rating": 2}, {"title": "I love the IDEA of these clothes", "text": "I love the IDEA of these clothes, and I plan to return and get new sizes, but I am very disappointed that I used the size charts and got both what my “measurements” said I should buy, and also the size smaller (in case!). However, when everything came in, it was all HUGE! I have to return and reorder 2 sizes smaller than what the chart recommended based on my measurements.", "rating": 2}, {"title": "Slow shipping, order early.", "text": "Like the pants but shipping takes 3 weeks.", "rating": 2}, {"title": "I ordered two things and a free gift…", "text": "I ordered two things and a free gift then came attached to it. I could not figure out how to remove the free gift as I do not want it. This was really irritating. I know a lot of people may want a free gift but I just want to order wha tI need and not get extra stuff that I don't need. If there is a way to remove unwanted items easily that would be great. ", "rating": 2}, {"title": "Wrong product information on website", "text": "Wrong product information on website.  Customer Support still expects me to pay for return shipping. ", "rating": 2}, {"title": "This is my 3rd and last purchase from…", "text": "This is my 3rd and last purchase from Halara. Poor quality overall, cheap, plastic, synthetic materials that ldon’t wear well or look anything other than cheap. Oh, and they take forever to deliver. ", "rating": 2}, {"title": "I don't like the material of the pants", "text": "I don't like the material of the pants.  It's not very nice.", "rating": 2}, {"title": "The flare stretch denim SNAGS!", "text": "The flare stretch denim pants fit great.  I was really excited.  BUT I quickly found that they snag really bad.  There are snags all over them now from my wedding ring and dog jumping on me.  I’m so disappointed as they fit great and looked so nice when I got them!", "rating": 2}, {"title": "Nothing like the picture either baggy…", "text": "Nothing like the picture either baggy and baggy and too tight at the waist. Do not fit like leggings like in the picture.  They are comfortable if I never want to leave the house. Sizing and length are way off.", "rating": 2}, {"title": "They are not true to size I where a…", "text": "They are not true to size I where a small and I can’t wear these there to small", "rating": 2}, {"title": "Would not recommend based on customer service ", "text": "Long wait time for shipping. Clothes were not as ordered and I had to pay for the return. ", "rating": 2}, {"title": "First order for leggings got lost", "text": "First order for leggings got lost, refunded my money. Ordered again and still too super long to arrive.", "rating": 2}, {"title": "Not fitted enough ", "text": "I find the pants a bit loose for XS I wish it was more fitted and more defining …", "rating": 2}, {"title": "LONG Shipping Time", "text": "The main issue is the shipping time. I understand that not everything can arrive in 2 days, but it took 14 days for my order of two pair of pants to arrive. I was under the impression that they were coming from Illinois, but the shipping label was out of Canada. Better logistics would definitely increase customer satisfaction.", "rating": 2}, {"title": "Returns are complicated and predatory", "text": "Returns are complicated and predatory. The site itself is predatory. No one is willing to give the return address and it's ridiculous that the consumer has to pay to return items. ", "rating": 2}, {"title": "Returns should be free or for a small…", "text": "Returns should be free or for a small charge only. We can’t try for perfect fit, and we can’t touch to see if we like the material. All clothes look beautiful in your advertising, but they aren’t always as they appear.  I can’t order from you if it costs me to return items, and if that process is as complicated as your company makes it.  ", "rating": 2}, {"title": "Took so long and the materials are not…", "text": "Took so long and the materials are not as good as I thought.", "rating": 2}, {"title": " return process is very complicated", "text": "The return process is very complicated. I do not think i will purchase in the future based off that", "rating": 2}, {"title": "Tall collection is not tall", "text": "The fact that you have to apply to be able to make a return, and you are then then offered the option of a gift card for some of the amount while keeping the clothes you don’t need is the worst when it comes to sustainability and responsibility. Also, don’t call your collection “tall” when that length is not by far long enough for a person on 183. Inseam is in fact regular on “tall” when comparing to other brands. Won’t shop here again.", "rating": 2}, {"title": "I like the item but it took forever to…", "text": "I like the item but it took forever to arrive. I think you should give a bit more warning that it will take at least a month to arrive as it is being shipped directly from China. Just be a bit more transparent and maybe give the odd update to reassure the customer that the order hasn't got lost! ", "rating": 2}, {"title": "So it took 2 weeks for the product to…", "text": "So it took 2 weeks for the product to be delivered. My main issue is the jeans smelled like straight up gasoline, the smell was so overpowering I put them straight in the wash. After the was the smell was the same and the jeans shrunk. I don’t think I need to say more", "rating": 2}, {"title": "Most items did not fit.", "text": "Most items did not fit.I need to do a return ", "rating": 2}, {"title": "Overall, disappointing ", "text": "I was really excited about my order (4 pairs of pants and a dress). However, I was not at all expecting that it would take 3+ weeks to be delivered. I was disappointed when part of my order (pair of pants I was excited about) was cancelled about a week after I placed my order. Once my other items arrived, I was happy with the dress. However, the work pants lose shape and become very loose after a few hours of wear. The athletic pants started to pill (small fuzzy pills) after I wore them once. ", "rating": 2}, {"title": "My order was very slow to be delivered", "text": "My order was very slow to be delivered. I like the product but don’t know if the almost month long delay was worth it ", "rating": 2}, {"title": "Pants fit fine around the waist but…", "text": "Pants fit fine around the waist but looked ridiculous everywhere else. Returning them was a nightmare. You have to pay for it and I had to message multiple times before the return was processed and I had the info I needed.  ", "rating": 2}, {"title": "Flimsy seethrough fabric", "text": "Flimsy seethrough fabric, took long to ship and couldn't track the package without getting the halara app. ", "rating": 2}, {"title": "I don't know what material this I'd…", "text": "I don't know what material this I'd they are using to make some of their clothes but it's not right. It doesn't feel right or lay right. The only thing I am keeping out of 7 things I purchased is the skirt. ", "rating": 2}, {"title": "Sadly, a waste of money", "text": "Long shipping time. The elastic waist band is very tight and uncomfortable. I probably would have ordered the medium long, knowing this instead, but am a small long everywhere else.", "rating": 2}, {"title": "My order came in reasonable time", "text": "My order came in reasonable time, I found the sizing a little bit smaller than I expected and the quality could be better for the price, although high waste they did come up very high. Not sure if I would order again as the clothes are quite high in price. ", "rating": 2}, {"title": "Shipping after ordering is way to long…", "text": "Shipping after ordering is way to long and there is no date about shipping ", "rating": 2}, {"title": "I ordered pants in a plus size assuming…", "text": "I ordered pants in a plus size assuming they would run a little small (I normally wear an XL). However, the waist was so small, I couldn’t come close to getting the pants over my hips.  I will be returning them.  Unfortunately, I ordered a second pair in an XL that, once it arrives, I assume it will also be much too small and will be returning it as well.  The fabric seemed nice but the elastic waist was ridiculously small.", "rating": 2}, {"title": "I asked for the fabric ", "text": "I asked for the fabric . You only said it was breathable . It is almost all polyester . My trousers feel very plastic .The cut was supposed to be straight but are far from it", "rating": 2}, {"title": "There aren’t Petit Size", "text": "No tienen petit SIze y son extremadamente largo.", "rating": 2}, {"title": "The website gave me a 25% off coupon…", "text": "The website gave me a 25% off coupon for signing up for text alerts that I couldn't even use!!!", "rating": 2}, {"title": "The pants were too big :(", "text": "Date of experience: October 10, 2024", "rating": 2}, {"title": "Package arrived timely, but poor quality", "text": "Package arrived timely. The quality of the pants are not as expected. They are quite thin and can only be worn in spring/ summer.  Tik Tok influences are really lying about the quality of the product.  I willbe returning the pants.", "rating": 2}, {"title": "The wide leg denim smells horribly", "text": "The wide leg, denim pants fit well, are comfortable & stylish. However, my only issue is the odor (reason for such a low rating). When I first opened the packaging there was a very noticeably, strong, mechanical smell. It's just awful. I hesitated submitting an immediate review because I was hopeful that washing the pants would solve the problem but it's been about 2 months & they have been washed more than 6 times & the smell is still there. I want to love them but I'm honestly embarrassed to wear them in public because it still smells so strong. Perfume doesn't even improve the smell. I don't understand why it stinks so bad. Is it just the denim? The other pair of athletic leggings I purchased in the same order does not have that smell.", "rating": 2}, {"title": "Shipping was very long", "text": "Shipping was very long. I think I waited a month. The two pairs of pants I ordered were cheap fabrics that snag and run easily. Because of shipping time, returns seem like a headache.The body suit I ordered was great. The \"gift\" of a PU card holder didn't come. ", "rating": 2}, {"title": "Had high hopes as I have bought 2 other…", "text": "Had high hopes as I have bought 2 other pairs. But they roll down very easily. ", "rating": 2}, {"title": "Size appears inconsistent. Buyer beware.", "text": "I had ordered three pairs of pants (a size L) that were amazing. I assumed that L was a safe bet, but the last order (high waisted, wide leg) was too small as a L. The pants are amazing, but I was disappointed to learn that size is not consistent with Halara. Unfortunately, I also learned that you cannot return these pants after final sale.", "rating": 2}, {"title": "Clothes were not good quality ", "text": "Clothes were not good quality Fit was way off from what was advertised Return process is a pain and costly ", "rating": 2}, {"title": "Viral leggings ", "text": "High wasted leggings keep rolling up and were very uncomfortable. ", "rating": 2}, {"title": "It took 4 weeks for my order to arrive", "text": "It took 4 weeks for my order to arrive. I literally ordered 5 pair of leggings and just because one was a “pre sale” item, customer service told me that the entire order had to ship st the same time. ", "rating": 2}, {"title": "The sizes are small ", "text": "The sizes are small. I bought 3 pairs, I got two on and pulled tags off, but when wearing them, they are tight on the waist and really hurt. I couldn’t get the other pair on they were so small. I’m trying to return the tiny pair and it’s complicated and a multi step process to get an address and guidance on how to return. The fabric is nice on all 3 pairs though, so a bigger size would probably be good, but the 3 I got are small for the size. ", "rating": 2}, {"title": "Delivery took a really long time! Now I'm reluctant to return the items that don't fit knowing the turnaround time.", "text": "Delivery too a really long time! ", "rating": 2}, {"title": "The clothes look cheaply made", "text": "The clothes look cheaply made, different than the website. I typically wear a size 8/10 or Medium in pants and all of the mediums fit fine except the waist was too tight. ", "rating": 2}, {"title": "I ordered jeans", "text": "I ordered jeans, they have three holes in them, looks like someone cut open a box with a blade & cut through the material.", "rating": 2}, {"title": "Fit true to size.Great material but not…", "text": "Fit true to size.Great material but not what I thought I was ordering,", "rating": 2}, {"title": "Loved the material but was a final sale…", "text": "Loved the material but was a final sale and nothing fit me so very disappointed since I am stuck with them ", "rating": 2}, {"title": "They are not what I expected", "text": "They are not what I expected. Very thin and roll down ", "rating": 2}, {"title": "I regret making a purchase because you…", "text": "I regret making a purchase because you send me multiple emails every day. Reduce the frequency!", "rating": 2}, {"title": "The material reminds me of the material…", "text": "The material reminds me of the material scrubs are made of but heavier.  If you are under 5'5\" the petite are not for you.  I am 5'2\" and there was at least 4\" under my feet.Also large says it fits 12 to 14...it's more a 10 to 12 size.", "rating": 2}, {"title": "I did not receive my Second Pare of…", "text": "I did not receive my Second Pare of Free Pants ", "rating": 2}, {"title": "Products were average", "text": "Products were average. Better than expected though.  Biggest most concerning and disgusting thing was the pull on jeggings smells horrible.. like dead fish. It’s nauseating. Almost threw them out. What the hell is going on with your quality standards??!?", "rating": 2}, {"title": "Ripped pants", "text": "The cargo pants I ordered ripped in the crotch just after putting on on both pairs. ", "rating": 2}, {"title": "I had a long drawn out time of just…", "text": "I had a long drawn out time of just trying to get a return back to you.  Now I see that the very items I returned you have sent back to me??!!", "rating": 2}, {"title": "Defective pants", "text": "A pair of leggings showed up with loose stitching in the crotch area, getting asked of customer service is almost impossible ", "rating": 2}, {"title": "This was my first purchase and will…", "text": "This was my first purchase and will also be my last. Took way too long to receive and the leggings were horrible. The only way to keep the waistband from rolling was to pull them up to my chest…seriously? I really don’t understand the hype with these products.", "rating": 2}, {"title": "Long time to receive and pants…", "text": "Long time to receive and pants immediately got a snag", "rating": 2}, {"title": "The leggings roll down ", "text": "Everyone said they leggings don’t roll down they definitely roll down a lot and don’t stay up at all. ", "rating": 2}, {"title": "Ehh..not impressed", "text": "LATE SHIPPING even after paying for upgraded. Could not even track it either. Customer service gives you the run around. Clothes are alright........Wouldnt bother shopping with them again though to be honest.", "rating": 2}, {"title": "It took so long to receive my order and…", "text": "It took so long to receive my order and when it did finally show up we were out of time for the weekend and it went missing ", "rating": 2}, {"title": "Way to long supposed to be petite", "text": "Date of experience: October 15, 2024", "rating": 2}, {"title": "First time shopper purchased maternity…", "text": "First time shopper purchased maternity leggings size small. I am 121lbs 5’5” the pants were not full length and a little too thin for my liking. When I’m pregnant I like full support and coverage and unfortunately did not find that in these ", "rating": 2}, {"title": "It took 2 weeks to receive", "text": "It took 2 weeks to receive. I was under the impression that these were shipped from the United States, as a warehouse is located here. It wasn't until after I received the tracking information that it was shown to be shipping from overseas. I likely will not order again as it takes so long to arrive. ", "rating": 2}, {"title": "Clothes run very small", "text": "Clothes run very small. Take too long to arrive.", "rating": 2}, {"title": "Sizing is so inconsistent", "text": "Sizing is so inconsistent.   Can only use one of 5 items ordered.  ", "rating": 2}, {"title": "Second time ordering", "text": "Second time ordering.  Ordered the crossover Jean leggings. They auto subbed my full length order for 7/8 length without clarification. I’m tall so they are capris on me. Not a fan of capris  The items are considered a final sale so they are non returnable ", "rating": 2}, {"title": "I ordered 3 pairs that I cant return…", "text": "I ordered 3 pairs that I cant return size 2x and only 1 pair fits.  I spent $188", "rating": 2}, {"title": "The return policy is a little too…", "text": "The return policy is a little too difficult.", "rating": 2}, {"title": "I ordered the buy 1 get 1 free I only…", "text": "I ordered the buy 1 get 1 free I only received 1 pair?", "rating": 2}, {"title": "The pants are not long enough for a…", "text": "The pants are not long enough for a tall person.", "rating": 2}, {"title": "Delivery is really slow", "text": "Delivery is really slow. Almost 2 weeks for items to arrive when I am used to next day delivery. Leggings are nice but delivery needs to be a lot quicker for me to purchase again.", "rating": 2}, {"title": "Sizing is off", "text": "Sizing is off. They are too small", "rating": 2}, {"title": "I have ordered a couple times and was…", "text": "I have ordered a couple times and was happy with my order only once the dresses ordered not like picks 🙃 ", "rating": 2}, {"title": "Large was way too big but the medium…", "text": "Large was way too big but the medium was ridiculously small and super thin material. Doesn't seem like they'll hold up long. ", "rating": 2}, {"title": "The return process is not easy", "text": "The return process is not easy, at all! ", "rating": 2}, {"title": "Return policy unclear", "text": "I do love the clothes I ordered from Halara but they do not fit and unfortunately I just found out that none of my items can be returned. I’m very disappointed and had hoped to have some nice but comfortable clothes to wear to work. I won’t be ordering because I can’t afford to lose that much money. I’m just hoping to find someone who can wear them and that they will be willing to buy them. I always look for the return policy but the first time I see “this item can not be returned “ is on the invoice AFTER I receive my order. This should not happen. ", "rating": 2}, {"title": "The crotch area is too baggy doesn’t…", "text": "The crotch area is too baggy doesn’t look flattering ", "rating": 2}, {"title": "The fabric is very thin", "text": "The fabric is very thin. I returned the dresses. ", "rating": 2}, {"title": "The inseam measurement was not correct", "text": "The inseam measurement was not correct. My jeans were covered in snags. For the price, I expected better quality.", "rating": 2}, {"title": "Giving more information about the…", "text": "Giving more information about the delivery ", "rating": 2}, {"title": "Loved the look of the jeans I got but…", "text": "Loved the look of the jeans I got but the zipper was flimsy and broke on my second wear. Blazer is holding up.", "rating": 2}, {"title": "You have  nice  clothes,but the sizing…", "text": "You have  nice  clothes,but the sizing is grossfor the price that you ask you should back up your product a little bit better than you do and believe me this is the most sincere ingenuine as soon as I send this I am going to unsubscribe you I don't want I don't want any more of your crap ", "rating": 2}, {"title": "I’m not impressed with the material the…", "text": "I’m not impressed with the material the pants are made of. I think Quality of materials is good but needs to be a softer material. You can hear one walking with this material!! I will wear as a lounging pant but not in public! ", "rating": 2}, {"title": "Crappy quality, crappier service", "text": "I ordered several items. One arrived not fully sewn together. The sizing between the items was also very inconsistent and stitching quality not great. They were NOT transparent about their return policy - anything you get a discount with is apparently not returnable or exchangeable. I reached out regarding my not sewn together pants and no answer, radio silence. Waste of $200 - will never do it again", "rating": 2}, {"title": "Return process is grueling.  ", "text": "I ordered two items.  One of which I loved!  The other didn't fit in length and looked cheap to me.  I have been trying to make a return, but they have me jumping through hoops, asking for photos of the product, etc.  All we should have to do is print a return label and send it back for a refund. ", "rating": 2}, {"title": "trouble with returns", "text": "this has happened more than once-- I tried to initiate a return and the order seems to have disappeared from my history.  I have no emails confirming my return and no instructions. I know in the past, Halara refunded my account and had me donate the items I didn't want, but I don't know why this is so hard to see online and I don't know what's happening with this one now.  Please make your returns system more transparent. ", "rating": 2}, {"title": "Slow shipping", "text": "Shipping takes so long, took a month to receive my items. Returns are difficult and costly. ", "rating": 2}, {"title": "They changed the fabric of their jeans", "text": "They changed the fabric of their jeans. It's thinner thus making it too stretchy and loose. I'm really disappointed because this used to be My favorite kind of jeans. ", "rating": 2}, {"title": "Sizing is weird", "text": "Sizing is weird! Both pairs of pants I got were bunchy in the groin/front... Comfy material for sure but won't be buying any more. ", "rating": 2}, {"title": "Jeans great but slow shipping for overall price.", "text": "Actual jeans were great but marking down as shipping took much longer than expected (with the high price tag). ", "rating": 2}, {"title": "Return policy is difficult and only…", "text": "Return policy is difficult and only received a gift card for 1/2 the purchase.Quality of product was good", "rating": 2}, {"title": "Shipping time is absurdly slow.", "text": "Shipping time is absurdly slow. ", "rating": 2}, {"title": "Long shipping and misleading size chart", "text": "I was so excited about the pants and skirt I ordered through Halara! However, it took over two weeks for my order to come in. When the order came in, the pants and skirt were way too tight. I measured myself and ordered the size based on my measurements in the sizing chart. Now I’m torn what to do. I want to order the next larger size because they are so comfortable, but I don’t want to wait another two weeks or more waiting for the package. I also ordered them when they had a deal going on and won’t get the same price. ", "rating": 2}, {"title": "Took 3 weeks to receive order", "text": "Took 3 weeks to receive order. Sizes is so different from style to style . The return process sucks . ", "rating": 2}, {"title": "No where near the quality I was…", "text": "No where near the quality I was expecting ", "rating": 2}, {"title": "Clothes are great, if delivered", "text": "Honestly the clothes are great, but the delivery estimates need to be adjusted. I previously had a Halara delivery that disappeared and I never received (and was refunded accordingly), and this one took so long (much longer than estimated) that I feared that would happen again. ", "rating": 2}, {"title": "Disappointed", "text": "I never got updates on my order so I was convinced I was scammed for a while. I was SO excited when I got the clothes because of how cute they look! I was disappointment when I opened them to find they weren't a study, durable material, but felt more like chiffon. I was even more disappointment when I put them on. They weren't flattering on me. I think they're meant for skinny girls. ", "rating": 2}, {"title": "The clothes were the wrong size even…", "text": "The clothes were the wrong size even though I used the Size Chart as a guide.  the return process was unnecessarily complicated, when the end result was either pay the return postage yourself or take a gift card.  I chose a gift card and it came quickly.   However, I will not order from Halara again after using the gift card.", "rating": 2}, {"title": "Soft & Comfy, but Terrible Return Process", "text": "I tried 3 different pairs of pants. They were all so soft and would have been comfortable if they were the right size. I just wanted to exchange for a size up - but that is not offered in the Tall size. So then I decided just to return the pants. The return process is ridiculous. You need to upload photos and then wait for \"approval\". Nearly a week later and I'm still waiting for the information to send the pants back - and I need to pay the shipping. The other option was to keep the pants and get a Halara gift card. Not helpful - then I have a pile of pants that don't fit, can't order the size I need, and don't want to try anything else because the return process is so annoying. If you are confident in your fit, or don't have hips like I do, I'm sure these are wonderful, comfy pants - but not worth the hassle if you think you may need to return/exchange.", "rating": 2}, {"title": "The product is ALWAYS amazing...", "text": "The product is ALWAYS amazing.... ALWAYS. The customer service was sub par this time. I had placed an order and the billing updated the shipping to the incorrect address.. I IMMEDIATELY reached out to customer service who assured me that the address was updated and correct.. Got an email 3 days later stating the address was unable to update due to the product already being shipped. It was super inconvenient having to go to my accountants office to get my product - especially after being assured that the address was updated less than 5 minutes after the order was placed. ", "rating": 2}, {"title": "Way too long and too tight at the waist", "text": "Date of experience: October 11, 2024", "rating": 2}, {"title": "Last time i order ", "text": "Delifery took a Month. The quality of products are really cheap and super overprized. This was the last time I order. Return policy is weird takes to much effort I wont even Bother. ", "rating": 2}, {"title": "Cute design but poor quality", "text": "Cute design, but shipping took forever because pre-order kept being pushed back and the quality wasn't as good as I would have expected. There are companies making similar product with much better quality of fabric.", "rating": 2}, {"title": "Returns process is inconvenient and not…", "text": "Returns process is inconvenient and not transparent. I won't shop with the company again. Online retailers need to make returns easy - even if it means slightly higher prices ", "rating": 2}, {"title": "No accountability for wrong delivery ", "text": "I love the product but it's just the process it took to get here was unsatisfactory. They sent it to the wrong address but insisted they had delivered it. I only realized it was wrong address when I asked for picture of delivered product and it was not my house. They offered no apology on their behalf, instead blaming it on the courier.... But its their responsibility to pick reliable couriers, not mine. They did not offer a future discount for my inconvenience, even when asked. ", "rating": 2}, {"title": "Love the product but HATE how long it…", "text": "Love the product but HATE how long it takes to arrive at my house.I don’t think I will be ordering from Halara again.", "rating": 2}, {"title": "See threw material ", "text": "See threw material . Ripped in front where the zipper looks", "rating": 2}, {"title": "Not true to size", "text": "Date of experience: October 03, 2024", "rating": 2}, {"title": "Not happy 😔", "text": "I’ve ordered twice and both times the leggings didn’t fit. I ordered a small the first time (according to your size chart) and they were WAY too small!!! So when I contacted customer service they were VERY SLOW in getting back to me. When I finally got some assistance they suggested a large next time so that’s what I ordered. The leggings are WAY TOO LARGE this time. I guess I need a medium but I don’t need to keep either pair and I’m stuck with them since you offer a gift card instead of a return option and I have to pay shipping so I lose all the way around!!!! I’ve had a very, very frustrating experience with your company. 😔", "rating": 2}, {"title": "Color of the pants looked like a soft…", "text": "Color of the pants looked like a soft brown online. Pants color is like yellow mustard color! Not happy with color at all!", "rating": 2}, {"title": "I am returning a pair of pants,no instructions on how or where to mail them", "text": "I am returning a pair of pants, ", "rating": 2}, {"title": "Awful smell when arrived ", "text": "When the jeans arrived they smelled overwhelmingly like moth balls. I’ve washed them twice and still can’t bare the smell. ", "rating": 2}, {"title": "Non-user friendly website; bad return policy", "text": "I like Halara's variety and quality of clothes. However, the website is not user friendly and makes modifying searches for specific sizes and styles very difficult (especially when looking for petite sizes). I also don't like the return process and policy. If customers wish to return their clothes, they have to pay for the return cost themselves, which can be expensive since the pacakge is shipped overseas. In addition to the inconsistent clothing sizes, there's a lot to be desired with Halara. ", "rating": 2}, {"title": "It was stressful ", "text": "It was stressful , first 90% of my order never arrived. Then my order didn’t show up so I could return what didn’t fit. Then was told it was too late to return my item even though it actually was not. You have to jump through hoops to just return items. And gave to pay for the return shipping. I will not be ordering again. ", "rating": 2}, {"title": "Go with the denim ", "text": "I bought 3 items and liked the denim bell bottom stretch jeans. They fit snug and flatter my ample bottom- although they’re a little bit short. I did not like the stretchy cargo pants and leggings I ordered. The pockets are floppy and they just don’t flatter. Not exactly sure what it is about the cut or the seams, but it’s weird. The material is decent - it’s light and good colors. I returned those items and opted for credit and have ordered a denim skirt and pair of leggings which I’m waiting for now. The free gifts were good quality and I’m using the hair scrunchies and the card holder. ", "rating": 2}, {"title": "Fabric is very thin", "text": "Date of experience: October 11, 2024", "rating": 2}, {"title": "The buttons were not sewn onto the…", "text": "The buttons were not sewn onto the leggings tightly and are all almost falling off. After one wash, I had to sew on a button that had come off in the washer. The buttons are secured loosely with not enough string. Low quality. ", "rating": 2}, {"title": "The prices and deals advertised are not…", "text": "The prices and deals advertised are not what actually shows up in the shopping cart! I had to contact customer service twice to get the advertised deal! Then it takes forever to actually receive your order ", "rating": 2}, {"title": "You have to take pictures to return…", "text": "You have to take pictures to return despite the clothing fitting awful. Terrible way to make someone feel uncomfortable sharing unflattering pictures with others. Never again.", "rating": 2}, {"title": "Comfy but be ready to wait ", "text": "Pants are soft and comfy however I was very disappointed that it took almost 6 weeks from when I ordered them to when I received them. The stitching is also unfortunately quite unprofessional ", "rating": 2}, {"title": "Late delivery ", "text": "The delivery was delayed by 19 days! It took way too long for delivery and the only thing Halara offered was an 8% discount on my next order of $95 or more.  The outfit was nice but it’s not worth the long delivery wait. I won’t be ordering again. ", "rating": 2}, {"title": "Wrong size", "text": "Wrong size. My fault. Return too difficult for the price. Check your size!!! Pictures do not reflect size. ", "rating": 2}, {"title": "Clothing sizing not accurate", "text": "Clothing sizing not accurate. Everything I ordered was too big and now I have to pay to ship back", "rating": 2}, {"title": "Fabric ", "text": "Fabric not cotton but polyester. What is this the 1970s? Unsatisfied", "rating": 2}, {"title": "I’m extremely disappointed with…", "text": "I’m extremely disappointed with Halara’s return process. It’s confusing and lacks transparency, especially when it comes to understanding the total charges before choosing a refund method. On top of that, the 30-day wait for a refund to the original payment method is unreasonable. This experience has been frustrating, and I won’t be purchasing from Halara again due to the poor customer service.", "rating": 2}, {"title": "The sizing was off and was not what I…", "text": "The sizing was off and was not what I was expecting. ", "rating": 2}, {"title": "My pants were too tight!  No exchanges!", "text": "My pants  are too small and I need to get a larger size but in the return process you have to supply a photo of yourself in the pants to PROVE they are too small!  Never had I have to supply a photo of something that doesn’t fit correctly.  No exchanges either so after waiting two weeks to receive them it will take two weeks to send back and then I can receive my refund to order a larger size.  Seems like way too much work for me ", "rating": 2}, {"title": "You don’t pay the return shipping", "text": "The fact that you don’t pay the shipping for returns means that I’ll never shop with you again. ", "rating": 2}, {"title": "It did not fit.", "text": "It did not fit.. big and a bit long !!!", "rating": 2}, {"title": "Sizing is way out off", "text": "Sizing is way out off. Your sizing is more for teen girls.", "rating": 2}, {"title": "Trying to return item no return form or…", "text": "Trying to return item no return form or address to return my item ? ", "rating": 2}, {"title": "Return policy is ridiculous!!", "text": "Return policy is ridiculous!! ", "rating": 2}, {"title": "Had to return jeans", "text": "Had to return jeans. Nice but didn’t love them. Return policy, crazy… so many emails/steps. Then, you don’t cover return!! Won’t be ordering again!", "rating": 2}, {"title": "I was disappointed that Halara does not…", "text": "I was disappointed that Halara does not exchange merchandise. I planned to return for my money back but there were so many steps I just decided to keep and wear them over other clothes, which defeats the purpose of me buying them. I would have given a one but I love my first order of other pants, which is what I wanted in the first place. ", "rating": 2}, {"title": "Bunched material at the midsection…", "text": "Bunched material at the midsection makes me look pregnant. Baggy and not in the cute way", "rating": 2}, {"title": "Didn't get what I ordered. ", "text": "I recieved 5 pants.  4 of which were duplicates.  Two of which were too small. ", "rating": 2}, {"title": "Return process", "text": "I don’t think it makes sense to force a photo upload for each return. Also way too much back and forth to process a return ", "rating": 2}, {"title": "Long shipping time", "text": "I had no problems ordering, it was the shipping. Shipping took forever. It seriously took about two weeks to get my order. I will order off TikTok next time, the price was better off there and shipping is faster. ", "rating": 2}, {"title": "The pants were a lot wider than pictured", "text": "Date of experience: October 02, 2024", "rating": 2}, {"title": "too thin", "text": "too thin, bought these for work based on the reviews and no ", "rating": 2}, {"title": "The sizes are too big in the waist", "text": "The sizes are too big in the waist. I ordered plus size but they fit everywhere except the waist so the fall down. Thea seams can be felt ", "rating": 2}, {"title": "I was so excited ", "text": "I was so excited to place my first order. I even paid for express 3-5 business days shipping. I placed my order on a Sunday, expecting my packages to be delivered the following weekend, or Monday. It was still almost 2 weeks later with express shipping. Don’t waste your money. Yes the pants I ordered are okay, but I could have gotten something similar on Amazon a lot faster.  ", "rating": 2}, {"title": "They advertise \"easy returns\" which is a LIE. HIGHLY DISAPPOINTED!!", "text": "I'm returning the clothes I got bc they don't fit right on me and HALARA wants pictures before returning the items! That's the most ridiculous thing. They don't believe me that the jumper suit is too SHORT or the that it doesn't fit my body type. The material and everything about the clothes was OFF. DEFINITELY won't be giving my business to them again. And they advertise \"Easy Returns\". Lol. No. ", "rating": 2}, {"title": "Could be better", "text": "It would be helpful if there were pictures or something showing an item was delivered. I made a purchase worth a little over $64 with the sale. Got In the help chat and they were not helpful. Everything they suggested I’ve done. After a few days I did get some solutions. But I feel this could have all been avoided with accurate information. I have another shipment coming and I’m hoping the same thing doesn’t happen.", "rating": 2}, {"title": "Inconsistent Sizing", "text": "This was my first Halara purchase. I ordered the Halara Flex™ High Waisted Plicated Side Pocket Wide Leg Waffle Work pants in two colors, both size 1X. One pair fits well and is very comfortable, but the waist in the other pair is 4-5\" wider even though the tags both say 1X. Had to return the wider pair even though I liked the color. Not sure if this is typical for the brand, but it makes me hesitant to buy again.", "rating": 2}, {"title": "The fabric is not what I expected", "text": "The fabric is not what I expected.  The pockets on the ‘utility’ pants were only big enough to put my debit card in but not secure enough to put anything in.  The ‘cinch’ leggings definitely pull your waist in.  They also push any rolls up and flatten your behind.  Your customers are responsible for covering the cost of returns so I’m stuck with them.  ", "rating": 2}, {"title": "Runs Small", "text": "I'm disappointed the pants don't fit,  even though I followed the sizing chart. ", "rating": 2}, {"title": "Mediocre ", "text": "I always question ordering from something I’ve seen on instagram but I caved. I ordered 2 pairs of pants: one just wasn’t my size (my fault, I’ve lost weight recently I just have no idea my size anymore) and had all fake pockets which I can’t do and the other pair the same size but also a zipper came broken on the pocket. I ordered a bodysuit that fit perfect and was cute and am keeping. My biggest thing with companies and why I vote so low is when they make you pay for returns. So I refuse to order from them again. Especially because it’s so hard to tell your size somewhere new especially as a woman. On top of that it’s a 5 step process to even get the return going. It’s been almost a week I still don’t have an address to return my stuff to. They want you to break down and just get the store credit. You get to keep the clothes but I don’t need broken, too big clothes.", "rating": 2}, {"title": "Returns must be approved by customer…", "text": "Returns must be approved by customer service and paid by the customer. Given the current market for similar brands, with similar price range who offer free and seamless returns, this service is not competitive.", "rating": 2}, {"title": "Runs small and smells like chemicals", "text": "I didn't know it would take so long to arrive. AND, when they finally did arrive, they had a chemical smell EVEN AFTER I washed them with Oxy powder + 2 laundry pods + fabric softener.", "rating": 2}, {"title": "All of the sizing was wrong and poor…", "text": "All of the sizing was wrong and poor fit. ", "rating": 2}, {"title": "Length of the pants was waaaaay too…", "text": "Length of the pants was waaaaay too long. ", "rating": 2}, {"title": "I love the shirt I got", "text": "I love the shirt I got! I didn’t like the shorts at all. However/ my skirt was too big,And my replacement took forever to arrive, and apparently got lost, and Halara told me to contact the Post Office.Leary to order again.", "rating": 2}, {"title": "Although I have had a great experience…", "text": "Although I have had a great experience in the past with Halara. I recently made a purchase of a skirt and couldn't believe how cheap it was made. I hate to give a lower rating as the pants I have ordered have exceeded my expectations. It appears that not all clothing sold on this site is equal. This won't influence my future purchases, but I think I will stick to pants. ", "rating": 2}, {"title": "Not worth the wait", "text": "My order was super late.  Even thought only 1 item was a pre order, everything else shipped with that item making it like 15 business days.  5 out of 7 items didn't fit.  Even though they're my size.  I want to return the items but to return them requires a picture of how gross you look in each item.  Which is truly a pain in the butt to try everything on and then send a picture to a website, especially when a pair of pants won't even fit over your thighs.  2 pairs of pants in a medium fit, 4 pairs didn't...so sizing is not the same for all products.", "rating": 2}, {"title": "They offered a 20% off coupon to apply…", "text": "They offered a 20% off coupon to apply to your purchase if you sign up for SMS messages. Only for that code not to apply to most of the items. Definitely a bait and switch", "rating": 2}, {"title": "Shipping takes too long.", "text": "Shipping takes too long. ", "rating": 2}, {"title": "Significant discounts are advertised", "text": "Significant discounts are advertised. Each time I’ve look at advertisements over the past year, they’re really not discounted much. Original prices are way too high for product, which makes the discount seem substantial and it’s really not that great for the products received. Product is fine. ", "rating": 2}, {"title": "I ordered XS petite and got XS normal", "text": "I ordered XS petite and got XS normal, way too long ", "rating": 2}, {"title": "Disappointed with purchase", "text": "Disappointed with purchase. I was very excited to feel what felt like great quality in the shirts I purchased. After a single wear, my shirt has several pulls now creating holes in both the front and the sleeves of the shirt. For the price you pay, these should last longer than a SINGLE use. ", "rating": 2}, {"title": "I am trying to get a refund and they…", "text": "I am trying to get a refund and they are offering me a gift card. I want a refund but cannot email anyone or call anyone. The links do not work. ", "rating": 2}, {"title": "Took forever with no communication or…", "text": "Took forever with no communication or updates, shipping company delivered in the middle of the night and woke my dog! ", "rating": 2}, {"title": "The product is very nice but it took…", "text": "The product is very nice but it took way too long to arrive", "rating": 2}, {"title": "The overalls I bought do not look like…", "text": "The overalls I bought do not look like the pictures online. I don’t like them very And it took a long long time to get to me", "rating": 2}, {"title": "Returning item(s) is very difficult", "text": "Returning item(s) is very difficult. In all my years of doing on line clothing purchases I have never had to take the time to take photos of items to be returned.  There is next step after next step and continuous delays.  I will seriously have to think about if I want to place any future orders.  ", "rating": 2}, {"title": "Not a future customer - Return process complicated", "text": "This review is for Halara, not happy returns. The return process is not easy and straightforward. Having customers navigate an overly mitigated and unnecessary multistep return does not bode well. The only way I got a straightforward answer was to communicate with a human using the chat bot. Previously, I followed instructions in the emails only to be told I “did not select a process for the return” in the chat. Upon providing the process order confirmation number to the chat human,  I finally got an email with return label and instructions. Unfortunately I will not be ordering from Halara in the future. Happy Returns was, as usual, a happy experience. ", "rating": 2}, {"title": "I thought pricing was decent and a lot…", "text": "I thought pricing was decent and a lot of the items I selected were discounted but the quality of the clothing is terrible super cheap and you can tell right away. Shipping updates were hard to navigate and never updated so it took about 3 1/2 weeks of worrying before my clothes finally go to me. This was my first shopping experience with the company and likely to be my last…hate to say had really high hopes for this brand ", "rating": 2}, {"title": "Only one of the pairs of pants actually…", "text": "Only one of the pairs of pants actually fit . They also send the exact same pant that I ordered in the exact same size I ordered and labels the same but one of the pairs was about 3 sizes too small while the other one fit perfect. ", "rating": 2}, {"title": "Refund Request Issue", "text": "I have requested a refund but still have not heard anything back in order to process this.  I submitted my request 10-2-2024 and it looks like that haven't processed my request yet.  I hope I do not run out of time to return these items.", "rating": 2}, {"title": "Both trousers are from very thin…", "text": "Both trousers are from very thin fabricage and one came in a bit ragged", "rating": 2}, {"title": "I’m still waiting for an email to start…", "text": "I’m still waiting for an email to start the return process.It’s been 2 days and was promised it would be sent within 24 hours.Only giving 2 stars because the purchasing and shipping was good.", "rating": 2}, {"title": "Sizing is wrong.", "text": "Sizing is wrong. ", "rating": 2}, {"title": "I REALLY wanted to like these…", "text": "I REALLY wanted to like these jogger/leggings. I read all reviews before placing my order and read NOTHING negative. That included how they were true to size. I'm a true size 14. They fit but I didn't care for the material. I was expecting to smooth out my bumps and meno belly but only drew attention to the problem areas. Hoping customer service is as nice as I also read because I'd like to return my order. ", "rating": 2}, {"title": "The jeans cost me almost $60 but the…", "text": "The jeans cost me almost $60 but the fabric is not good, also they are quite loose. I am disappointed.", "rating": 2}, {"title": "Returns process is a nightmare … won’t buy again ", "text": "Cute pants suit I kept but I won’t buy from Halara again. Return process has been extensive - several email requests to actually even get a shipping label. It’s unfortunate because they have cute clothes but I won’t risk it given the many other options online who do easy returns. ", "rating": 2}, {"title": "Probably won’t buy again", "text": "The quality is lower than I expected it would be. I ordered two lengths of trousers - the standard is too short and the long if far too long. ", "rating": 2}, {"title": "Just okay ", "text": "Received my order in a reasonable amount of time, but I expected more from the leggings I bought. They roll at the top & don’t hide my fupa at all.", "rating": 2}, {"title": "don't pay for express shipping", "text": "I paid for express shipping and did not recieve the skirt in time for vacation.  When i notified halara that i paid fextra for express shipping so that i would have the item before I left for vacation they never responded and never refunded the payment made for express shipping.", "rating": 2}, {"title": "Not what I hoped", "text": "Not what I hoped. They call them straight leg but to me they are full wide legged. They fit large so I would recommend to down size. The feel of the material is nice. ", "rating": 2}, {"title": "Terrible return policy for Canadian…", "text": "Terrible return policy for Canadian customers. It cost more to return it than the price of the pants. Won’t order again, just for that reason. ", "rating": 2}, {"title": "Not sustainable and return policy below standard", "text": "The fabric of the clothes aren’t sustainable. Unfortunately not a decent quality. The return policy seems to be deliberately discouraged. I've heard that Halara would contact me, but haven't heard from them.", "rating": 2}, {"title": "One month to receive it this is the…", "text": "One month to receive it this is the second time and same problem ", "rating": 2}, {"title": "Not a good fit or fabric", "text": "Date of experience: October 05, 2024", "rating": 2}, {"title": "Trying to return cause they don’t fit…", "text": "Trying to return cause they don’t fit me right and not what I expected and it’s alot of back and forth. Returning should be easier", "rating": 2}, {"title": "3 weeks to get delivered & no free gift!", "text": "Order took 3 weeks to get delivered. I was suppose to get 2 free gifts with my order and didn't get either. ", "rating": 2}, {"title": "Returns process very poor won’t order…", "text": "Returns process very poor won’t order again", "rating": 2}, {"title": "Sizing well out to the size…", "text": "Sizing well out to the size chart.having to send back and pay for returns.", "rating": 2}, {"title": "Took too long", "text": "Took so long, I forgot I had ordered.", "rating": 2}, {"title": "Order issues", "text": "I couldn't track my order anywhere and the product is not what I expected", "rating": 2}, {"title": "Horrible if you have issues", "text": "I like the items that fit but the return policy is ridiculous.  And the customer support is not great.  Have to keep messaging to get a response.  Not worth the hassle.My first order was missing an item and I had to repeatedly message them to get it resolved.  Both times I ordered I had issues (second time I had one item that didn't fit) and both times I had to email numerous times and it took over a week to get any somewhat helpful answer.", "rating": 2}, {"title": "Too big", "text": "I liked the fabric and the length, but these are not made for super skinny women. I’m 5’2” and about 95lbs, and even in XS/Petite the legs were too loose and so the pants just didn’t look good ", "rating": 2}, {"title": "Very long time till parcel arrives and…", "text": "Very long time till parcel arrives and some of the items comes in wrong size .I ordered size 16-18 and they much smaller then 16 at all . Disappointed.", "rating": 2}, {"title": "Terrible chemical smell", "text": "The jeans I ordered (flex wide leg) smell SO bad. I’ve washed them 4 times and even soaked them overnight but the chemical smell just won’t go away. I don’t even want to wear them because of the smell. They are a light wash, so I don’t believe it’s the dye. ", "rating": 2}, {"title": "Fit is wrong and zipper is bad…", "text": "Fit is wrong and zipper is bad quality/broken.", "rating": 2}, {"title": "Took longer to ship than was promised", "text": "Took longer to ship than was promised, and when it arrived, the pants are much tighter than they seemed from the advertisement. Ordered my usual size but they are too small. Too much of a hassle to send back.", "rating": 2}, {"title": "Material feels so cheap ", "text": "All 3 items I purchased feel so cheap and I’m not able to return them so I donated them. Won’t make that mistake again ", "rating": 2}, {"title": "I don’t like the material is way too…", "text": "I don’t like the material is way too big . ", "rating": 2}, {"title": "The jumpsuit is ill fitting and the…", "text": "The jumpsuit is ill fitting and the return process is finicky.", "rating": 2}, {"title": "Not a great product ", "text": "The delivery time was lenghty and the quality of the material is horrible. I probable wound even wear the dress. ", "rating": 2}, {"title": "Was super excited to receive these.", "text": "Was super excited to receive these.. The cut was decent but the corduroy feels very cheap :( ", "rating": 2}, {"title": "No packing slip or invoice comes in the…", "text": "No packing slip or invoice comes in the package so when I try to send something back that doesn’t fit. I can’t find the order number because there’s nothing in the package. I was so excited to gst my order in Friday but nothing fits.  Everyone should go a size up because they run small in the waist, but the length is correct but not for me because I’m 5 foot tall.  I need to return my four items.  ", "rating": 2}, {"title": "The leggings arent great", "text": "Date of experience: October 04, 2024", "rating": 2}, {"title": "You say things you don't respect", "text": "You say things you don't respect. You throw us from one person to another, without respecting the agreement accepted by the previous person. Finally I let go! I placed one last order so as not to completely lose the money paid for my returned order. In the end, I am waiting for my order to be received and I will close my account and no longer buy from you, and believe that neither will my friends. I hate disrespect, especially from a company like yours. You are by no means the only place I can spend my money. A reputation is much harder to gain than to lose. ", "rating": 2}, {"title": "The return process is very frustrating", "text": "The return process is very frustrating. I’m order to return an item, you have to send photos of it and explain why you are returning it.Then, you have to wait for approval for the return.  You are responsible for the cost of returning everything.  Any other online shopping app has a seamless return policy.  That is not the case for Halara ", "rating": 2}, {"title": "All 3 pairs of leggings are see through…", "text": "All 3 pairs of leggings are see through and I didn’t find out until I was in public.  Super disappointed. My white shirt I was able to wear for maybe an hour, until I noticed it had a hole right in the seam", "rating": 2}, {"title": "High waisted casual pants", "text": "I ordered 2 pairs of the high waisted button multiple pocket casual pants. The waist was very uncomfortable and tight even though I’m a size 4/6 and always a size small. Also, the petite length was still way too long ! I want to return them, but the return process is sooo annoying ! Shipping cost to return is ridiculous ! So I’m keeping them even though I’m not happy with them. Your products are made for tall skinny models. Maybe I can sell them to someone…..hopefully ! You win Halara, but I’ll never buy anything from you again ! ", "rating": 2}, {"title": "The jeans I ordered do not fit well at…", "text": "The jeans I ordered do not fit well at all.", "rating": 2}, {"title": "The pants smelled really bad", "text": "The pants smelled really bad. One smelled so bad I had a headache within a minute of taking it out of the bag. Some the low and high waisted pants are basically the same waist height so it’s impossible to tell how they will fit based on descriptions and the pictures don’t help either l. I will not purchase again ", "rating": 2}, {"title": "ordered petite size but not really the…", "text": "ordered petite size but not really the size too long ", "rating": 2}, {"title": "Big Disappointment ", "text": "For the hype, they are a big disappointment. Shipping took two weeks. Shocking considering I got notice of shipment and tracking within 24hrs. Material is medium thickness but feels cheap. My biggest issue is the material. ", "rating": 2}, {"title": "The fit wasn’t for me", "text": "The fit wasn’t for me. It fit in the waist but too loose in the hips and butt area. Not flattering on me at all", "rating": 2}, {"title": "To pay for expedited shipping to find…", "text": "To pay for expedited shipping to find it is only expedited ship date versus delivery date was very disappointing. Took way too long to arrive ", "rating": 2}, {"title": "The pants I received were not as shown…", "text": "The pants I received were not as shown in your ad. In the ad it shows jeans with stitching to indicate where a fly would be.  This is not the case on my pair. Just a single seam in the front to tell the world I’m wearing faux jeans. I am not happy!", "rating": 2}, {"title": "Thin", "text": "While these joggers are soft and comfortable, they are extremely thin. Not quite the quality I was expecting for the price. ", "rating": 2}, {"title": "I bought a dress from Amazaon that was…", "text": "I bought a dress from Amazaon that was of better quality than the one I received. It had adjustable straps and just overall better made. This was my first order from Halara.", "rating": 2}, {"title": "They are thin and somewhat see-through", "text": "They are thin and somewhat see-through. The fabric is stiff and not comfortable.  Maybe after their washed, but I likely won't ever wear these", "rating": 2}, {"title": "The pants I ordered looked nothing like…", "text": "The pants I ordered looked nothing like the picture", "rating": 2}, {"title": "First time buyer disappointment.  ", "text": "Wait time for products was longer than expected. When items arrived I was disappointed by quality. Dress pants are very thin material and too short for heels. Dress was more stretchy work out material than a nice cotton fabric. All in all was not impressed and likely won't buy again from Halara. ", "rating": 2}, {"title": "The size is too big", "text": "Date of experience: September 20, 2024", "rating": 2}, {"title": "Very frustrated …", "text": "I corrected my house number in my account, however when I put my order in I realized I had forgotten to save the change. So I literally emailed you 2 minutes after the order went in JY249X10U027006313A few days later I was told it was too late 😔  so I have tried to contact Uni Uni to no avail.. will I even get my order i have paid for!? 🫤 It is supposed to be 1585 Stikine St Kamloops BC V2E2T2 Frustrated customer,Patti", "rating": 2}, {"title": "Too small", "text": "Too small. Not Jean material ", "rating": 2}, {"title": "Buttons fall off!!!!! ", "text": "I have bought and paid for 5 pairs of your pants. 2 pairs I have had to resow my buttons on 2x. So changed the buttons on the Waist pockets missing 1 on a pair. The new ones I wore a pair today and they ripped under the zipper and the button is almost about to come off. I absolutely love the material but so upset for the price. ", "rating": 2}, {"title": "The waist super tight but only around…", "text": "The waist super tight but only around very top of waist ", "rating": 2}, {"title": "Shipping was too long", "text": "Date of experience: October 03, 2024", "rating": 2}, {"title": "Did not look like picture ", "text": "Felt like shipping took long at 2 weeks. Also the pants I bought( 3 different pairs)  are huge at the bottom, like big bell bottoms which are not my style, not reflective of the picture. ", "rating": 2}, {"title": "The legging look cute but the don’t…", "text": "The legging look cute but the don’t stay up. As a bigger girl they keep rolling down my stomach.", "rating": 2}, {"title": "My order as I’m 58 I ordered regular…", "text": "My order as I’m 58 I ordered regular and all three pairs of pants are above my ankle. There’s no instructions on returning or exchanging if somebody could reach out to me that would be wonderful.", "rating": 2}, {"title": "I’m sad to say they don’t fit", "text": "I’m sad to say they don’t fit. The ads make it seem like the size is roomy so I opted for a size that was quite big enough. I’m sure I will reorder to try to get a better fit. Very nice fabric just the way it looks online. ", "rating": 2}, {"title": "I don’t like the quality", "text": "I don’t like the quality ", "rating": 2}, {"title": "Got smaller than expected.", "text": "Got smaller than expected. ", "rating": 2}, {"title": "the refund process is off putting", "text": "the refund process is just strange!!!Having to take photos of what your returning?I wouldn't order again based on this. ", "rating": 2}, {"title": "Did not look good at all.", "text": "Did not look good at all. ", "rating": 2}, {"title": "I don’t like my item", "text": "I don’t like my item, why is it taking so long to get a return approved? It’s brand new.. I tried it on and didn’t like it. Other companies aren’t this hard to return items ", "rating": 2}, {"title": "Very poor quality", "text": "Very poor quality ", "rating": 2}, {"title": "The clothing is nice", "text": "The clothing is nice. I really like them. The delivery was unbelievably long.", "rating": 2}, {"title": "Too long even ordering petite", "text": "I ordered petite length but they are at least 4 inches too long.", "rating": 2}, {"title": "So sorry to say the was not good", "text": "So sorry to say the was not good. Can you please send me a return label? I hope to shop more with you on the future. Thank you so much! ", "rating": 2}, {"title": "I'm trying to complete return and it…", "text": "I'm trying to complete return and it asking me to add pictures. Well I have to take pictures with my phone and then upload to computer then up load to website. why ? not sure. So because of that I will not be shopping again ", "rating": 2}, {"title": "Took over a month to receive product", "text": "Took over a month to receive product. I’m pretty sure I didn’t order wide leg pants.", "rating": 2}, {"title": "Disappointed", "text": "Fabric is thin and stains very easily showing oil and other stains that don’t come out easily. Waist is tighter than the rest of the pants. ", "rating": 2}, {"title": "Expedited Shipping! Not worth it! ", "text": "Items arrived and did love them. The only bad thing about this order was I paid for expedited shipping, however, my items did not arrive any faster. ", "rating": 2}, {"title": "Return process is a pain", "text": "Return process is a pain ", "rating": 2}, {"title": "Bad customer service", "text": "AI ordered trousers which were too big for me. I asked If I can return them. I ordered smaller trousers and asked If You can make me just one bill, If I return The bigger ones.Instead being fair you offered me a gift card for the next shopping.I won't shop anything from you again.", "rating": 2}, {"title": "Can find how to return my order.", "text": "Can find how to return my order. ", "rating": 2}, {"title": "Disappointed ", "text": "I’ve seen the Halara ads pop up on my feed for months. I finally ordered them, but was disappointed in the quality and sizing. I ordered my usual size, but the joggers were too small. The high waisted pants were not as chic as what they looked to be on the ads in the videos. The fabric was like a cheap linen & not high waisted like I thought it would be. I will be sending them both back. ", "rating": 2}, {"title": "Not worth the hype", "text": "Pants aren’t worth all the hype they make them out to be in the Instagram ads. I kept 1 of 4 pair. I’m a size 10 and I ordered the medium based on the website description and all the pants either felt too tight or looked too tight. Not nearly as flattering in real life. ", "rating": 2}, {"title": "Good product but I don't think it…", "text": "Good product but I don't think it should cost the customer to anything to send an item back.", "rating": 2}, {"title": "Didn't receive all merchandise ordered.", "text": "Bought 2 pair of pants for a special price got only one pair. No communication why the other pair have not been shipped.", "rating": 2}, {"title": "Unfortunately there was some damage to…", "text": "Unfortunately there was some damage to the fabric one a few pieces. I’m trying to exchange or return ", "rating": 2}, {"title": "I bought \tRibbed Tube Backless Plicated…", "text": "I bought \tRibbed Tube Backless Plicated Side Pocket Casual Jumpsuit *1Poorly made, the top was cut and sewed asymmetrically so one breast was partially hanging out the bottom. The waist was too large (but if I ordered a smaller one, my boobs would not have fit the top) and the waist cut was very unflattering. Material is nice and light and soft though. Will keep it and wear it as PJ’s but was hoping for a better product that I could wear out in public. Definitely cannot. If it fit like it’s suppose to (and similar to the picture) I would order more. Disappointing ", "rating": 2}, {"title": "To much delay after returns -,took…", "text": "To much delay after returns -,took about 3 m look nths", "rating": 2}, {"title": "Disappointed this time", "text": "I felt like both pair of pants I ordered most recently were unflattering. My attempts to reach customer service for advice on exactly how to wear one item were unsuccessful. Finally, being required to provide photos of the items in order to start a return was simply annoying. ", "rating": 2}, {"title": "Oversized and not what I expected", "text": "Date of experience: September 29, 2024", "rating": 2}, {"title": "Shipping +  Material Stretch", "text": "I wasn't aware of how long it would take for my items to ship until I placed my order, overall pants not as stretchy as advertised ", "rating": 2}, {"title": "Not for me. ", "text": "I have ordered twice from Halara and their items are definitely not for me. I was attracted to them because they seemed comfortable and stretchy and that is a big plus for me. However, I have not liked a single item. I have an athletic body shape, and their clothing is not flattering for me. Most clothing items are always for the \"perfect\" body shape, which is not me. I will not be ordering from them again. ", "rating": 2}, {"title": "Shipping took almost a month to receive…", "text": "Shipping took almost a month to receive my packages.  👎🏽", "rating": 2}, {"title": "Sent me the wrong frickin color", "text": "Sent me the wrong frickin color ", "rating": 2}, {"title": "It took a month for my order to arrive", "text": "It took a month for my order to arrive ", "rating": 2}, {"title": "I ordered 3 pair pair of the high…", "text": "I ordered 3 pair pair of the high waisted pants and received 3 but two pair were the same color and wrong size   I ordered L petite and received 1 lg petite but the other 2 were L tall.  Im 5'    That does not work for me.", "rating": 2}, {"title": "Disappointed customer ", "text": "Email saying order delivered no order contact and get told to chase up myself with Royal Mail ", "rating": 2}, {"title": "Order took too long to recieve", "text": "The order took too long to arrive it said it would take 8-10 day and it took  a little over 2 weeks. I could not wear what I ordered for an event I was going to sadly. ", "rating": 2}, {"title": "I loved the feel of the pants I bought…", "text": "I loved the feel of the pants I bought but they said they were straight legs and they were not. Other than that the experience was fine. ", "rating": 2}, {"title": "Wrinkles — These were advertising as anti wrinkle…", "text": "These were advertising as anti wrinkle but they not super wrinkly. Material doesn’t feel luxurious. Thought they would be better. ", "rating": 2}, {"title": "Honor your advertised prices and don’t challenge me on my reasons for a return. I want a refund!", "text": "The green pants button is barely sewn onYour advertising for buy one get one free denim leggings is not being honored despite me asking you to honor this price.I am being “challenged” for the reason for my return. Just send me a return label and process my refund! Simple! ", "rating": 2}, {"title": "The pants don’t fit as good as I see it…", "text": "The pants don’t fit as good as I see it in the pictures. It doesn’t look good. ", "rating": 2}, {"title": "mid rise button stretchy…", "text": "I bought the mid rise button stretchy zipper skinny jeans. They are stretchy, but maybe too stretchy. They stretch out throughout the day so I’m constantly pulling them up or the crotch looks funky. ", "rating": 2}, {"title": "The fabric was fine and the color was…", "text": "The fabric was fine and the color was beautiful. However, the fit was definitely not true to size and it was very long. I’m hoping to send it back and see if I can get another thing that is not as long as thick as this is. I’m 5‘3“ so maybe that’s what the issue is maybe it’s made for people who are above 5’3”.", "rating": 2}, {"title": "Disappointed ", "text": "First, I like the feel and look of the joggers that I ordered. However, they run small ( compared to other brands) and I wanted to exchange for a different size. Theybwrre gifts. The only option is to return. The return will cost me more money. The process is difficult so I will not order from them again! ", "rating": 2}, {"title": "Delivery took longer than expected", "text": "Delivery took longer than expected ", "rating": 2}, {"title": "Would Not Buy Again", "text": "The pants i bought were see-through and when you sat down in them, they bunched up to make it look like you had a huge bulge. I returned them. In order to return items, you have to pay for shipping. So I paid $8 to ship back 2 pairs of pants that were very ill fitting. ", "rating": 2}, {"title": "Shipping times way too long and returns are complicated. However I love most of the clothes I've received. ", "text": "Shipping times way too long and returns are complic", "rating": 2}, {"title": "The leggings just wasn't a high quality…", "text": "The leggings just wasn't a high quality fabric and shape of them was wrong and not fitting for the price. ", "rating": 2}, {"title": "The fit was not as expected", "text": "The fit was not as expected. They are just leggings with pockets. If I got a size bigger, they would be falling down. Very disappointing. ", "rating": 2}, {"title": "I ordered 4 pair of leggings and when I…", "text": "I ordered 4 pair of leggings and when I received 1 pair it had holes in the seams before even trying on and then another pair I wore for about 2 hours and the seam ripped. ", "rating": 2}, {"title": "Zipper Broke on 3rd wear", "text": "On the third wear of a pair of new jeans, the zipper came off its track and wouldn’t go back on. Pants were comfortable and I was excited to wear them, but the faulty zipper affected that.", "rating": 2}, {"title": "The pictures on the website don’t quite…", "text": "The pictures on the website don’t quite look like they do in reality. ", "rating": 2}, {"title": "Tracking info was off", "text": "Tracking info was off. Customer serviece coukdnt change an order 10 min after was done.The material is not good and the leggings overall look cheap.", "rating": 2}, {"title": "Not a big fan of the pants I ordered", "text": "Not a big fan of the pants I ordered ", "rating": 2}, {"title": "Return process is a hassle", "text": "I didn't care for how the pair I ordered fit...and the return process is a big hassle.  I would like to try a different pair but I don't want to have to go through this again if I don't like them either.", "rating": 2}, {"title": "Clothes come from China", "text": "Clothes come from China. It was not clear on the website that this is a Chinese company, and the clothes are shipped from China. I thought that I would be able to return something that didn't fit. I ordered four things, and I would like to return two of them, but they were sale items, so no returns. They were fairly expensive, even on sale. To return items, you have to pay for return shipping. There's nothing that tells you how much that might be. My guess is ALOT! I would have thought twice before ordering if I had known that the items were coming from China.", "rating": 2}, {"title": "I wanted to move them but they keep…", "text": "I wanted to move them but they keep rolling down at the waist. ", "rating": 2}, {"title": "Low quality", "text": "I would say Halara is legit, but you need to understand how much are you willing to pay for low quality fabric. I got my order, \"High Waisted Button Zipper Multiple Pockets Solid Skinny Cargo Pants\" size S, on time, with no issues. I paid over £45, delivery included. Opened the package, fabric soft and stretchy. I tried them on, very comfortable, light, easy to squat, I thought theses are so far the best quality trousers that I have ordered through online. Day 1 - Worked in retail for 8 hours with these trousers. I was wearing long t-shirt with these trousers. Got home, changed my t-shirt and when I looked down I had a hole under the front zip. I was angry, because I spent that money and on day one already a hole. Okay, I thought I can fix and when I started sewing I noticed that part was very poor stitch from manufacture company or whoever were sawing these trousers together. All fixed now, so I was fine with it. Day 2 - Another 8 hour shift. Trousers still feel amazing, light and perfect material, all the dirt and dust that I usually get in retail comes off easily. Went to toilet and front main button pops off. And I was like ... what else now? Luckily I had long t-shirt that was hiding everything. Got home and fixed the button.On next day button popped off, because of my poor stitch. Im still wearing these trousers, but they are not worth that high price. Thats why I give two stars instead of one, because company is good, just the price is way too high for that specific product.   ", "rating": 2}, {"title": "really small for size stated", "text": "Date of experience: September 06, 2024", "rating": 2}, {"title": "One out two items were the correct…", "text": "One out two items were the correct items ordered", "rating": 2}, {"title": "The quality of the clothing is terrible.", "text": "The quality of the clothing is terrible. ", "rating": 2}, {"title": "Disappointed with the quality of the…", "text": "Disappointed with the quality of the material used for the dress.", "rating": 2}, {"title": "Sizing is inconsistent", "text": "Sizing is inconsistent. Got two pieces of pants both XL but one was so big I could put melons and the other was so tight", "rating": 2}, {"title": "It doesn’t fit the dress that I bought", "text": "It doesn’t fit the dress that I bought. I contacted you through your site about returning it. It was within the 30 days. I have not heard from you at all about the return therefore I will never purchase another garment from your company.", "rating": 2}]