[{"title": "first you tell me I still need to pay…", "text": "first you tell me I still need to pay after I paid you. then you want to interject pay pal AFTER  I paid with a credit card.  Nothing about when you will ship or a tracking number etc.   Feels like a bad deal right now...", "rating": 2}, {"title": "Do not like new layout format.", "text": "Do not like new layout format! More unnecessary clicks to view items or even getting to specific products in a category.  Also don’t like at all(!) that I can’t view what sold that day in new items. Part of the interactive fun and learning experience. These changes from a customer perspective are of no benefit, just the opposite. Plus…don’t need confirmation that I have “Great taste” “nice find” etc. that’s only automated foolishness and comes off rather insulting actually. But I love Ruby Lane!! However recent changes haven’t improved anything. Feels like bored computer programmers changing things only the sake of changing.", "rating": 2}, {"title": "The furniture was not packed or…", "text": "The furniture was not packed or protected properly (only a thin layer of foam was used) and a couple of large pieces were broken off of the doors during shipping. It is costing me another $150 to have it repaired to make it usable! There was also other damage on the top corner of the furniture that was not made apparent when offered for sale.", "rating": 2}, {"title": "I had a very difficult time signing…", "text": "I had a very difficult time signing into the site.  I think it was probably my lack of knowledge rather than a problem with the site itself.  I couldn't find where I could reset my password.  I finally did and was able to make a purchase which went very smoothly.", "rating": 2}, {"title": "Check for actual availability before you purchase!", "text": "I found exactly the item I wanted, purchased it, and received email confirmation of the purchase.  Only after contacting the seller to ask about tracking, I was told the item was actually not available.   I found a similar item and contacted the seller to ask a question about it.  I was told the item was actually not available.  Twice in two days.  Two different sellers.  Two different items.   I understand things like this can happen.  However, I am definitely not impressed with the apparent lack of accurate inventory.", "rating": 2}, {"title": "Your check out procedure doesn't allow…", "text": "Your check out procedure doesn't allow delivery options for shipping or an approximate date of delivery. I was not able to check out my cart without checking out each item separately. Your payment and shipping system should be more user friendly to get accurate shipping delivery prior to making orders. I had to order in hopes that shipping will be prompt. If not, these will be my last purchases.", "rating": 2}, {"title": "Got charged for a canceled order", "text": "My order was processed and my account charged promptly. After reviewing my order I noticed that it had been canceled by merchant. I reached out to them directly by Email cause there was no number attached.  I informed my bank to put a stop payment on this charge. After days of waiting days with no response from merchant, I reached out once again and finally got a reply that my credit was being acknowledged by merchant. I find this experience has not made me very trusting of your site and its suppliers.", "rating": 2}, {"title": "Who ever read my offer and sent it to…", "text": "Who ever read my offer and sent it to the shop owner, wasn't doing their job. They didn't bother to read my entire offer and now are wasting my time and the shop owners as a result.", "rating": 2}, {"title": "Good Collection of dealers and…", "text": "Good Collection of dealers and antiques, and I've used you for years, but the PayPal transactional process doesn't work, and resulted in a lot of telephone time with dealers, yada yada yada. Website makes the sale, dealer puts it on hold, but no $$$. transactions had to be consummated by check.", "rating": 2}, {"title": "Order finalized BEFORE final price displayed", "text": "Ruby Lane will finalize and place the order before the payments page. The final item price with shipping costs and exchange rates is not displayed until AFTER the order is finalized. This should be changed!", "rating": 2}, {"title": "The sign-up payment method is confusing…", "text": "The sign-up payment method is  confusing. I wanted to use my credit card for payment and filled out all the information but it still went through on Pay Pal which fortunately I also have but for a different business purpose. This has nothing to do with the individual vendor who Im sure is fine.", "rating": 2}, {"title": "I have been trying to purchase an item…", "text": "I have been trying to purchase an item via RubyLane.1. I found communicating with the actual shop owner difficult.2. When postal address finally sorted the invoice was in USD not AUD as I was expecting 3. Shop owner and I did lots resolving the details required to post to Australia but at the end no sale.I’m sorry for shop owner ….. sorry I could not buy the item.Thanks", "rating": 2}, {"title": "Very frustrating", "text": "Very frustrating.  I made an offer that was too low and rubylane would not let me make another offer.  I communicated with the seller and negotiated a price, but I still couldn't complete the transaction.  I had to open a new rubylane account in order to make the offer.  ebay lets users make additional offers if the initial offer is not accepted.  Why doesn't rubylane?", "rating": 2}, {"title": "One item in my cart has disappeared and…", "text": "One item in my cart has disappeared and not marked purchased although it does say sale pending on the item listing. Very, very confusing check out if you are doing multiple sales and if I had known I would not have added several things to my cart.", "rating": 2}, {"title": "No response from seller after purchase", "text": "I have yet to get an acknowledgment from the seller about this purchase.  And the item purchased is still showing as “sale pending” on your website, although my American Express account has been billed (via PayPal).  I have written two messages to the seller but no response.  Perhaps it is because of the holiday.", "rating": 2}, {"title": "Checkout was a problem", "text": "On the payment checkout page, I accidentally checked PayPal (which I dislike so I had recently asked them  process my exit from them.). The checkout page would not let me uncheck the PayPal option. Then it asked for my credit card so I entered all that info. I have no confidence that know what actually. happened.i got tow receipts. one form Rubly Lane and one from Annies Avenue that Ruby linked me to to buy the item.", "rating": 2}, {"title": "The seller took my order and then…", "text": "The seller took my order and then cancelled it w/o any information whatsoever!!  Now I have to search for another vintage gift for this person on my Xmas list.", "rating": 2}, {"title": "Received broken item and seller has all but vanished", "text": "using Rubylane to fulfill a purchase \"wish\" ... which I recently did, hit or miss.   I have purchased wonderful items which arrived in a timely manner, etc..  HOWEVER, if you have issues with anything to do with a purchase as a buyer, you will quickly learn that Ruby Lane is a distant \"entity\" .... it's out there ... you can purchase...and usually, you'll get your item ... but if there is any issue, just TRY reaching out to RubyLane for help ...    It's a terrible platform ...you can't even easily see seller's feedback!  I believe you have to search them on TrustPilot!!!  I plan to mostly stay away from RubyLane purchases.  I received a broken item, and now seller is not communicating ...  I'm left powerless.", "rating": 2}, {"title": "Disappointed to have Purchase Cancelled", "text": "I was thrilled to purchase a rare antique only to have my purchase refunded with no explanation.  Did somebody else pay for it at the exact same time?  If so, that should not be technically possible.  I am extremely disappointed. Reached out to the seller and may or may not hear what happened.  This type of thing should be fixed on the website.  Thank you.", "rating": 2}, {"title": "I sent two different questions to the…", "text": "I sent two different questions to the dealer. RL held the record of these for a few hours . NOT long enough for the dealer to receive them. I made an offer, of which the  dealer never received either. We ended up doing it via email. I logged onto RL this am, and again, found no way to get my offer through, so ended up paying full amount. Also had to change my password twice, since RL had no record of it.", "rating": 2}, {"title": "None of the pictures were available for…", "text": "None of the pictures were available for the product I was interested in. I reached out by email and never received a response. I checked today and could load all the photos and purchased the product", "rating": 2}, {"title": "Very difficult to change my password", "text": "Very difficult to change my password.  The \"button\" would never work - that I could tell.  I finally sent an email and I was told to repond and they would send me at temp passcode to use.  Kept waiting and thought they would send a reply text with code - They did not.  I finally tried the \"reset\" process AGAIN and guess they had entered the code and failed to tell me.  Finally reset my password.  Also difficult to figure out where to change address and billing info.  Ruby lane is simple not an easy site to do much in.  I seldom shop here because of that.  Their sellers are good - side just not really user friendly.", "rating": 2}, {"title": "Went to sign in and says my password is…", "text": "Went to sign in and says my password is incorrect. I have not used it for about a year. So how did it become incorrect? Had to try four or five times to get a new password that the site would take.  Very frustrating.", "rating": 2}, {"title": "Pretty awful- redesign your web…", "text": "Pretty awful- redesign your web purchases process. And your shipping costs are outrageous...", "rating": 2}, {"title": "Your website needs work", "text": "Your website needs work. In my opinion, the website is awkward in design and the content, intended to help execute making an offer and defining method of payment, is often confusing.", "rating": 2}, {"title": "Hard to get pw recognised", "text": "Tired of you not recognising my password & jumping through many hoops to get it straightened out EVERY TIME !!!!!Anne", "rating": 2}, {"title": "I don’t live in Australia", "text": "I have not been able to complete the purchase. Ruby Lane insists I live in Australia, not Long Beach CA.", "rating": 2}, {"title": "It was fine up until payment and then…", "text": "It was fine up until payment and then it said this item is no longer in your cart.     Needed to tell me that BEFORE", "rating": 2}, {"title": "I am not tech savvy and lost a great…", "text": "I am not tech savvy and lost a great bargain because I did not know how to contact seller.", "rating": 2}, {"title": "The platform for making an offer is not…", "text": "The platform for making an offer is not user friendly", "rating": 2}, {"title": "it seems like I paid through PayPal…", "text": "it seems like I paid through PayPal which I don't want to use it. I just pay by a card.", "rating": 2}, {"title": "paypal not working for payment", "text": "Date of experience: September 19, 2023", "rating": 2}, {"title": "My designer had emailed the vendor…", "text": "My designer had emailed the vendor asking for a reduced price for my items and I had already paid for the items, I should have waited to hear back from my designer.  I emailed the vendor within minutes requesting a small refund and she never responded to my email one way or the other.  Immediately shipped the items,  a note on the invoice, some acknowledgement would have been appreciated.  I usually shop on 1st Dibs or EBay, I find the experience more personal.", "rating": 2}, {"title": "You use to have an \"antique\" category…", "text": "You use to have an \"antique\" category and now you have look through too much new stuff to find the antiques. Also your ad in the Maine Antiques Digest is a joke. That paper is for serious collectors- you need someone that knows what an antique is to put together a decent ad- you have many wonderful REAL antiques that shoud be represented, not collector junk.", "rating": 2}, {"title": "Unhappy With Checkout Tedious Process", "text": "I wanted 3 items today. Each one was from a different shop.  I found it very tiresome that I had to enter my mailing address and personal information from start to finish for each item.  When I shop on Etsy I can either purchase from one shop for items I have selected or I can purchase all of the items that I have selected from two shops or more.  I don't believe I will be doing very much shopping on Ruby Lane in the future.", "rating": 2}, {"title": "Worst check out system ever", "text": "Worst check out system ever - too many pages involved and complicated.  Person who created must have been paid based on that.  Wanted to use debit card with high balance and no go - kept pushing Palpal at me and I finally had to go with that. Horrible experience.", "rating": 2}, {"title": "HELP!  I need to complete my purchasr", "text": "I have been trying to purchase a mirror. I was told someone would call me to get my credit card information to complete the transaction.  Then I get an email from the sellers saying that once they have confirmation of payment they will pack and ship it. However I can’t find out how to pay!!", "rating": 2}, {"title": "Price too high but I needed item to…", "text": "Price too high but I needed item to complete set", "rating": 2}, {"title": "Good products, dreadful software/user interface", "text": "While your products/merchandise is very good, your purchasing software is abysmal.   I am caught in some sort of software trap trying to make a purchase of a Hermes scarf.  There is something amiss with your statuses and the way that offers/counteroffers work!  It is so off-putting that I may not purchase from your website again IF I can get this one final transaction made.  Before I retired, I was a software user interface designer/programmer so I understand how it SHOULD work.", "rating": 2}, {"title": "Canceled Order #5850483", "text": "Made an offer, and offer was accepted.  I then immediately paid the full amount via PayPal and assumed the transaction was complete.  Shortly thereafter I received a refund and was told the transaction was cancelled.  I reached out to the seller and have received no word as to why.  I understand that transactions are cancelled for various reasons, and I did receive a full refund.  However, leaving a buyer in the dark as to the reason for the cancellation is unacceptable.", "rating": 2}, {"title": "Very confusing!!", "text": "Very confusing!!! I like to see something I like, put it in my cart and pay for it in MY CURRENCY, not a foreign one where I have no idea of the exchange rate! I am waiting to find out my real price (Australian dollars and hope it is affordable) What if I find the price and shipping is not worth it to me?Weird way of selling something, will avoid in future, I don't think this will end well.", "rating": 2}, {"title": "This was my first purchase using Ruby…", "text": "This was my first purchase using Ruby Lane and I am not a fan. I am also a reseller and have considered using the site to sell but after this experience I will pass. When you purchase from Ebay, Etsy or Facebook Marketplace, you can still go back and look at the details in the listing. But with RL you cannot. It all disappears. For instance, I forgot the dimensions of my purchase and wanted to go back to review and I can't even see that information anymore. It's nonsense. And what a pity you can't use this information for sold comps whatsoever. Not a fan of Ruby Lane for these reasons.", "rating": 2}, {"title": "HELP...................................................HELP.............!!You have a lot of beautiful jewelry on…", "text": "You have a lot of beautiful jewelry on your site, but your offer process needs work. I have tried reaching out to the seller to let him know that I was trying to send an offer and something went wrong and it said I had just made a purchase. I got online and have seen other people say that your site to make an offer on is complicated and not good. Please help me cancel my order that I accidentally made. I also informed PayPal of this mistake. And will be reaching out to my bank as well. Thank you for any help or assistance to cancel this order.", "rating": 2}, {"title": "My selection and purchase went  through…", "text": "My selection and purchase went  through quickly and fine.  I want to register my stores ID number for tax free purchases.  I spent a long time sending s detailed informative letter in appropriate box. This would not go through ad then timed out and disappeared.  Very unhappy- I did not go over my word quota. Betty A Smith Castle Gate AntiqesTyler , Texas", "rating": 2}, {"title": "This site is a real mixed bag", "text": "This site is a real mixed bag.  God forbid you want to order multiple items from a seller, the cart system is so screwed up it can't figure out the shipping, which quickly will exceed the cost of the items you are trying to buy.  Even though I asked multiple questions of the seller before checking out, it was an incredibly confusing process.  I'm going to have to really think twice before I make another purchase from Ruby Lane.", "rating": 2}, {"title": "i cannot check out to pay", "text": "OMG, really? I purchased this morning and want to pay$$ the seller, I got a message that it is sold, but cannot pay?  I have an active paypal account, nothing obvious that says: \"Pay here\", also tried to change to my debit card to complete the purchase, won't change to a debit. Very frustrating and a time waster for sure.  I left a message for help.", "rating": 2}, {"title": "Shopping is similar to etch but not as…", "text": "Shopping is similar to Etsy but not as intuitive. I’ve thought I bought something but I guess I have to wait till seller is contacting me with payment method. I don’t want to be contacted. I will only pay with credit card. If there are sellers who doesn’t except it that it should upfront. Process seems too complicated for small purchases. I won’t buy again.", "rating": 2}, {"title": "The website was hard to navigate", "text": "The website was hard to navigate. The sign up link was not obvious. when it came to paying, I did not want the shop to phone me as I just wanted an online payment method, but I could not complete the sale UNTIL I listed a phone#.The paypal link you said would allow me to input card info was not there so this whole evolution has been a pain and is still incomplete. If I did not really want the goblets, I would drop the whole thing. --- ghp", "rating": 2}, {"title": "Disappointing. Waiting for nothing.", "text": "Well, so far my experience in shopping the Red Tag Sale has been a bust.  Items for sale are already sold before the sale.  Not sure why.  Gives me false hope in buying the item I'm waiting for.  Also, there is no notification that the item has been sold in my wish list or basket.  It remains in my mail leading me to think that it's still pending sale.  Perhaps the item should be removed to \"SOLD,\" as soon as it's sold?  A lot of time wasted.", "rating": 2}, {"title": "I placed an order two days ago", "text": "I placed an order two days ago. Usually I hear from the seller right away. So far I have heard nothing and the funds have already been withdrawn from my account. I sent an email to the seller and still nothing. I would like to know what is going on.", "rating": 2}, {"title": "I donot remember or have record of…", "text": "I donot remember or have record of ordering from Ruby Lane before and had a hard time getting an order link getting past wanting a password.When I did pay and place my order I get a receipt from Pay Pal and Visa which I paid by (visa).  Your co. evidently is not open until 10/10, this took time and did not consider it at all easy to place my order.Dianne.  Having a hard time submitting my comments, sure not impressed with your site!", "rating": 2}, {"title": "Have they sent me a wrong item or is…", "text": "Have they sent me a wrong item or is just wrong advertising!Purchased 1.65 carats diamond studs  from Alexandra's Vintage Jewelry & Collectibles, which was advertised as \"white eye clean\" , H colour,SI1/SI2 clarity. When I made jewelry appraisal  it turn up to be I-K colour and P1 clarity.Very disappointing!", "rating": 2}, {"title": "I found something I wanted to buy", "text": "I found something I wanted to buy. I attempted to pay for it with PayPal. Fopr some reason, the shipping address was an old one of mine that I have not used for more ythan two years. PayPal has my correct address. When I tried to change the address, PayPal informed me that the seller on Ruby Lane was the only party that could allow me to modify my addrtess. Thst's a first ever for me on PayPal. You guys are doing something wrtong.", "rating": 2}, {"title": "The shopping experience was terrible", "text": "The shopping experience was terrible. I quickly found what I wanted but I was sent back and forth to add an address into My Account and it never held. Took me 5 or 6 times to get this My Account correct, then having a separate billing and mailing address for the sale added difficulties and delays. Very unpleasant, what should have been 5 minutes was 20 minutes.", "rating": 2}, {"title": "What's up with this?", "text": "I made two purchases this morning from the big \"Red Tag Sale\".This evening, I received two different emails, one from each seller reminding me to complete my purchase. I sent them screenshots from my PayPal account showing the payments have been made. I shouldn't be needing to do this, and I hope this can all be straightened out. I do not need the stress of a complicated check out process, or the possible need to pursue this, in order to receive my purchases.", "rating": 2}, {"title": "I tried several times to add my address…", "text": "I tried several times to add my address and kept getting a spinning red circle with no valid reason. Kept trying and trying. After about a dozen attempts it worked. Very discouraging. Great way to loose potential business.", "rating": 2}, {"title": "Dealer was great but \"make an offer\" is terrible", "text": "Dealer was great.  No complaints there.  Problem is your \"make an offer\" system.  Very difficult to use.  Made an offer, immediately got response seller had made a counter offer.  He had not and said he was not notified of my offer.  Fortunately the seller was very patient and after a number of e-mails I was able to buy the items at my offered price.  I have used the \"make an offer\" option on e-bay and it is VERY easy and straight forward.  I would be reluctant to make an offer again on Ruby Lane.", "rating": 2}, {"title": "3 day inspection period for something you won't have received in that time", "text": "I've satisfactorily used Ruby Lane before, but I found it very confusing on this occasion.  After approving a purchase via PayPal, the transaction showed as completed on the payment site but still pending on Ruby Lane.  Ruby Lane personnel explained that this was due to a three day inspection period, in case of returns.  But I won't have received the item within the inspection time, so I don't see the point.", "rating": 2}, {"title": "I have had zero luck in logging into…", "text": "I have had zero luck in logging into Ruby Lane ... after I selected 2 items I wished to purchase, the site wouldn't accept my password, and when I tried to click on \"renew password\" the page would not respond. I tried using the temporary password RL site would't allow me to enter the information for my platinum AMEX card. I think I just may give up.I spent too much time on this today.", "rating": 2}, {"title": "EXPLAING MOPI RATED YOU POOR BECAUSE I DO NOT…", "text": "I RATED YOU POOR BECAUSE I DO NOT UNDERSTAND YOUR METHOD OF PAYMENT............I WANT TO PAY YOU FOR THE COAT....I WANT TO ORDER MORE ITEMS FOR MY DOLLS, PLEASE EXPLAIN HOW I CAN PAY FOR MY MERCHANDISE......I LOVE YOUR ITEMS, YOU SURE HAVE A LOT OF INTERESTING THINGS.....I'M SORRY FOR THE POOR RATING.....PLEASE HELP ME----THANKS BARBARA.", "rating": 2}, {"title": "The item purchased has undisclosed damage", "text": "The item purchased has undisclosed pre-existing damage, seller would only say they did not notice it. Told seller to review their other  pictures and they would see damage.  Seller offered to take it back if in the condition they thought it was in, which cannot be done since it had damage before they shipped it. We will eat the loss.  ebay sellers we have bought from for almost 2 decades are more honest.", "rating": 2}, {"title": "to be completely honest", "text": "to be completely honest, i did not enjoy my transaction in any way. the item was not in good condition, missing three stones that was not stated, and had 5 to 6 visible dents, also not mentioned. gave full refund, but that was slightly delayed. overall, i bought and item i was super excited about, and was very disappointed.", "rating": 2}, {"title": "Very disappointed that the ring I…", "text": "Very disappointed that the ring I wanted and received an email bill of sale for had already been sold. I was notified by the seller that they had not “had a chance to remove it from the website yet”. Of course they then directed me to shop directly at their site. So not sure if this site is used by some sellers to bait buyers into something that is not available in order to get them to buy something else. Very frustrating:(", "rating": 2}, {"title": "Difficult to use", "text": "Font is small and thin, especially hard to read centimeter's dots. Payment page confusing with two \"pay for  your order\"Attempt to reach \"The many faces of Japan\" on you search function didn't work. I had to navigate to the site via Google. Two-step process where merchant contacts me is burdensome.", "rating": 2}, {"title": "After hundreds or probably thousands of…", "text": "After hundreds or probably thousands of successful purchases we have tried to get one of your sellers to open a damage claim for an item we received with no success. We have sent the seller over a dozen photos of the damage and their labeled box. They do not respond. It seems that there is no way to hold a seller responsible on Ruby Lane.", "rating": 2}, {"title": "Difficult to shop here", "text": "I was excited to find the company, spent a lot of time choosing Christmas and work gifts. The items were split up into numerous companies; when I tried to pay by credit card I was directed to PayPal and it was refused...because my husband had set up his account using my credit card number. The vendor is away until January.Overall, a frustrating and unsatisfying experience.", "rating": 2}, {"title": "Disappointed", "text": "Purchased a green glass globe lamp.  Price was reasonable shipping too expensive but paid for it anyway.  Received the lamp a few days later.  Good turn around time. HOWEVER, the packaging was poor and the glass globe was broken beyond repair. I was charged for shipping insurance at check out and when I started my claim I saw that the merchant did not use the USPS as stated but Fed-X. I hope there won’t be a problem with the claim given my receipt says USPS shipping but came Fed-X. The merchant was My Vintage Wants LLC.", "rating": 2}, {"title": "The latest round of seller fees was too…", "text": "The latest round of seller fees was too much.  RL was greedy.  They are NOT an auction house so should not expect auction percentages on dolls. They ran off customers and they ran off sellers with quality items that sell at fair prices.  Sellers I know do not make much on each doll and could not participate in the 50% off sales and only the 30% off sales IF they raised prices before.  So now with the additional 8% or so fees and shop listing/monthly fees it is out of reach for many sellers.", "rating": 2}, {"title": "UPDATE your site’s technology", "text": "Great items for sale but the site needs to update to today’s technology. I want an app for Ruby Lane  and I HATE the two step process required for payment. Over and over I ”think” I’ve paid and I realize I have not. Or I try to pay and for some reason it doesn’t process. It’s not easy and not fun. Take it from a FREQUENT buyer.", "rating": 2}, {"title": "Ruby Lane's Technology Shouldn't be as Dated as the Items it Sells", "text": "Responsiveness and adequacy/availability of real time help seriously lacking.  I had items I wanted to remove from my cart to make a final purchase and the directions they posted, \"click on the trash can icon above the photo\", what trash can?  What's also lacking is the heart icon supposedly above the photo if you want to move the item to your wish list.  I've logged into and out of my account several times and there is no icon, no help.", "rating": 2}, {"title": "I made an offer n the item I wanted", "text": "I made an offer n the item I wanted.  The instructions said I would hear back on it promptly.  When I heard nothing in 24 hrs I contacted the vender directly.  They said They never received my offer.I worked with them directly and had a wonderful experience in buying my item.  Either your system on directions on use need review.", "rating": 2}, {"title": "Victorian locket", "text": "I just purchased a Victorian gold and turquoise locket. While the process was very satisfactory and shipment was prompt, I was disappointed in the locket. The picture on the website indicated that it was in mint condition but the actual locket was very tarnished. I was planning on giving it to my daughter for Easter but it is not fit for gift giving.Betty Stevenson", "rating": 2}, {"title": "Ruby Lane Checkout Confusing", "text": "I found Ruby Lane checkout to be very confusing and frustrating.  After putting an item in my cart, I expected to give my credit card information, then check out.  It seems to work backwards and a person who isn't familiar with it doesn't know what to do next.  This was my first, and maybe only, purchase on RL.", "rating": 2}, {"title": "the imposition of service fees is a…", "text": "the imposition of service fees is a serious mistake. how much each seller charges also seems arbitrary.  the fees add a lot to higher priced items and also to the cost if the purchaser buys from multiple vendors. I have decided against three or four purchases lately due to the fees. reconsider this policy.", "rating": 2}, {"title": "Payment options are not for me", "text": "Many vendors on Ruby Lane are just fine but I am giving up on purchasing via this site after my most recent purchase that insists on PayPal (which I will not use after my son was conned by someone insisting on PayPal) and lost hundreds of dollars.", "rating": 2}, {"title": "You have to pay them to buy from them", "text": "Ruby was always a great site to find vintage and antique merchandise of better quality but now I see they are charging a sneaky buyer's fee...I have to pay them a fee to give them my business…. why not just send donations directly to the CEO's bank account or throw your money in the street lol!  Ruby isn't an auction house, nobody is running auctions, the sellers do all the work.  This fee, along with many sellers beyond greedy prices and that awful sales tax, will send ruby right down the tubes.", "rating": 2}, {"title": "I'm beyond disappointed", "text": "I'm beyond disappointed !  I paid for a vintage ring late yesterday evening and I haven't received my tracking order so I have absolutely no clue when I'll receive the vintage ring I ordered through your site.  I hurried to pay and so I don't know when to expect the vintage ring I ordered through ruby lane.", "rating": 2}, {"title": "\"make an offer\" feature disfunctional", "text": "I attempted to utilize the \"make an offer\" feature, which is a great idea; unfortunately, the attempt was unsuccessful.  The reason why I did not finalize the offer is because when I typed in the amount of my offer,  the transactional summary box (or what I thought was a transactional summary box) did not edit. That is, it still included the asking price, plus shipping, plus tax.  For fear that my card would ultimately be charged the full asking price and not my offer, I opted to not make the offer.", "rating": 2}, {"title": "Terrible", "text": "Terrible. I can’t pay with a credit card, only PayPal. You can’t pay for multiple items at once. It’s really a pain in the butt. Did not enjoy this shopping experience. I’m still having difficulty paying for 2 of my items.", "rating": 2}, {"title": "I could not get in", "text": "I could not get in. The sale started at 10:00 AM CST but it was impossible to get into the website. I waited until 10:20 or thereabouts before I could actually get in.  By that time had I wanted more than one item there’s a good chance it would have been purchased.", "rating": 2}, {"title": "I ordered a Vintage Madame…cannot trust Ruby Lane", "text": "I ordered a Vintage Madame AlexanderVictoria Baby Doll for my twin grand daughter less that a week ago.I bought the doll mainly because I needed this doll in 18\" size  to match one I have. The description  stated clearly that the doll I was ordering  was 18\". The doll arrived today and it is about half that size.I paid for larger size and need it for Christmas. I can never trust these people again. They knew exactly what I had paid for.I have document to prove.I have asked them to send me the doll I have paid for.", "rating": 2}, {"title": "My offer on an item was accepted then…", "text": "My offer on an item was accepted then canceled. I placed a bid then received an invoice for the amount and a request for payment. I sent a request for information on making the payment and then got a note from the seller that the item was not available. I think the seller had second thoughts about accepting my offer (which was only 10 dollars less than the asking price, so it was a reasonable offer) and then canceled the sale. I do not think this was a fair and professional way to handle the transaction and I am dissatisfied.", "rating": 2}, {"title": "Limited negotiation.", "text": "You do not have the flexibility for purchases.  After 2 offers, no further action is allowed.  This is cumbersome and will probably kill some sales that may otherwise be completed.  You should allow more negotiation.", "rating": 2}, {"title": "Cost of buying or selling where only Ruby Lane wins.", "text": "Ruby lane policy cost buyer and seller to much in money and time. We know the tax needs to be collected and dispersed but the cost is too high and does not need to be made so high in each transaction. Insurance cost does not take into consideration priority mail 50.00 inclusion and charge a blanket amount for all items. I paid $30.00 to ship a package that weighs less then 1lb. and cost $95.00. Included in the higher price is the cost to sell. Then more FEES??? Too much!! The same item offered on ebay and RL almost doubled to cover costs! Bad business.", "rating": 2}, {"title": "Incomplete Order", "text": "I joined Ruby Lane to purchase a particular item today.  After setting up the account, I put the item in my cart and proceeded to finalize the sale.  When I got to the payment screen I realized PayPal was not available, but it was PayPal Credit.  I went back to the previous screen to charge it to my Amex card and got a message that the item was no longer available.  I then went to e-bay and purchased the same item.  Now the seller has contacted me to pay for the item on Ruby Lane which I was told was no longer available.", "rating": 2}, {"title": "I tried to pay for the purchase…", "text": "I tried to pay for the purchase immediately but it wouldn’t allow it and said a purchase order would be sent to my email.(?)I contacted the seller the next day and they said I should pay again on the site. Nope! I tried twice and through some kind of site glitch, it wouldn’t go through.I called the seller directly to GIVE my payment info and settle this. I received a recording that they can call me but I can’t call them, basically. Something is weird here.My spidey senses are going off. So I canceled the entire order. I’ve ordered from Ruby Lane before several times. No such foolishness then. Someone should fix this.", "rating": 2}, {"title": "These intaglio open salts or ash trays…", "text": "These intaglio open salts or ash trays are not what I would call in a generally good condition. Both have large chips. I will keep them because I cannot find this type with the triangular ends, but I would call these fairly big chips that should have been mentioned. Sandy", "rating": 2}, {"title": "Software to make second offer on item…", "text": "Software to make second offer on item did not work properly. Kept inserting sellers number instead of my slightly higher second bid amount. And then showed as purchaseed. Now have to figure out how to unwind without hurting seller and without spending more than I intended", "rating": 2}, {"title": "The payment part was difficult", "text": "The payment part was difficult. I was about to pay with a credit card and then somehow it was switched to PayPal, (which I dislike and never use if I can avoid it). So bottom line, I still haven' paid for my item. In fact I don't know how to do it. I am stuck!", "rating": 2}, {"title": "I received the reply from the seller", "text": "I received the reply from the seller, with the final amount  of shipping and insurance, from Switzerland.   But, I have NO IDEA how to proceed with the purchase.  How do I connect with PayPal?? Can not even see how to pull up \"my account\" from Ruby Lane page.", "rating": 2}, {"title": "I do not think sellers are good…", "text": "I do not think sellers are good business people.", "rating": 2}, {"title": "Wishful thinking?", "text": "I liked the selection and did order an item at a fair price,  however it's been 6 days and haven't received a email from the seller with the tracking number.  Hope this doesn't turn out to be a scam.", "rating": 2}, {"title": "A great selection of merchandise BUT…", "text": "A great selection of merchandise BUT there is no app and it is a major major major hassle logging in and searching from a smartphone every time. I mean come on people, get into the 22nd Century. Furthermore, I don’t like that I can’t manually type in the monetary amount if I want to filter by price. For example, I can’t look at all rings under $100. Instead, I have to pick an increment and it takes several steps each time to amend the amount. Everything I love about Ruby Lane has to do with the people selling on it. Everything I hate has to do with the people who designed Ruby Lane.", "rating": 2}, {"title": "Site mechanics still stink", "text": "Let me be clear: I LOVE Ruby Lane. I love the shops, shopkeepers, merchandise. What I downrate - EVERY TIME I make a purchase - is the HORRID CONFUSING structure of the website's customer/member information section. It hasn't been updated or redesigned in the more than 10 years I have been struggling with it and complaining about it. It seems to have been designed as a joke by someone's 14-year-old grand child for a grandparent who never goes on the Internet. ALL my reviews say the same thing and they are NEVER acknowledged or addressed. So much for caring what a repeat customer who has spent thousands on the site thinks.", "rating": 2}, {"title": "A friend asked me to order something…", "text": "A friend asked me to order something for him. I went to your site and typed in the ink well he wanted. It didn't show up. I typed in just the words ink well and it still didn't show up. I almost gave up but today he asked me to do a google search and I did. This was the ONLY way I could get to the item for sale on Ruby Lane. It is $275. I bought it. You should check into this because I almost walked away from it. I am glad he was persistent with me to keep trying. Again, directly typing in the description on your site DID NOT produce the item. A GOOGLE search with the same name DID PRODUCE THE ITEM.", "rating": 2}, {"title": "I almost didn't buy an item for…", "text": "I almost didn't buy an item for @$300.00 because I hadn't used Ruby Lane for sometime. The website would not take my password. I tried many time to reset my password but it always would time out or the reset button didn't work.", "rating": 2}, {"title": "Problem with checkout", "text": "I had a problem with checkout which added unnecessary insurance costs to my shipment. No one was available at either RubyLane or the vendor to help correct the situation.", "rating": 2}, {"title": "shipping cost", "text": "International shipping cost is extremely high.It’s a joke just for the cost of one item !!!I contacted seller!  Items combined and shipping total cost was far lower than before one item’s ship cost..A lot of effort just to purchase", "rating": 2}, {"title": "HELP PLEASE", "text": "Hi, I had lots of items in my cart and did not see a \"DELETE\" next to any of the items. I saw no way to DELETE items. I wanted to save them until I could purchase the 3 items I wished to purchase. I tried to \"save the 3 items = however it now seems that I have purchased a lot of items and \"PAYMENT\" is expected. I purchased on Ruby Lane about a year ago and previously \"DELETE\" was next to every items in my cart = I did not see delete next to items. How go  I get rid of items in my cart in the future?  What can I do about ALL of the items that payment is expected for?  PLEASE  RESPOND.  Thank you, Rosa", "rating": 2}, {"title": "Problems During Checkout (Firefox + Linux)", "text": "The checkout process was problematic using the latest version of Firefox with Linux.  I was able to resolve the issue using Chrome, but FF is a standard browser, and these kinds of compatibility issues are unacceptable.Reply Response:I understand that the issue may have been Paypal, or an addon, etc.   The fact remains that the checkout experience was problematic.  As a consumer, I don't care who is at fault - I just know it didn't work correctly.  Perhaps it's time you found another partner - Paypal is always disappointing.  I would recommend using Stripe.  Paypal is a blight on the Internet.  It's time to migrate to a better partner.  :)", "rating": 2}, {"title": "Your website,for me", "text": "Your website,for me, is a pain in the butt to use and it could be a lot better.I would buy more but your website is just too cumbersome to fool with at anytime.  I find Etsy is much more accessible and easier to use.Danny B. Cook", "rating": 2}, {"title": "About sudden offer cancellation", "text": "About sudden offer cancellation \"antique dolls history\" suddenly canceled the offer acceptance without any explanation.  In the past I had the offer canceled, which the shopkeeper sincerely apologized and explained to me why it was cancelled.  However, this time there was no explanation, and it was written after waiting for a reply for 30 hours, saying [I can only give a small discount].  Apparently the owner was wrong.  Moreover, the shopkeeper seems to have noticed the mistake by asking me a question.  In this way, a customer who is unilaterally canceled without apologizing cannot give any evaluation to the store.  Other customers also have no chance to know the trouble.  It's too cruel to me and I want her to return my time to her.  I think this mechanism is strange.", "rating": 2}, {"title": "Insurance charge", "text": "The charge for insuring an item in my opinion should be OPTIONAL!  NOT forced upon me.  How possible is it that a silver spoon might me damaged during shipment?  It smells of a scam to charge for shipping insurance.", "rating": 2}, {"title": "Checkout was odd", "text": "Checkout was odd. Had item in basket, and went to pay for it, and then it said item was not there!  Went back to listing and repurchased.  50% off sale started off with site being down, not good at all.", "rating": 2}, {"title": "A BIG DISAPPOINTMENT!!!", "text": "The description led me to believe I was buying an item was of good quality only to find out it was very overpriced. It is very difficult to know which sellers can be trusted. The seller took returns but, between postage, return postage, and restocking fees, I will only get about 1/2 of my money back. The restocking fee was clearly provided so that was not a problem. I was not skeptical enough — the pictures did not show what a cheaply made item it was. Also I could not make an offer on an item even though I followed the process and the unwritten “rules” about how much of a discount you can request.   Very disappointing (and costly) experience. I will not use this site again!", "rating": 2}, {"title": "Terribly disappointed in my first Ruby Lane", "text": "Terribly disappointed in my attempt to purchase a ring . I communicated with the owner on what seemed a perfect choice for me.I paid the negotiated price of $1473.and was told the ring would ship that same day or the next. After 2-3 days and not hearing anything, and meanwhile expecting it any moment in my mailbox, I asked again for a tracking number. His note said Sorry. Sale is cancelled as there was unnoticed damage. ?? And that I would get a refund in 2-3 days. (Seems to me if the damage was that extreme,it should have been noted BEFORE listing. .) I sent a note again saying that PayPal did instant transfer, and I still had no refund after almost a week. I have it now,but I was so unhappy and disappointed. He might have explained,or offered a like ring or something?! My 1st transaction with Ruby Lane left me with a bad taste, and a bit Leary as well. Thanks for listening.", "rating": 2}, {"title": "Website Credit Card Payment Issues", "text": "Merchandise was great.  The ordering process on te website was awful.  I do not have a PayPal account and it would not let me use a credit card.  I could not find a telephone.  I felt completely lost and abandoned.", "rating": 2}, {"title": "The checkout is undul…", "text": "The checkout is undul complicated,buying without knowing the total of shipping and insurance. The Many Worlds of Japan is excellent, however.", "rating": 2}, {"title": "You’re format be it old or updated…", "text": "You’re format be it old or updated makes it very difficult to make a purchase I’m certain this is not pleasing the sellers and it certainly is not pleasing this buyer.", "rating": 2}, {"title": "Super confusing..", "text": "Super confusing... I want to pay for the product, but I have to wait for a phone call...It’s not user friendly... to much reading of details... I don’t care if they call or not now..,", "rating": 2}, {"title": "Rubylane does not allow buyers to go…", "text": "Rubylane does not allow buyers to go back to the original posting to compare the description and photos to what arrived. Very disappointing and frustrating.", "rating": 2}, {"title": "PURCHASE ORDER #5195586 CLOVERCROFT…", "text": "PURCHASE ORDER #5195586 CLOVERCROFT ANTIQUES.Have not yet received any information from merchant confirming order or ship date or tracking number.  Hpe I don't have to file a claim with PayPal!", "rating": 2}, {"title": "Incredibly difficult to manage payment", "text": "Incredibly difficult to manage payment if you do not wish to use PayPal. I will neither be using this service again, nor would I recommend it to anyone: friend or foe.", "rating": 2}, {"title": "Your products are good", "text": "Your products are good. However, I am still waiting for taxes paid on my returned item to Nikros. I don't have a way to contact customer service. Please  expedite this matter.", "rating": 2}, {"title": "I find it very interesting I would…", "text": "I find it very interesting I would receive this review even before I purchased the item I was interested in. How can I review something like that. I haven't even received the item.", "rating": 2}, {"title": "I do not like being forced to join your…", "text": "I do not like being forced to join your email gathering info in order to purchase on this sight. I feel you are selling my user info.", "rating": 2}, {"title": "Confusing ordering process - no shipping costs etc provided in the cart", "text": "signed up for account with Ruby Lane.  Decided to make a purchase and put item in my cart - the vendor did not provide approx shipping costs to Canada and I sent question saying I would not pursue order without prior knowledge of shipping costs in order to determine whether the cost was in keeping with other vendors - I have been emailed an invoice and the amount being charged is too costly. I don't wish to make the purchase and I am concerned as the communications from vendor and Ruby Lane don't indicate how I might cancel my order.  In other websites / vendors such as Amazon - you are given full costs including shipping before you making a commitment and provided credit card details.  I don't plan to make another purchase on Ruby Lane - I will use eBay, Amazon and Etsy which are more easy to navigate", "rating": 2}, {"title": "the products are great but paying is impossible.", "text": "The products are great, but it was very hard to navigate the purchasing process and impossible to figure out how to pay.  The problem I had was once I had put the item in my shopping cart, I did not know when I had placed an order and I did not know how to pay.  There needs to be a 'pay' page where I could enter my CC info, or a message that pops up if you click CC that says you need to call the vendor to pay, or something like that.  I did get an email from the vendor, was able to give her my  CC info, and we are all good to go now.  I also never saw a place to enter my shipping info which i wanted different from my billing.  I just left it so she will ship to my billing address - not a big deal but would rather have entered a different address.", "rating": 2}, {"title": "I love most of the website", "text": "I love most of the website, but I don’t like the fact that the use of PayPal is not an option. After making my first purchase, I became aware of it even though I used a credit card.", "rating": 2}, {"title": "Tried to sell items on RL", "text": "Tried to sell items on RL. Bad experience. They charge you for everything, mess up your professional photographs and do not achieve realistic levels of sales and exposure. Can't recommend.", "rating": 2}, {"title": "was forced to pay shipping and…", "text": "was forced to pay shipping and insurance on a piece that I am picking up in person and did not find that out till final check out --will never use your service aqgain   thank you", "rating": 2}, {"title": "It used to be easy to pay for…", "text": "It used to be easy to pay for purchases, I now find it somewhat different.I just purchased an item and now haven't figured out how to pay for It. Too much time to spend on this.", "rating": 2}, {"title": "Issues to fix!!", "text": "I only use RL every 6 months.  When I do find something to buy, the process is complicated and slow!!   I do not get email messages from sellers.  When i try to sign into RL, I get the constant spinning \"loading\" wheel... 2 min later it is still spinning.... then I click out of one screen and suddenly I am in.  What?!?!?There is no message or hint on the main screen that I have messages or my offer was accepted.  I tell the seller to send me an email to my email ... so i know whats going on ... they dont.   I have wait and wait for them to close the pending sale 3 days after i pay!!   What?!?!? I dont have time for RL!!   Or RL sellers.  The prices are usually too high.   ETSY is too but at least sign on, variety, communication and payment is 10x faster.Yuck and ickyI dont need sticky!", "rating": 2}, {"title": "I found this site very hard to use", "text": "I found this site very hard to use. I tried repeatedly to fill in myinformation but the  printed directions kept  saying it hadn’t taken correctly. I gave up several times.", "rating": 2}, {"title": "The message system is confusing &…", "text": "The message system is confusing & messy. Takes too long to find recent from.past.I tried 3x to change my email even with help from ruby Lane. But it WOULD not.I know had huge problem purchasing 2 days ago. Because I did not originally put my Paypal email last May and it blocked me to puchased with my papal email in the message 2 days ago and I had to phone the business four times and be annoying and it was embarrassing. Than Trustp blocked me at a crucial time of doing the transation due to I put in 1 wrong letter typo due to stress. ID like an apology from Ruby Lane and ID like them to fix my  abilty to change my email despite having set it up in desperation as anothet account. so as now of yesterday I have two functioning separate accounts which I'm not happy about because all my past history is on one and the new history is on the other. would you like that?", "rating": 2}, {"title": "I was disappointed in the purchase", "text": "I was disappointed in the purchase. I purchased the body for a dear friend who showed me the head of a doll she had had for many years and regretted that she never made the doll.  She is running out of time, so I thought as a gift I would hand her a completed doll. The body was loaded with old glue not the right glue either.  Globs stuck all over the neck part and permeating the cloth.  It is impossible to sew.  I am keeping the doll body. Time is important to my friend so I will make do with it. a finger is chipped and the wire way too big with hands badly placed.  In short I have other dolls and I like to fix them up. I was hoping to purchase a pattern or wig  but if this is the quality I doubt I will. None of this was mentioned in the advert for I purchased it from. It said it had been used only.", "rating": 2}, {"title": "TAXES...NOW WHAT!!!", "text": "I'M FINDING THAT THE COLLECTION OF TAXES IS CAUSING ME NOT TO PURCHASE ON RUBYLANE AND SO MERCHANTS HAVE MISSED OUT ON QUITE A BIT OF MY PURCHASES.THIS IS SUCH A RIP-OFF.", "rating": 2}, {"title": "For the vintage Noritake salad plates #8674", "text": "For the vintage Noritake salad plates, I wanted to order 4 ea., that came to a total of $32. In the cart area for this item, an option was provided to check the shipping charges to my zip code. The priority mail option was under $13, yet when I moved forward to the next screen, the shipping charge was stated as $32, making this over $70 total when everything was added. I messaged the seller before paying, telling her that the shipping fee was high, and asking if there was something that could be done to bring this cost down. After sending the message to the seller, the system threw me right into the payment mode, I’ve been emailed an invoice for $70.19, and there has been no response received from the seller. I am not paying this for four $8 salad plates. This is my first experience with your site, and I will not be using it.", "rating": 2}, {"title": "I made a offer in doll then u countered…", "text": "I made a offer in doll then u countered  then I gave final offer 325 have not got answer on your site says congratulations on purchase did I get accepted? Please advise", "rating": 2}, {"title": "First of all", "text": "First of all. Sent an email with a confirmation # of purchase.  work on thank and deliver quality goods. and allow customer to order as a guest if they choose.", "rating": 2}, {"title": "Your webstte is not user friendly", "text": "Your webstte is not user friendly!  Had a hard time getting my address into my account, and it would not let me order more than one of the selected item.", "rating": 2}, {"title": "Betsy McCall doll - Robert Tonner", "text": "I ordered a doll that was shown on your site as brunette but the doll I received is blond. 😟 My receipt and email confirmation both stated “brunette.”", "rating": 2}, {"title": "Payment system is odd/ confusing", "text": "I have made my purchase but the payment system is very odd and confusing. I hope this works out ok.", "rating": 2}, {"title": "My first checkout on ruby lane did not…", "text": "My first checkout on ruby lane did not go well. If you can only pay using paypal it should be made clear at the outset. I will not be ordering again.", "rating": 2}, {"title": "Easy experience", "text": "First time user and it couldn’t have gone smoother. Very easy to use the website. I haven’t received the painting yet but have confidence in the seller.", "rating": 2}, {"title": "Playing card deck not in condition described by seller", "text": "I purchased a playing cards deck that was advertised as :\"mint, sealed deck\", but the deck was not sealed. The deck (not just the box) was not sealed and the cards were in \"good to very good\" condition at best. I have another copy of this deck that I purchased elsewhere, and the edges are much cleaner. The box was in \"acceptable\" condition, and it was loosely wrapped in plastic wrap (the kind you wrap food in). The whole thing was well packed though, and the seller responded to my questions courteously and promptly when I was placing my order. Shipping costs are very reasonable, but the goal of my transaction was to purchase a deck I was interested in and I expected to get the deck in the condition it was described. And this the seller failed to do. This was my first experience with this seller. Deck: \"Jeu au Portrait d'Auvergne\".", "rating": 2}, {"title": "The paying process via Paypal was much…", "text": "The paying process via Paypal was much more complicated than I have experienced at eBay and Etsy. My interactions with the dealer were great.", "rating": 2}, {"title": "The sale page kept kicking me back and…", "text": "The sale page kept kicking me back and I wasn't sure if I purchased the item or not..I had to go to account to see if it went through.", "rating": 2}, {"title": "Still unable to pay", "text": "Still unable to pay! Your site only offers pay pal and when I click on it I do not get a response. There is no offer of other types of payment. Is VISA not available?", "rating": 2}, {"title": "U have the wrong address for my…", "text": "U have the wrong address for my shipping address can u pl change it to the correct address so that my doll can be delivered u are impossible to contact", "rating": 2}, {"title": "I just want to buy it already.", "text": "Got the email, went to purchase item but the link to pay via PayPal is not working.  It goes to nothing.  Now I am trying to figure out what to do.", "rating": 2}, {"title": "Can’t get into see original listing…", "text": "Can’t get into see original listing after purchase. Was steered into using PayPal. Work these problems out. You’re losing business.", "rating": 2}, {"title": "Difficult to navigate", "text": "Difficult to navigate, manage orders, credit card charged but received email saying I need to add payment.  Not sure if my item has or has not been ordered.", "rating": 2}, {"title": "Awful Photos of Clear Glass Items", "text": "I have to rate you low because the photos of clear glass items are awful! Not a specific shop owner but all of them. What is up with that? Very deceptive.", "rating": 2}, {"title": "In an age where operating a website is…", "text": "In an age where operating a website is pretty cost effective, RL is a total failure.  A local street corner or ebay is probably more effective.  Just sayin.", "rating": 2}, {"title": "Your payment method is  confusing", "text": "Your payment method is  confusing ! Wanted to pay with a credit card and got stuck with PayPal ? Tried to change payment method several time but couldn't !", "rating": 2}, {"title": "Poor First Buying Experienced", "text": "I had a hard time figuring out how to register/log on initially.  Your system recognized me sort of, but I still had to re-register. Figuring out how to pay was a nightmare requiring 6 back and forth emails with the seller.  I don't like that I can't go back and review the listing page of the item I just bought.  I don't like shipping being a secret until after I commit to purchase. I don't like that correspondence with the seller isn't retained on the site for potential conflict resolution.  I could go on.I am a high-dollar-volume seller on eBay and have been since the beginning, AND I own my own e-commerce site selling similar items.  Furthermore, I tried selling with you for a while but it didn't work out.  So I'm no stranger to how such sites work or don't work.  That said, as first-time buyer my experience was not good.  Nothing about it felt safe or under control by the host.", "rating": 2}, {"title": "Rubylane does not prominently display…", "text": "Rubylane does not prominently display item locations which leads to huge sticker shock when you find out that you are buying from a foreigner whose postage costs are through the roof. I had committed to a purchase not realizing that it was in canada and had to wait on a quote for shipping which turned out to be more than the book (and the book is quite lovely).i am not angry at the sellers, but annoyed with the stealth with which item location is handled. i would not have purchased knowing that shipping would make the purchase a bad deal. the checkout process should have boldly shown item location. i would have bailed then and there since this is a book i could find elsewhere easily enough. the seller was apologetic about the postage, but at least i know why it was so high - something i didn't realize when i saw the quote - scanning my email.godden is the godfather of english porcelain history, so it will be acceptable.", "rating": 2}, {"title": "First experience not good", "text": "First experience not good. Tried to make offer and now it says I owe 150 more than offer and this site is confusing and very hard to deal with.", "rating": 2}, {"title": "I tried to pay using visa and it…", "text": "I tried to pay using visa and it directed me to pay using PayPal which I didn’t care to do.  It appears I didn’t have a choice but I not going to use PayPal.", "rating": 2}, {"title": "the  check out i should be like Ebays", "text": "Date of experience: November 02, 2022", "rating": 2}, {"title": "The added costs have now discouraged me…", "text": "The added costs have now discouraged me from purchasing in the future. Never  before have I noticed such  outrageous extra charges! Jennifer Hornick", "rating": 2}, {"title": "Found this ordering system very confusing", "text": "Found this ordering system very confusing as a first time buying as we are a seller on RubyLane!!Veryvery onfusing!", "rating": 2}, {"title": "Great for buyers but not so for sellers…", "text": "Maybe great for buyers but not so great for sellers. As I understood, signing up and creating a shop for the first month was free and you got 10 free listings to start with. Just over two weeks from creating a shop, I have a bill for $28 and was told that I would owe $82 in just under another 2 weeks. And then I go and find out that their service fee has been increased from 3.75% to a whopping 6.7% during the two weeks of me having a shop. Looking at the traffic stats for my shop, I can see that the traffic I received in them two weeks was just not worth the $28 that I now apparently owe. I contacted them and was told I had to be signed up for a minimum of 3 months to properly see the effectiveness of their site and yet all that goes through my head when they say this is that they are going to be receiving over $160 in fees for that amount of time. Why not offer 3 months free then if this is the case? Needless to say, I'm not happy!", "rating": 2}, {"title": "NEED A LOT OF WORK ON YOUR CHECK OUT…", "text": "NEED A LOT OF WORK ON YOUR CHECK OUT PORTAL TO NEW BUYERS AS I WAS VERY DIFFICULT TO FOLLOW WHEN IT CAME TO PAYING    EVERYTHING ELSE WAS FINE 5/5", "rating": 2}, {"title": "I have emailed on several occasions and…", "text": "I have emailed on several occasions and never did hear back. If someone can call me that would be great 631 553 9806", "rating": 2}, {"title": "We have shopped on Rubylane many times…", "text": "We have shopped on Rubylane many times and have never had any problems like this weekend. 1) The ability to pay without PayPal is unbelievably difficult! We wanted to pay with just a credit card and it kept us going around and around in circles; After going through the instructions several times, and it didn't work, FINALLY something popped up that hadn't BEFORE, And we were able to put in my credit card number WITHOUT going through Paypal! I DON'T have PAYPAL, and don't want it! It should be easy to pay; it wasn't! 2) The concept of blocking a customer from buying is only done on YOUR SITE, no others! It is ANTI-CUSTOMER, AND NEEDS TO END!   My wife was driven to tears by a vendor who kept us from purchasing something I had picked out for her;I had to go in and purchase it with my own account!  She has a store on Etsy; she would NEVER do that to a customer! Please do what's necessary to correct these problems!3) You need to have a customer service/ grievance phone number to be able to talk with a REAL PERSON!", "rating": 2}, {"title": "I tried to pay for an item using PayPal…", "text": "I tried to pay for an item using PayPal and received so many mixed messages that I got frustrated. Something needs to be fixed.", "rating": 2}, {"title": "I do not want to review \"Ruby Lane\"", "text": "I do not want to review \"Ruby Lane\".  I want to send a review for the Ruby Lane Shop where I made my purchase.", "rating": 2}, {"title": "Print Purchase Details Before Purchase-Details NOT Accessible After Purchase", "text": "Over the last several years, I have made multiple purchases from Rubylane. I have always been very happy with the vendors, items offered for sale and customer service provided by the vendors. I am NOT happy with customer service provided by Rubylane.  Sometime ago I contacted Rubylane about issues where one cannot review purchase details once the purchase has been completed.  I received several placating answers (which were all incorrect) and no one at Rubylane appears interested in fixing the problem.  A purchaser needs to review the full item description before leaving feedback but Rubylane does not allow the purchaser to access details once the item is purchased.  I realize potential issues with maintaining details for months after the purchase but it should be available until the transaction is actually completed and the feedback is provided.  I should not have to print screens prior to purchase so I have full details on the items being purchased.  Also, I don’t understand why Rubylane has not addressed this issue in 2 plus years but the lack of concern in resolving this issue is my reason for 2 stars.", "rating": 2}, {"title": "Not able to pay for the item", "text": "Not able to pay for the item.  Had to send seller email to send bill through paypal.  Buttons of paypal on Rubylane do not work.", "rating": 2}, {"title": "Offer/Counter Offer option mistake resulted in unagreed upon sale price", "text": "Hi,I have been buying from Ruby Lane for many years and have never had any problems -- and usually have had a most enjoyable experience as a purchaser.However, I just had a very frustrating experience when I tried to make an \"offer\" for an item I was interested in. When my first offer was \"countered\" -- I tried to make a second offer, and instead of registering my second offer, the site somehow turned the dealer's initial counter offer into a sale -- at a sale price that I did not want and cannot pay for. Perhaps inadvertently I did something incorrect when I was going through the prompts for the \"offer/counter offer\" process -- but I have made many purchases at Ruby Lane over the past few years, and something like that has never happened to me before.I have emailed the dealer and hope that she will be able to correct what occurred and that I will not be held responsible for the purchase -- as I did not wish to (and in fact cannot) pay for the item at the initial countered price.Sincerely,Allerton Cushman", "rating": 2}, {"title": "This item was a tiny scale of what I…", "text": "This item was a tiny scale of what I thought I was buying not enough information was provided on dimensions", "rating": 2}, {"title": "Rubylane now charging a \"buyer's premium\" ???????", "text": "I am a seller on Rubylane, and I enjoy having my business there.  But I think Rubylane has gotten greedy.  Rubylane has started adding a buyer's premium to the sales tax portion of a sale.  First of all, paying sales tax for online purchases is a shock to the pocketbook after not ever having to pay sales tax to online purchases.  For Rubylane to add this new fee about the same time as the sales tax is just tacky.  My buyers are outraged!  It's affecting my business!!  I buy on Rubylane as well as sell, and I'm not happy about this.  Rubylane has added so many new vendors that the competition with sellers is fierce.  The antique market is soft, people are not buying like they used to and with the thousands of vendors now on Rubylane it is hard to get noticed.  I'm disappointed in Rubylane. I don't think they take these issues into condsideration.  You are making it harder to sell, I'm not sure how much longer I will be able to stay in business.  I think Rubylane is getting greedy.  My customers are very upset about this extra fee!!!!!", "rating": 2}, {"title": "Could not complete purchase through…", "text": "Could not complete purchase through your site. You have a problem. I had to make arrangements with the seller personally.", "rating": 2}, {"title": "Still do no have my order yet", "text": "Still do no have my order yet. Mailed usps priority. It has been 4 days and no item.", "rating": 2}, {"title": "Unclear about putting in my credit card…", "text": "Unclear about putting in my credit card information and when invoice sent to my email, saying I was paying with Pay Pal?", "rating": 2}, {"title": "i cannot tell if my order went through", "text": "i cannot tell if my order went through. I went through the motion of paying but the charge did not show up on my account.", "rating": 2}, {"title": "As a new user", "text": "As a new user, I found this site VERY cumbersome and rather frustrating to 'navigate' and use!", "rating": 2}, {"title": "No credit card ability, checkout confusing", "text": "Unbelievably, site has no secure servers for credit card payments.Checkout is confusing, poorly designed.", "rating": 2}, {"title": "emails received after attempting to pay…", "text": "emails received after attempting to pay with cc are bewildering!", "rating": 2}, {"title": "I found this site very frustrating to…", "text": "I found this site very frustrating to contact when there is a problem. I tried multiple times to reach them today. My e-mail was rejected and nothing would work to convince them that this was indeed my e-mail. I finally called the shop that had the item, that  I wanted (closed on Monday), left them a message and was finally able to purchase the item in my cart thru PayPal. this before it was purchased by someone else! I attempted to call Ruby Lane  three times and used every thing I could think of. I even attempted to set up another new account and change and my pass word. Nope they would not accept the e-mail that was correct! It should be noted, that when you call the number listed on the contact number, it goes to an antique shop , but not Ruby Lane. I had to get their correct number (1-415-362-7611) from that shop that sells on Ruby Lane. The man who answered was so nice. Said I was not the first one to call them because of the incorrect number. This was the hardest I ever worked to buy something from a seller. It still is not corrected! Not sure I will buy from them again. This was also not the first time I've bought from them. There was no one to talk to  I guess they will blaime it on the Pandemic!", "rating": 2}, {"title": "I couldn't complete my order because…", "text": "I couldn't complete my order because the site gave me a broken site and kicked me off", "rating": 2}, {"title": "I ordered a doll on Friday 2/21/20", "text": "I ordered a doll on Friday 2/21/20 . Received one email .Have yet to hear anything else.", "rating": 2}, {"title": "Great service", "text": "Great service! items  were glass and packed very well! Would order from them again", "rating": 2}, {"title": "I have a shop on Rubylane", "text": "I have a shop on Rubylane, but just purchased something as a buyer.  I have to tell you that since all this \"change\" you speak of has gone into effect, the quality of the merchandise offered in Antique Dolls has declined considerably.  The shopping experience is very uninspiring and unexciting, except for a very few pieces offered.  I know as a shop owner that when I list anything in my shop, and after I mentally calculate my losses of almost 10% after Paypal fees I realize I am pedaling backwards as a business person.  The margin of profit on antiques today is not much more than 10%.  I realize you have grave reasons for this action, but I believe the future of your site may be in grave danger of ending. I would really miss you, recalling how good it used to be.  I suggest drastically lowering the commission you charge and maybe raising the listing fees so to attract better items to be listed.  There are literally many $10.00 items like a yard of lace on there now.  The cost of a finalized transaction is $1.00 for those sellers, but if I list a $10,000.00 doll that I am making $1000.00 on to start with before fees, I would call that bad business.  I can not raise my prices in this already vulnerable market.   What can we do to save Rubylane, the only attractive, quality, user friendly site out there.Thanks,Mary Ann SpinelliShop Owner and Customer", "rating": 2}, {"title": "So far it has been user friendly and…", "text": "So far it has been user friendly and seemed like good quality at a fair price.", "rating": 2}, {"title": "Always enjoy buying something from…", "text": "Always enjoy buying something from Rubylane. All the dealers have been wonderful!", "rating": 2}, {"title": "It was difficult and frustrating to …", "text": "It was difficult and frustrating to change my payment option once I had set one", "rating": 2}, {"title": "Trust in God follow the light do good…", "text": "Trust in God follow the light do good and I can have whatever I want...", "rating": 2}, {"title": "The purchase was a little bit difficult…", "text": "The purchase was a little bit difficult to maneuver, but doable.", "rating": 2}, {"title": "I sent you a message regarding my…", "text": "I sent you a message regarding my order. Never received a reply.", "rating": 2}, {"title": "I am not happy", "text": "I am not happy that I, as a buyer, was charged a service fee.", "rating": 2}, {"title": "Your website is unduly challenging and…", "text": "Your website is unduly challenging and complicated. I first tried to sign in and it kept circling me back to the same sign-in without telling me, as it turned out, that it didn't like my password--even though it was my correct password for years. I actually gave up and took you from my desktop. Eventually, I went back and did the only choice possible: even though your system recognized me and furnished my password (at least the correct number of dots) from your own site, I registered a new password and finally got in--NOT FEELING WELCOMED by this time--a lot of time!I ordered $800 from The Many Faces of Japan then had another adventure with the basket and checkout. The latter complained that I hadn't bought anything in a long while and despite having signed into the site once, I was obliged to do so again. Then I don't remember except that the actual checkout takes several pages that are not intuitive to use and took an inordinate amount of time to finally figure out. I was on a page that seemed like it was the final confirmation of my order, but I had to experiment to discover that there was a following page to finally confirm the order.Then the worst surprise, c.$350 shipping for 5 small porcelain plates!!!!!!!!. Forget it and Ruby Lang: when, after all the fussing with the site, that number pops up suddenly, it seems like extortion.Ruby Lane may meet its merchant's needs, but the site is a fundamental disaster in comparison to, say. ETSY, eBay merchants, Japanese Vintage, Dept-Japon (an eBay client) Mistral, Amazon, etc., etc. You may acknowledge the time I spent trying to buy from your merchants and to provide this feedback, not just complain, by an appropriate favor.tomPS:Even what follows this reply is convoluted and insults the reviewer's intelligence, a PhD published scholar.", "rating": 2}, {"title": "I can’t review you because I can’t get …", "text": "I can’t review you because I can’t get to purchase my order .", "rating": 2}, {"title": "I still have not received my order", "text": "I still have not received my order. It’s been two weeks", "rating": 2}, {"title": "Payment by credit card was confusing if…", "text": "Payment by credit card was confusing if not impossible.", "rating": 2}, {"title": "the site would not allow me to view my …", "text": "the site would not allow me to view my payment information.", "rating": 2}, {"title": "My Books", "text": "I go to your room and never coming out too!", "rating": 2}, {"title": "Difficult slow website", "text": "This website is slow and difficult to use.", "rating": 2}, {"title": "Probably with PayPal", "text": "Probably with PayPal.  Not your problem.  Sorry", "rating": 2}, {"title": "Ruby Lane has the best sellers and the…", "text": "Ruby Lane has the best sellers and the best stuff.", "rating": 2}, {"title": "Difficulty signing in and paying.", "text": "Date of experience: May 05, 2022", "rating": 2}, {"title": "Very hard to navigate from paypal to…", "text": "Very hard to navigate from paypal to credit card.", "rating": 2}, {"title": "Failed to link to my Paypay account.", "text": "Date of experience: February 13, 2021", "rating": 2}, {"title": "difficult website to navigate", "text": "Date of experience: May 13, 2019", "rating": 2}, {"title": "Worst website ever!", "text": "Date of experience: April 16, 2021", "rating": 2}, {"title": "Fun shopping experience but checking out a little difficult.", "text": "Difficult to buy items", "rating": 2}, {"title": "Ruby lane has morphed into a different site now that…", "text": "Ruby lane has morphed into a different site now ,that charges extra fees I feel are excessive + unnecessary. One is estate tax, as that is ridiculous, as even foreign sellers are charging it , I feel is merely a ploy to bump up prices. Taxes online are for only for the state you live in, otherwise is wrong. So do others I know who also try to buy here, but find ridiculous \"Extra\" fees above actual mailing costs make buyers pass on purchasing.     Some sellers are fair, but others are just crazy.    I personally find myself perusing the site more than purchasing here, as pandemic + political craziness of not only inflating the prices of everything  by the misguided inept politicians who are not proven businessmen by pushing socialism. If it continues, Ruby Lane will go the way of the Doe Doe bird.       Of course this site bows to the government colluding to raise revenues by false means, as I know sellers who charge no tax on collectibles, + that prevents double taxing, putting money in peoples hands to spend as disposable income that is your life blood, instead of  giving it to those who refuse to account for how the government spends our money from these taxes, instead  funding terrorism supporting those in places like Iran, + Afghanistan, threatening freedom, restricting capitalism, yet pushing verbal Rhetoric to the opposite.      Ruby Lane should fight these changes that hurt buyers benefits of buying online, as everything the government touches ends up destroyed or severely compromised, this is the direction it is heading when theft is allowed in in person stores up to 999.00 before they will prosecute.        So, you see, WE are the lifeblood of your company, + if you stood on our side, goods people collected when they go to nursing homes would be sold through you if you were fair. Instead, you lose out on that $,auctions are the winners instead.          You think you are smart, but as our government pushes to create destruction of the economy, want another depression in order to achieve a national pro communist, socialist government contrived to destroy our founding fathers freedoms based on the US, constitution, your cooperation by excessive fees, will be the end of your business.          Estate tax is paid when items are sold by the principle initially selling their estates to their locality or government, NOT BY BUYERS ONLINE!  You must end this bad idea, only allowing sellers to charge actual shipping fees at the lowest rate or one day Amazon will take your sellers away, putting you out of business.            I suggest that sellers who want to sell high dollar items on your site in the tens of thousands of dollars be forced to sell through sites like Sothebys or Christies, not sell on Ruby Lane. Many of the items these sellers promote are questionable, difficult to chase after authenticating being from other countries,where legal costs+ court fees let alone the rampant fraud dealing across the ocean is impossible, must be discouraged unless there are international protections set in place, that are currently unavailable , or you must be legally responsible . But are not.         I have a lot of experience in online buying internationally , defrauding the US has become BIG BUSINESS for foreigners all across the world.       Mail fraud also is becoming predominant, as is excessive mailing fees internationally. These fees affect your business. Our own postal system is full of criminals, so are people stealing packages from porches. Until these issues afforementioned are all remedied, you can ask for advice, but do not accept liability, only want your money to get rich at others expense, so ...give that a think. These factors limit your success, as we didn't just fall off the turnip truck.  We know, you don't really care,or you would pressure governments to make necessary changes to protect buyers from these issues that impede security online. Until then, Good Luck !", "rating": 2}, {"title": "Rubylane is Horribly Overpriced!  Not Priced For Ordinary Folk.", "text": "I've been shopping antique furniture for a long time and decided to give Rubylane a try.  One thing I liked better than eBay is that most everything is offered to be shipped.  On eBay so few people and dealers want to ship anything and leave it to local pickup that it makes finding things next impossible because you are not able to eliminate local pickups from searches.Rubylane prices are so way out of line that I couldn't believe it.  Almost everyone is asking amounts for brown furniture in the price ranges of fifteen or more years ago.  The antiques market (brown furniture in particular), has been down for quite awhile now.  As far as European dealers are concerned, they don't balk too much, but here in the States there is a lot of whining and complaining about it, yet so few are willing to go the extra mile or even set up online antique collectives like they've been doing in Europe for so long.But the prices on Rubylane are way out of line.  I think it might be because dealers are expecting or hoping a lot of large city interior designers will pay those prices.  Maybe they do, but in my experience having worked for a NYC designer - not really.  Anyway, I just want to put my two cents in on this for any newbies out there thinking they may find a sleeper on Rubylane land.  Forget it, get out and check out the local dealers in your area - that is where the real deals are these days.RESPONSE TO RUBY LANE; Rob Spear, Senior VP of Customer SupportDear Mr. Spear;Thank you for you response but I do stand by my initial experience and review. I spent approximately four hours on Rubylane's site last night searching for various pieces for which I have priced similar counterparts elsewhere.  This included both internet dealers and brick and mortar stores, including the UK and France.  And no, I did not mean to imply that it was Rubylane who set the prices, but I think anyone with the least bit of internet shopping experience would see that quite clearly.However, I just purchased a turn of the century cherry etagere curio cabinet this afternoon.  It was in immaculate condition, with lamp shelves, glass cabinet doors and strong Art Nouveau elements.   It is a large piece and will compete quite ferociously with my French Provincial sofa where size is concerned.  I am sure there will be a pissing match between the two, but I've already declared no sides shall be taken and that they will have to work it out between themselves. :)   I purchased it today for less than $300 at an established brick and mortar.  It perhaps could have sold for $500 and much more fifteen years ago. I mention this only, because while on Rubylane I saw that prices for pieces of similar items where much much higher, sometimes many times higher.  This was more the rule than the exception and it applied to anything and sunder - furniture, jewelry, primitives, smalls etc.  Yet it was seldom found that a piece was important enough to justify those prices.  It would seem that the vendors on Rubylane are pricing their wares for the large metro markets.  And please it is not just Rubylane, but a number of other well known boutique sites as well. Please understand, my review was for the ordinary folk. . . the \"everyone else\", that exists outside and beyond the major metro markets.  And so this being a review site I felt the need to express my experience as such.  People will shop where they will shop and largely according to their means anyway.Besides, I am not the only person who has written a review noting Rubylanes high prices, I am simply testifying to their experience with my own.  It was precisely my curiosity on this very topic that led me to this review site in the first place. I was curious about how others felt about Rubylane's prices - I searched for reviews and lo and behold here I landed!So you see, I am only elaborating what others have already said regarding this issue here and on other review sites as well.So again, for the ordinary folk who are looking for a fair price on something of value - this is who my review was meant for.  Those for whom price is no concern would perhaps have found my review meaningless anyway.So, thank you again Mr. Spear.  I do understand you have a responsibility to Rubylane whom employs you so naturally it is within your best interest to plug the holes in the dykes where and whenever you may find them. One more thing, I never said I would never shop Rubylane again.  However, having seen the inflated pricing structure adopted by the vendors there, just makes Rubylane not the first place when looking for this or that.  Rubylane is still on my list, it's just not the first place on that list. Also, I do think it is important for those who are just beginning to venture into the beautiful world of antiques to realize is that they need to be careful if price is going to be a concern when perusing Rubylane.There are less expensive alternatives and you do not have to be wealthy to collect nice things.  You just need to be wary, take your time and not allow others to convince you of something if your inner wallet is snapping shut. :)  There is always an other \"one of a kind piece\" around the corner waiting for you to find if the one in your hand is just beyond your means.Best Regards and Be Well!Anthony", "rating": 2}, {"title": "Not Pleased", "text": "Item shipped immediately, received well packaged, however, item not as described. Description stated, \"excellent condition\". It is not excellent. Jewelry item is missing a stone! Was to be a Christmas gift. Won't give this now. So disappointed.", "rating": 2}, {"title": "Left a bid on Decemeber 6 ( #4851015) …", "text": "Left a bid on Decemeber 6 ( #4851015) and I have not received a reply from the dealer yet (November 11)", "rating": 2}, {"title": "Difficult and drawn out payment process", "text": "Never had such a difficult time trying to buy and pay for something online as I just experienced with this company.", "rating": 2}, {"title": "Lousy Payment options --Ambiguous", "text": "I F you are  using a method other than cash or money order  it was not that easy to purchase - I now have to wait for the store owner to contact me and tell me how he wants to get paid --Credit Card Pay Pal --etc --Not comfortable at all with that scenario of handing my card number over to an online  third party   Your site does not accurately re[resent the fact tha you have to dael with each shop owners payment preference  Not a very consumer e purchaser friendly site", "rating": 2}, {"title": "Pay Pal Confusion", "text": "Wonderful items, good shops to deal with, many positive purchases.What is very convoluted and difficult to understand is the payment process through Pay Pal.", "rating": 2}, {"title": "very frustrating check out experience", "text": "very frustrating check out experience. almost quit purchase attempt several times. YouTube 'how to purchase\" video....useless. Wanted to pay with CC. Simple. You have PayPal tab in place where CC tab should be, again, very confusing..unless of course it's YOUR site then you can't understand what I'm saying. Don't see me returning to your site.", "rating": 2}, {"title": "Horrible, painful and some redemption.", "text": "Had antique end table delivered to home but it was literally in pieces.  A 19th century piece in over 20 pieces.  Sad.  After several conversations, Ruby Lane did make everything right but it was not the end result either of us wanted.Moreover, I find the shipping rates often prohibitive as most retailers are now shipping for free.I like their concept but they are growing beyond their capabilities (nice problem to have) and they have inexperienced novices trying to navigate with experienced dealers and clients.They need to engage more tenured people and invest in the future and not be blind in the fact that one had to spend money to grow the business and become more strategic.", "rating": 2}, {"title": "poor interface", "text": "Date of experience: November 07, 2017", "rating": 2}, {"title": "In a weeks time I made some large …", "text": "In a weeks time I made some large purchases, over $4K worth, which caused PayPal to put a hold on all of them. One was off Etsy, one an auction house, several off ebay, and one item from RL. I wrote all the sellers to explain, and the only one I had a hard time from was the RL seller who wanted to cancel the order. I find this totally unexceptionable since I am also a RL seller. I would never have treated a customer in this way.", "rating": 2}, {"title": "Ruby Lane difficult", "text": "I find the site rather difficult to use. Today I tried to make an offer. In the block where a $$ amount is to be entered the numbers would not display.  Thinking I had made a typing mistake I reentered again & again. Therefore the amount entered & not displayed far exceeded the initial asking price which was not my intent.  This is but one of many other issues I have had.", "rating": 2}, {"title": "Navigating your page was bearable …", "text": "Navigating your page was bearable however towards the end it kind of lost me abit towards my final hurdle and purchase its such a process to purchase on line e.g eBay bad experience I shouldn't have to spend a long time on the acct new of course and go through all these boxes and emails I just want to buy the item not my entire life in a box.? to get the item it's such a frustrating experience and its everyone their has to be a better way and positive outcome for consumers thanks I've had my little whinge hope this helps.", "rating": 2}, {"title": "This is my first purchase", "text": "This is my first purchase. My first response was 8/22/17. I have had no further contact with Ruby Lane or the seller. The entire purchase experience seems outdated.Thank you.", "rating": 2}, {"title": "HI Mrs", "text": "HII placed an order and the sellers was supposed to come back to me and they didn't.Not impressedwill not recommand that sellers to poeple", "rating": 2}, {"title": "THE PAYMENT SYSTEM IS ONE OF THE WORST …", "text": "THE PAYMENT SYSTEM IS ONE OF THE WORST I HAVE EVER SEEN!BEYOND CONFUSING!IT'S EASY......GO TAKE A LOOK AT HOW AMAZON DOES BUSINESS AND COPY IT!", "rating": 2}, {"title": "You certainly have beautiful antique …", "text": "You certainly have beautiful antique chairs; the problem, and that is why you only scored two stars, is that these vendors are too lazy to arrange for shipping of the furniture. NEVER should it be the responsibility of the buyer to arrange for shipping, we are not in this business and do not have the time and expertise to be chasing movers, shippers etc... This is clearly the obligation of the seller. Please make sure you change your policy to include only vendors who will properly crate or package the furniture and arrange for shipping, otherwise I might as well shop on e-bay where similar items are much cheaper.", "rating": 2}, {"title": "I am giving the seller Of \"My Dolly …", "text": "I am giving the seller Of \"My Dolly Market\" only \"2\" stars because she agreed to lower the price on a composition doll that needs a lot of restoring work, this did not include shipping.  If she had not agreed to that than I would have given her one star for the fact that she shipped a doll made in 1920 in a box half his size! When I opened the box half expecting a broken doll I instead came upon his feet at the top. His body was bent in half with his head shoved to the bottom. He wasn't wrapped at all in protective wrapping but instead had been put into dirty used bubble wrap. The entire way he was shipped was beyond appalling, I was very disappointed as this was not a cheap purchase, even with the discount.   The doll was sent without any care nor concern with how it would arrive. I would never buy a vintage doll from this shop ever again.", "rating": 2}, {"title": "Convenient to shop  for overseas customers.......Pls", "text": "Sometimes wish to buy a small little present for myself, however I found it is difficult to fulfill my wish.  As most shops are not willing to send out of America.  For me shopping is for my relaxation and looking for a little happiness, however  I even got more tense than my work.  I like ruby land and the shops goods, as I can find something I love and can afford to buy.  Ruby lane can provide very good shopping environment for customers........except the shopping convenience for overseas customers.  Wish to see improvement in the near future.", "rating": 2}, {"title": "I thought Ruby Lane was for antiques and vintage only!", "text": "I thought Ruby Lane was for antiques and vintage. Now shops are selling non-vintage. It will water down your brand. Etsy is really better for that \"artisan\" type jewelry. Please go back to your higher standards of only antiques and vintage, not \"artisans\". Under that category anyone can import or make anything and throw it up for sale on your site at inflated prices, using Ruby Lane's good customer base. Not good for Ruby Lane's brand.", "rating": 2}, {"title": "amateurish checkout system", "text": "\"A lot of friction - no. A lot of aggravation, though\"  It is critical that you state here that this review is of the RL system as indicated, NOT of the seller who was just fine.  If not, delete this review so I can give her 5 stars.REVIEW Buying from RL used to be a snap.  Since they \"upgraded\" (which users always dread) their now rather amateurish checkout system, buying from RL has been confusing, slow, conducive to mistakes, and very clumsy.1)  We have to decline the insurance.  Why not just  an offer to add insurance???  2)  When we decline it, it doesn't show the change on the page!  So if the decline didn't go thru or if we think we declined it but didn't, we have to contact the seller to cancel the sale so we can do it all over again.  3)  There is no visible button to pay with Paypal, just PP Credit, Visa, etc.  There actually IS a button for PP, but since it is invisible, it is only for Those Who Know.  4)  There is not even the usual final page to review and alter before you agree to purchase what you can only hope is the item and price you opted for.", "rating": 2}, {"title": "Not really user friendly", "text": "Not really user friendly.  Complicated.", "rating": 2}, {"title": "Overpriced.  Lousy service.", "text": "The friction has to do with the fiction of \"copyright' for pictures.  I keep detailed records [folders] of the pieces I get, until they finally arrive, by means of dealers' pictures.  e-Bay allows me to copy them.  So does Etsy.  Not Ruby Lane., Another beef: pricing.  Years and years and dealers do not realize they have overpriced, and there is no real \"best offer\" plan.  So, dealers lose buyers.Worse.  It allowed me to pay for a piece that had already been sold. I will think long and hard before I use it again.,", "rating": 2}, {"title": "I am 68 yrs old & it wasn't easy to …", "text": "I am 68 yrs old & it wasn't easy to order.   I had to have my 21 year old great nephew to order for me.", "rating": 2}, {"title": "Sorry to say this was my first time on …", "text": "Sorry to say this was my first time on Ruby Lane. I went to the trouble to feed in all info on a necklace I wanted. At the \" place order\" time,the item was not available. Why wasn't it taken off before frustrating someone who wanted it? It was on Marcia of Santa Fe's site.", "rating": 2}, {"title": "My purchase STILL NOT SHIPPED", "text": "My purchase was paid SIX days ago.  It still has not been shipped.  I emailed the store and they said they could not find the earrings and issued a partial refund. The necklace has not been shipped to date. This is very frustrating, and I am beginning to think I will not trade with Ruby Lane again in future.  (This is not the first time I have had a problem like this. What makes you think your vendors can make their own rules? Do you not even care if a buyer gets abused??) I paid immediately after purchase and am still waiting. (Also not the first time I have heard the excuse \"my husband had a heart attack.\")", "rating": 2}, {"title": "I felt that I had to jump through too …", "text": "I felt that I had to jump through too many hoops to make a single purchase. You are not alone...but buyers want to buy!  They don't want to join, become a member, subscribe, create an account or any of the many other things being requested of the customer today. All my purchases are made through PayPal.  You and all others will sell more and faster if you just let folks buy what you are offering. One Click and I might have bought more.  This exercise has already taken thirty minutes of my time. PayPal has all my info. I trust them, it takes \"one click\" and if you need more info than what they have ...then that is probably more than I want to give you.  Perhaps I could do two clicks...one that gives PayPal permission to share certain information about me with the seller.", "rating": 2}, {"title": "Excellent", "text": "Excellent, fast and  courteous.", "rating": 2}, {"title": "I don't buy here often because the way …", "text": "I don't buy here often because the way communication is set up is always a problem. I just bought earrings and went to pay with paypal. Next screen shows me  I am trying to get a credit card with paypal. I go back a screen, because I don't need a credit card, and can't find my order for the earrings. So, I wrote to the owner. Now I see a bill from you telling me to pay but without showing me how to pay. Very silly, always.", "rating": 2}, {"title": "Terrible payment process", "text": "I have not yet received the item I purchased, so I do not know if it will meet my expectations, but I had a very negative experience when paying for it. Unlike ebay, Etsy, and every other online purchase I have made, this one was unnecessarily confusing and difficult. The seller sent me a purchase order with a link to Paypal. When I followed the link, it prompted me to make a payment to mailer1@rubylane.  I found out the seller never got the money in her account, so after investigating, discovered that my payment was unclaimed.  I canceled it, then paid the seller's request on Paypal.If Ruby Lane is to compete with the other websites that I shop frequently, the payment process must be clear and simple. The experience I had was unacceptable.It didn't help that the seller is unpleasant. Her attitude is rather hostile and aggressive.", "rating": 2}, {"title": "Horrible For Sellers", "text": "If you enjoy uploading your pictures numerous times and taking 20+ minutes per listing, you might like selling on Ruby Lane. Their picture uploading software is as antiquated as some of the items on their site. Extremely frustrating especially considering the high cost of listing! Poor seller experience! Also, I've mentioned this to Ruby Lane support a few times and they have never addressed my concern at all. (Coming from a long time seller who has been on the site since the beginning)", "rating": 2}, {"title": "Frustrated!", "text": "Very slow & frustrating!  Too much time & hard to Navigate thru it all!  Terrible experience!", "rating": 2}, {"title": "Purchase Order #4578103", "text": "You have not called me for my Visa information, nor have you responded to my query of whether I purchased the Gibney sauce ladle or if that other person, who had already put the item in his/her cart, got it first. So, without further information, I have no means of rating you (unlike the other silversmith I dealt with earlier this week).", "rating": 2}, {"title": "Vietri Cups", "text": "I ordered 4 Vietri green cups for $100 and only received 3.  Wanted a refund or the 4th cup.  Haven't heard anything.", "rating": 2}, {"title": "Confusion with PayPal and delivery address", "text": "I entered a separate billing and delivery address since I wanted the package sent to my office. When I went to make a payment, it took me to PayPal. I chose not to use PayPal and chose the credit card option which was on the bottom of the page. Apparently this still registered as a PayPal payment because the seller asked me verify the delivery address because PayPal requires it even though I didn't use PayPal. I didn't understand why I needed to do this since I didn't use PayPal and verified the delivery address with the seller. She was still insistent that she couldn't send the package without PayPal verification of my delivery address. After a long exchange of emails, I went to PayPal to add my delivery address. This still makes absolutely no sense. Make PayPal the only payment option since everything registers on PayPal anyway. Again I did not use PayPal but the seller was insistent that I follow PayPal rules before she sent the package. Your process made something which should've been simple needlessly complicated.  I am very unlikely to use this site again", "rating": 2}, {"title": "Frustrating", "text": "I tried to buy a small china doll from one of your dealers but kept being returned to the same point where I couldn't figure out what I was doing wrong.  I  was unable to buy her and gave up.  My husband who works all day on computer tried and couldn't do it either.  Frustrating!mel odom", "rating": 2}, {"title": "Unexpected customs charge slapped on.", "text": "Had to pay £17.51 customs charge (including handling fee) to receive my purchase (on top of the agreed shipping charge). This should surely have been cleared at the seller's end? Not happy!", "rating": 2}, {"title": "Carnival glass item", "text": "Item has a burst bubble on base that was not mentioned in listing.", "rating": 2}, {"title": "Poor photos", "text": "Photos are key to an online website. Ruby Lane doesn't get that.", "rating": 2}, {"title": "Not user friendly", "text": "Not easy to buy item in the moment you want it ,from this platform.", "rating": 2}, {"title": "Lack of communication", "text": "This was my first time ordering from Ruby Lane.The amount of items available is astonishing and I was amazed to find exactly what I wanted.  I did have to trawl through many pages to find it but the search bar does allow you to put in your requirements to help narrow the search somewhat.I placed my order from the Antiques Storehouse and received an email from Ruby Lane but was concerned that I didn't receive an email from the Antiques Storehouse themselves.  I still hadn't received an email from them after 3 days so emailed them to ask why which was not answered.  They, also, didn't send an email out to notify me of the dispatch of my item.I received the item on the 6th day.Due to this lack of communication I would not use the Antiques Storehouse again as I'm concerned that that the lack of customer service would be problematic if I had an issue with items purchased from them.", "rating": 2}, {"title": "The quality of the product purchased was quite disappointing.", "text": "The pictures of the cross I purchased showed the front and back of the item.When the we received the cross, the back was removed. It can not be worn in this condition.Very sad deception, I would not order from Ruby Lane again.", "rating": 2}, {"title": "Feel railroaded into paypal", "text": "Very confusingCan't tell if my sale went throughRequired paypal OR credit card but also required accepting cookies.Seems to have gone through as Paypal which I do not want - even though I entered my own credit card after clicking credit card'  As far as I can tell, you have my credit card info and so does Paypal but the item is not available to me.Have NEVER had this problem in buying things from Ruby Lane before.Please tell me the status of my order", "rating": 2}, {"title": "Item not received", "text": "Purchased and paid 8/16, as of 8/29 item not received", "rating": 2}, {"title": "Horribly horribly confusing checkout...took me 1/2 hr !", "text": "Checkout was entirely confusing. I have several shops on etsy and this took me 1/2 hr back and forth several times. I wanted to use regular old PayPal. There was no way around PayPal credit. Then I went back to just use a credit card. Somehow, I finally got the standard pay pal button to appear and clicked on that. That finally processed my order. I was /am concerned I may be charged twice since at one point I had entered my credit card. Not fun.", "rating": 2}, {"title": "ALWAYS AN ISSUE", "text": "NEVER GOES SMOOTH WHEN ORDERING . ALWAYS UNSURE IF MY ORDER WENT THROUGH OR IT QUESTIONS MY PMT. METHOD OR WANTS ME TO APPLY FOR SOMETHING LIKE PAY PAL WHICH I ALREADY HAVE.", "rating": 2}, {"title": "website hard to use and buggy", "text": "i thought it was difficult to understand how to use, and i couldnt change my payment method and ended up accidentally using paypal...", "rating": 2}, {"title": "We no longer have that shop on Ruby Lane", "text": "I thought I ordered a tea strainer and was told I would receive an email from the saler with the details.  I waited 2 days but I never got the email.  I checked back on the Ruby Lane site only to see \"We no longer have a shop named renaissancefineantiquesofnewengland on Ruby Lane.\". I was disappointed that I did not get a response back from Ruby Lane the same day I placed the order stating they no longer have this shop on their site.  I wanted this for a birthday gift.", "rating": 2}, {"title": "Milk glass", "text": "Please add a place for using a credit card when checking out. I do not use pay pal, and was afraid to finalize my order by clicking on it. So I clicked on paying by check. I have sent the check, but have not heard from the company.", "rating": 2}, {"title": "Bad Link Between PayPal and Ruby Lane", "text": "I ave a valid PayPal account and tried to use it to pay for an item on Ruby Lane. Between Ruby Lane and PayPal, the whole transaction was lost. My cart is shown as empty and the seller has not been paid. They are going to have to send me their own link because yours doesn't work.", "rating": 2}, {"title": "No item, unexplained refund", "text": "a day after purchasing an item I got an email notifying me of a refund, but with no explanation.  It may take a month for the refund to post, but I got nothing.", "rating": 2}, {"title": "Very confusing set up and check out....", "text": "Hello, the seller was very good, responded quickly to me questions. Great job. BUT,it took at least an hour of trying to set up and make an offer to ruby lane ,after trying to call ,emailing and return email I finally made the purchase . The fact that ruby lane has a YouTube Vidio on how to purchase things my be a clue.... simplify your process ,please.", "rating": 2}, {"title": "Why is my PayPal account not working for purchases?", "text": "Some needs to help  me with my Pay Pal, or I will not return to Ruby Lane", "rating": 2}, {"title": "Item substitution", "text": "I just bought something but during checkout a different item was substituted.  I am not sure which one I am getting!  Not very happy.", "rating": 2}, {"title": "No backup!", "text": "I have been receiving information from your company for some time now.  I assume that to do that I would have had to provide my email address as well as a password.  However, when I finally do try to make a purchase, my information is \"wrong\".  I finally had to go through Facebook to make my purchase.", "rating": 2}, {"title": "Beware of Past Wares", "text": "I have had excellent luck with all of my purchases in the past. But recently I ordered a cake pedestal from Past Wares, and it arrived with a brown stain on the lip of the plate that was visible from across the room.... I was told it was ash, from the blowing process... but it was chocolate cake, buried in a flaw bubble in the glass.  I was able to clean it fairly easily, but a good seller should have taken care of it.... and not credited it to manufacturing in the old days. When I first complained, she was willing to take it back with all sorts of caveats. I ended up keeping it, because it was cleanable.", "rating": 2}, {"title": "Communication slow or worse", "text": "Several sellers on Ruby Lane are slow to communicate or don't communicate at all.  Some sellers take days or weeks to answer questions or offers.  Some items are being advertised and when purchased are not able to be found to ship. Seems like an little advertised site that has little interaction with the sellers to keep them up to par.", "rating": 2}, {"title": "this is weired!!!", "text": "I don't feel comfortable ordering something from an individual somewhere else.  I cancel my order.", "rating": 2}, {"title": "damages Doll", "text": "Received my order, and one of the dolls, Alfalfa, had half of his head broken off. This damage was already done as the parts were in a little plastic container. The seller never stated the damage on her site.  Very bad business to do this.", "rating": 2}, {"title": "Buying on Ruby lane", "text": "Just bought an item off of this site for the first time. I thought the shipping and insurance charges were rediculas, but as it was an item my wife really wanted. I paid it anyway. The site was fairly easy to use. I like using ebay much better.", "rating": 2}, {"title": "Pemba Doll", "text": "The seller indicated that the doll had not been removed from the box and was in good condition. When I received the doll I was surprised to find that the shirt and pants are both faded, as if they were exposed to strong sunlight.  This was my first purchase from one of your vendors and I am very disappointed in the erroneous representation of the condition of the doll. J", "rating": 2}, {"title": "Partial Refund, paid TWICE for shipping!", "text": "Had to pay to have my purchase shipped. I realized it wasn't what I was expecting and had to pay even more to ship it back, which would have been fine, had I been given a full refund. Instead, I have now paid over $19 in shipping charges on a $39 item. I don't get it. Very poor customer service. Email regarding this went unanswered. I'll never shop here again.", "rating": 2}, {"title": "Tried to cancel layaway after just 5 days", "text": "I tried to cancel layaway after devastating personal news and would not return any of the down payment money and I just put in layaway 5 days earlier. I would understand keeping some of the money but refused to return any of the $200.00 I just paid. This is not acceptable and will not ever do another layaway.😕", "rating": 2}, {"title": "Too Old For All This", "text": "Checking out was a nightmare.  On one item I clicked to skip the insurance.  When I tried to check out, it was still included.  I wanted to contact the dealer, but I couldn't find an address.  If it was there, it was hidden.  I'm used to Ebay's and etsy's clarity.  I didn't buy the product and probably won't shop with Ruby Lane again.  No friction.  However, they sent me instructions on how to check out.  They were as clear to me as completing an IRS form.", "rating": 2}, {"title": "Shipping problem", "text": "I tried to purchase three small items from a seller. He/she was rude and curt. I live in Canada and I asked for the items to be shipped to me. The response was curt and no explanation was given for the seller's refusal to ship to Montreal. \rIn the end I found a friend in the US and the items are being shipped to her. This is inconvenient and annoying. We live in the 21st century. Canada is just a stamp away. And if it is really impossible to ship- a nicer more polite note would help greatly. \rI am not sure I will be back.", "rating": 2}, {"title": "Website glitches", "text": "I love browsing and purchasing from Ruby Lane, but in the last few weeks I have had a terrible time trying to communicate (you don't like my password any more) and even purchase using Paypal.  YOU try to purchase an item and see how many things can go wrong and how long it takes.  I have two more wishes, but have gotten temporarily discouraged from trying to purchase them.", "rating": 2}, {"title": "Ruby Lane search engine stuck in the 20th century", "text": "Ruby Lane needs to come into the 21st century - its technology is like it was when we all started using the internet 20 years ago.  The search engine is extremely limiting.  If you do not write the search words exactly like RL has it set up, you are going to miss out on some wonderful items that dealers have listed and are trying to sell.  For instance, if you are looking for a chalkware cat, if you just put chalk cat, you will not fine chalkware.  If you write \"wooden\"  then anything with \"wood\" does not come up.  A recent experience:  I was researching silent butlers or crumb catchers.  About 20 or so came up, but then chairs, jewelry, china, and glassware came up under our search for silent butlers.  I'll bet there were other silent butlers out there that I never found.   \r Please update your search engine to call up more items in the proscribed search.", "rating": 2}, {"title": "Payment options", "text": "There is no PayPal payment option.  That makes secure purchasing a problem.", "rating": 2}, {"title": "Lots of room for improvement", "text": "This was a very difficult purchase. The screens would scroll correctly. I kept being referred to filling out and renewing information same thing several times. If you lack info on me, give me one screen and have all you need on it.\rIt probably took nearly one hour of my time to make this purchase.  I was determined to get it . Th quiestion bars could seldom find my jacket, so I had to try several many times to locate it, and pin down the purchase.  what A HASSLE,!,!!", "rating": 2}, {"title": "Limited Payment Options", "text": "You can't pay with a credit card. That's very limiting and surprising in this day and age.", "rating": 2}, {"title": "Very difficult system", "text": "I have shopped many websites and never have I been so confused as to how to check out. A very complicated system and not like others I have done. I still have no idea if my own credit card will be accepted for payment which is how I have always done all my purchases. I don't like to go through PayPal.", "rating": 2}, {"title": "do not trust paypal", "text": "When the options are paying thru paypal or money order - I would rather contact the store directly - i DO NOT TRUST PAYPAL ... 3rd party payers", "rating": 2}, {"title": "Much too much consusion between different vendors", "text": "My clients and I sat down to select some artifacts for their decoration.  We proceeded as though your multiple vendors were operating under the same kind of system as Amazon.  After weighing through 173 pages of orders, maybe $2000, we learned that we had to go back through again and order each item separately from each vendor.  Even then, now my mailbox if filled with messages that are either receipts or invoices--and there's no telling whether the latter were actually already paid for at the time of the order.  Very troubling experience that I shall be unlikely to use again.  There should be exactly descriptions on you Home Page of how to use your site.", "rating": 2}, {"title": "Inability to Use or Confirm Coupon Code", "text": "I tried contacting Ruby Lane directly to use a 60% coupon code (\"ballet\") before placing an order, but was told to reach out to the seller directly instead, which I did.  The seller also had no idea how to proceed, since there was no option to even enter the code before my payment was processed.  As it turned out, a purchase order (#4086102) was generated anyway even before I had the chance to enter my payment information.  I called the vendor back to explain & she was equally confused.  Please advise as I've never had this much problem using a coupon code before.", "rating": 2}, {"title": "checkout", "text": "I have not even got to pay for my order yet .  when I clicked on paypal and the credit section  ,nothing happened so i clicked on something else and that screwed up everything .  so now i am waiting for shop to tell me what to do now.  Beverly", "rating": 2}, {"title": "No information", "text": "I'm getting no answers and have no idea what's going on with my order!! Extremely frustrated!!!!!", "rating": 2}, {"title": "ruby lane;dolls", "text": "i occasionally check the listings on ruby lane and i find the same dolls there,month after month; this does not encourage me to browse,and,as i like a certain type of doll,i can remember them as being listed,and for quite a while. sometimes a seller will reduce a price,and still,it stays listed; i would suggest encouraging sellers to change up their stock,if it doesnt sell after a reasonable time,take it off.i also bought and paid for an item only to have the seller email me,days after accepting my paypal,to tell me she had 'misplaced' the item; this was totally unacceptable and has left a bad feeling.", "rating": 2}, {"title": "Fourty Fifty Sixty shop", "text": "During the past two months I have purchased several items totalling app. $1500 from the Fourty Fifty Sixty shop. The last purchase was the most expensive doll offered by the shop. Last week I enquired about best price on an item. I was shocked to receive a very rude response stating I was difficult because I was asking about a lower price, and therefore not respecting the fact that this is how they earn their living. They certainly didn't find me difficult on the first purchases!\rFortunately, this is my first experience on Ruby Lane with such nastiness. Not to mention very poor business ethic and customer relations.", "rating": 2}, {"title": "Bought a pendant that said it had demantoids but it had peridots", "text": "Seller misrepresented the types of stones in the pendant so the experience was disappointing.  I took the pendant to a GIA Graduate Gemologist today to see if the stones were demantoids and he said that they were peridots.", "rating": 2}, {"title": "inadequate", "text": "A few changes to your format would make shopping Ruby Lane more user friendly.\r 1)  Offer customers the ability to sort categories by \"newly listed\" (date item was added to Ruby) -- Why?  Customers do not want to pour through same items when looking for new additions.  In fact, I will often get so annoyed with pages of items I have already seen, that I will click out of site before finishing my search.  \r 2) Offer email notices when specific \"watch\" items are added to site.  (Similar to online Auction sites, customers would receive notices when items they are interested in are added to Ruby Lane.  As it is, customers have to remember to go to Ruby Lane and look through pages of undated items to see what, if anything, has been added.  Often I will not bother because I don't have time.  I use other web sellers / auction houses to shop.)", "rating": 2}, {"title": "Not easy, thanks to Paypal", "text": "I bought one item.  I received confirmation for another..  Paypal did not let me use my bank account, charging it instead to Paypal credit.,  I cannot even download the pictures of what I bought: a Blue square Papillon", "rating": 2}, {"title": "Problems with payment page", "text": "Helpful and supportive shop owner, goods fine (were as displayed, arrived nicely packed and in reasonable time), site easy to use. BUT the payment page did not work properly. It took many attempts and nearly 48 hours of emails to confirm the sale. RL could show more respect for customers (and shop owners) by adequately testing and monitoring that pages work properly. Frustrating? Certainly. Risky? Absolutely.", "rating": 2}, {"title": "Need one check out process for all items", "text": "Love the items for sale, hate the check out, and especially the shipping costs that were all over the place. Expect better than this. Seems like they are stuck in the 1990s.", "rating": 2}, {"title": "Good items, poor usability", "text": "Need to be able to sort by price and by newness. Just choosing price ranges (not even custom) and \"today\" / \"this week\" is not sufficient. Need to be able to check out with multiple merchants at the same time. I have bought items listed on your site on etsy, ebay et al because your site is too annoying to use. I want to like it!", "rating": 2}, {"title": "Poor shipping quality", "text": "Item was poorly packed,\rIt might have been packed ok for shopping at an antique mall;\rbut was poorly packed for shipping.\rI think that sellers should learn how to pack for shipping.\rmaybe have a video or letter on how to pack for shipping.\rItems will be dropped and banged and thrown about during shipping.\rItem I had bought didn't even have \"fragile\" written on the box.\rWould be nice to know that the sellers knew what they were doing.", "rating": 2}, {"title": "Very confusing site, poor user experience from the fullfillment perspective", "text": "Ruby Lane has many great items for sale, and it is a pleasure to browse.\r The sign-in mechanism is somewhat clumsy, not so much from the fields to be completed but the way color, space and positioning are used.\r This however pales into insignificance when faced with the daunting task of trying to navigate through the Purchase and/or Contact Seller parts of the fulfillment process.\r I am an experienced purchaser on both Ebay and Etsy, as well as having made a few purchases on Ruby Lane over recent years, and without doubt Ruby lane is the worst experience of the three. It is frustrating, convoluted, difficult to navigate and seems, in comparison with the other two sites, something that defies logic as a matter of routine. It appears to have been put together without either common sense or concern for the user experience.\r I can appreciate Ruby Lane wishing to contrast itself with the other sites. but this outcome ranks as a dismal failure. For better or worse Ebay has a far superior process, and Etsy, while not quite as good, is still far superior to Ruby lane. I suggest some time is spent analyzing how they do it; then trash the current Ruby Lane process and start again.", "rating": 2}, {"title": "Customer Support Failed to Deliver", "text": "Usually I have excellent dealings with Ruby Lane. Last week I received an email requesting how my purchase experience had been with a certain Shop with which I had several past purchases. I replied with positive comments but was concerned as I had an ongoing Layaway with 1/2 the funds still owing.\rRuby Lane replied that the Shop was no longer a R/Lane Shop. This was of concern so I emailed the Shop owner with no result and R/L said they would Contact her as well. I did not have any satisfactory result and neither did R/Lane.\rThe situation is that Customer Support has a Complaint process but because my Purchase was a Layaway there's not much they can do. Shop Owners have the advantage here and unless my Credit Card issues a Refund I have lost approx $100.00.\rI did try Telephoning the Shop owner but it turned out her address is in one EU country and her phone no in another EU country. Obviously vetting Shop credentials in this instance was less than satisfactory.\rI'm fairly upset and emailed R/Lane that they must have known when they emailed me first that the Shop was removed and they should have been upfront about it and as the Shop offers Layaway there must be more than 1 unhappy Purchaser. They have access to all a Purchasers history otherwise how would they have known to contact me.", "rating": 2}, {"title": "Payment Problem", "text": "Paid for my purchase on Ruby Lane, didn't work.  Had to speak with seller directly to make payment.  Unacceptable transaction.", "rating": 2}, {"title": "Much to slow response", "text": "Found cruet and sent check immediately. Called to let lady I was sending check. Now after 6 days she has check but will wait for check to clear before sending cruet. On EBay with credit card I have 2 or 3 day delivery. Will not be using Ruby Lane again.", "rating": 2}, {"title": "a bad experience at ruby lane.", "text": "i love ruby lane but i thought satisfaction was guaranteed.seller did not misrepresent item i bought. not thinking i bought an old necklace which is so small i cannot fasten it around my neck. i am unable to find an extension that will match it. i have looked all over the internet.this seller is refusing to allow me to return the necklace.i am stuck with it. an almost $100. item which is of no use to me. yes she did say it was only 15 inches long but i liked it so much that i really did not even consider that.i have bought many things from ruby lane and i have loved each and every one up to now.i have never returned or wanted to return any other purchase. i still like ruby lane.", "rating": 2}, {"title": "check out too complicated", "text": "I  HAD A VISA CARD IN HAND TO PURCHASE THIS, MY FIRST FROM RUBY LANE. IT WAS A HASSEL, BECAUSE IT SEEMS YOU PEOPLE ONLY WANT PAY PAL..SO NOW I DON'T KNOW WHAT METHOD I USED TO PAY, BUT THIS WILL PROBABLY BE MY LAST PURCHASE FROM YOU.  I WONDER IF I WERE STANDING IN FRONT OF YOU IF YOU WOULD ACCEPT CASH?  THIS THING OF THE SELLER TAKING CHARGE OF HOW A CUSTOMER PAYS IS OVER THE TOP.", "rating": 2}, {"title": "Clea Vintage Perfume", "text": "I purchased the Clea vintage perfume from Carolyns Fine Things.  The ad says the bottle was never opened.  When I receved the backage, it was well packed, however, when I opened it, the box was not covered with the original clear wrap, abd the bottle inside the box was not cealed, it was opened before I opened it.  I know the frangrance very well because I am from the generation that used it a lot, and the smell is absolutely different.  I am very disappointed and returning the product back.", "rating": 2}, {"title": "Too difficult to maneuver and check out properly", "text": "I have only purchased a few items via rubylane because the check out process is confusing. There is not a clear process like there is on etsy and ebay. I have had to ask instructions from buyers and I don't understand having to create a purchase order and then no option for paypal, just debit or credit card. I do not buy as much as I would like to because of this.", "rating": 2}, {"title": "Very Uneven Experiences, Some Terrible", "text": "I've bought many items and found some good Sellers - but have also had some absolutely terrible experiences with unscrupulous Sellers that are not only rude, unprofessional and nasty - but dishonest.\r I MUCH prefer to buy in sites where Sellers have individual feedback.", "rating": 2}, {"title": "Website upgrade", "text": "As a dealer and collector I buy often on eBay, Etsy and also Rubylane, I can say that I strongly feel you need to make the correspondence pages much easier to navigate and sort. Also the Purchase Order/Questions sections are difficult to navigate. My opinion is, to stay competitive, a website upgrade would be extremely beneficial. \rThank you\rLori Leven", "rating": 2}, {"title": "I purchased the item on April 22  and I have yet to hear from the shop", "text": "As a dealer on RubyLane, I am committed to providing excellent comunication between my customer and myself.  I always acknowledge the purchase when the order is placed.  I have yet to hear from the dealer who\rI placed an order with yesterday..  This takes alot of the joy out of the purchase- not knowing the status of your order especially when I already paid.", "rating": 2}, {"title": "Mobile App Badly Needed", "text": "The mobile experience is generally awful, and what they need is a great app that allows you to do search quickly.", "rating": 2}, {"title": "Terri Lee", "text": "I bought a Terri Lee doll and I guess I didn't ask enough questions as she came with hair that has to be re-done and she needs re-stringing. I don't know if I can do her hair if not it's just wasted money.", "rating": 2}, {"title": "shipping", "text": "I purchased a similar item from new York to Nebraska shipping was 60 dollars and from Chicago to Nebraska they said two hundred... That was standard. You may wanna rethink this.", "rating": 2}, {"title": "New Website is not user friendly", "text": "Ruby lane has some wonderful items and every vendor I have worked with has been great. However, since the website was updated, rhe shopping experience is not as fun. I did contact customer service and the response was 'change is hard but they are sure I will get used to it.\"  My complaint was the Sales price vs. original had gone missing (now fixed). The short text that gave some idea about the item is gone (still is) and the number of days from last update is missing which I discovered since can be found if you select the Edit button. There are still issues. Old site always retuned you to where you were. It's not consistent now. The email alerts is buggy. There should be a way to X out once read. I still have items flashing although I have read it, opened the item and it still remains. Shop Ruby Lane, but don't hire their website designers.", "rating": 2}, {"title": "paypal", "text": "every time I pay with paypal, I have to change my paypal password...not sure what's going on with that...a glitch somewhere?  Also, the purchase orders say that the sale is pending AND that the invoice has been paid. One or the other would be better...less confusion for newer customers.", "rating": 2}, {"title": "Ruby Lane?  Maybe Not", "text": "One vendor \"sold\" me an item (at what was a very good price- relative to \"market\"), then emailed and indicated like \"sorry, the item is lost, we just can't find it in our inventory\" and the other very similar item (same maker, different design)-- the same thing happened to it.  This was suspicious-- why would a vendor have an item, email confirmation they would ship upon return, and then say they couldn't find it?  Maybe not \"Ruby Lane\" fault, but vendors should keep agreements.\r A second vendor had an item (priced over $6K) that was clearly mislabeled as French porcelain, and implied that it has been made for Marie Antoinette!, as \"18th c. Queen's Factory Rue Thiroux, Paris porcelain\" when in fact it is a common pattern easily recognized as one by Coalport, an English maker.  I emailed Ruby Lane.  The listing (a month later) hasn't changed.  So I now know that that vendor isn't being held to account by the host, and will not trust other listings by that vendor.", "rating": 2}, {"title": "Poor customer service fo rmy purcahse sellers error after all.", "text": "I bought an antique dress ,  to include underclothing Four pcs in all.   When the package arrived  I thought the dress was too fragile and really just barely stitched.  Hand made but not really good.  So she had neglected  to send the other two  pieces.  I wanted to return and I paid for full shipping/insurance full amount of charge for items,  yet only receiving half of my purchase.  I felt since she didn't ship the total item she should have given half the shipping cost back. I was after all saving her money if I had kept the item she would have to ship again to me and it would cost on her end. To do it right.  I did tell her my thoughts.   But she did not refund any part of shipping due to her error..", "rating": 2}, {"title": "Really Bad Experience", "text": "I contacted Ruby Lane 7 days after a purchase regarding the seller not providing shipping information and Ruby Lane told me that \"my e-mail may not be working properly.\"  Really.....my e-mail.....the seller didn't correspond  with me regarding shipping my item for 11 days and then only after I filed a case with PayPal.  Then the seller got irrate that I filed a claim.  Ruby Lane is not a good place to deal with as they do not help the purchaser with problems with sellers.  I won't be shopping with them again.", "rating": 2}, {"title": "VERY UNHAPPY EXPERIENCE. MY MONEY BEING HELD UP IN RUBY LANE ACCOUNT(?).", "text": "I LOOKED FOR CLIP-ON EARRINGS. LISTED UNDER CLIP-ON EARRINGS WERE A PAIR OF PIERCED EARRINGS. NOT KNOWING THEY WERE PIERCED EARRINGS, I ORDERED THEM--THEN GOT INTO AN UNNECESSARY SQUABBLE WITH THE SELLER BECAUSE SHE SAID I SHOULD HAVE KNOWN THEY WERE PIERCED EARRINGS!!! THE LISTING BY RUBY LANE WAS FALSE--ITEM WAS LISTED UNDER CLIP-ON EARRINGS. I RETURNED THE EARRINGS AFTER MUCH HAGGLING AND TIME-CONSUMING EMAIL MESSAGES WITH THE SELLER; MY MONEY IS NOW STILL TIED UP WITH RUBY LANE, AND I WILL HAVE TO ORDER SOMETHING IN ORDER TO BE REIMBURSED. THIS IS POOR ADMINISTRATION AND I SHOULD GET MY MONEY BACK INSTEAD OF HAVING IT HELD IN MY ACCOUNT. WHAT IF I NEVER BUY ANYTHING AGAIN FROM RUBY LANE. WHERE IS MY MONEY????", "rating": 2}, {"title": "Disappointed in ethics of antique  jewellry vendor", "text": "Most disappointed in a sale a lost, not simply because I lost it. This happens to us all, and acceptable when we are aware of the parameters of the process. I was in online conversation about some visual details on a piece. The vendor made little attempt to understand what I was asking, then asked me to wait as she had shipped item out, and she'd get back. I got back, resumed dialogue and in the midst of this was told they'd been just sold to a regular customer by phone. I liken this to a discussion over a piece with a vendor, where someone jumps in behind you , waves some cash and says I'll take it!    Not done..\rIn my view the vendor should have told me of the other interest, given me first dibs, as I had been conversing about this with her for over a week... Smacks of opportunism, and in the least, very rude. My thoughts are that she gave the heads up to her \"regular client\" that someone else was interested, and cemented a sale with a client who was more valuable to her for the future. This is unethical .\r   sold to", "rating": 2}]